[
  {
    "id": 1,
    "title": "556391117",
    "category": "Uncategorized",
    "summary": "This ruling admits Pacific Gas and Electric Company's workshop report on long-term gas transition scenarios and party corrections and clarifications into the proceeding record of the rulemaking to ensure safe and reliable gas systems in California.",
    "url": "/documents/556391117.pdf",
    "lastModified": "2025-03-03T21:12:16.009Z",
    "size": 145864,
    "author": "Purchia, Robyn",
    "creationDate": "2025-02-06T21:11:26.000Z",
    "pageCount": 3,
    "producer": "Microsoft® Word for Microsoft 365",
    "textContent": "555965874 - 1 - ALJ/RP6/DVD/jnf 2/6/2025 BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Perform Long-Term Gas System Planning. Rulemaking 24-09-012 ADMINISTRATIVE LAW JUDGES’ RULING ADMITTING PACIFIC GAS AND ELECTRIC COMPANY’S NOVEMBER 14, 2024 WORKSHOP REPORT AND PARTY CORRECTIONS AND CLARIFICATIONS INTO THE PROCEEDING RECORD This ruling admits Pacific Gas and Electric Company’s (PG&E) “Long- Term Gas Transitions Scenarios: Joint Agency Presentations November 14, 2024, Workshop Report” (Workshop Report) and party corrections and clarifications to the Workshop Report into the proceeding record. 1. Background On October 21, 2024, the Administrative Law Judges (ALJs) noticed a virtual workshop and directed PG&E to create an after-workshop report. On November 14, 2024, the Commission’s Energy Division hosted the workshop with presentations from the California Air Resources Board and California Energy Commission. 1 On December 13, 2024, PG&E served its Workshop Report to the entire service list. 1 Available at https://youtu.be/VnMsFfNw26U. FILED 02/06/25 04:59 PM R2409012 R.24-09-012 ALJ/RP6/DVD/jnf - 2 - On December 16, 2024, ALJ Robyn Purchia issued an email ruling directing entities that participated in the workshop to review PG&E’s Workshop Report and distribute any corrections and/or clarifications to the service list. On January 10, 2024, three parties provided proposed corrections and clarifications: The Utility Reform Network (TURN); Coalition of California Utility Employees (CUE); and Utility Consumers’ Action Network (UCAN). IT IS RULED that: 1. The Long-Term Gas Transitions Scenarios: Joint Agency Presentations Workshop Report included in Attachment A is admitted into the proceeding record. 2. TURN, CUE, and UCAN’s comments and clarifications included in Attachment A are admitted into the proceeding record. Dated February 6, 2025, at San Francisco, California. /s/ ROBYN PURCHIA /s/ DAVID VAN DYKEN Robyn Purchia Administrative Law Judge David Van Dyken Administrative Law Judge R.24-09-012 ALJ/RP6/DVD/jnf ATTACHMENT A Workshop Report and Party Comments"
  },
  {
    "id": 2,
    "title": "556407100",
    "category": "Uncategorized",
    "summary": "The document appears to be a report summarizing a November 14, 2024 workshop hosted by the California Public Utilities Commission (CPUC) regarding long-term gas transition scenarios, which featured presentations from the California Air Resources Board (CARB) and the California Energy Commission (CEC), followed by a question and answer session and public comments.",
    "url": "/documents/556407100.pdf",
    "lastModified": "2025-03-03T21:12:19.764Z",
    "size": 4252815,
    "author": "Hayley Goodson",
    "creationDate": "2025-01-11T01:49:24.000Z",
    "pageCount": 77,
    "producer": "macOS Version 12.6.5 (Build 21G531) Quartz PDFContext",
    "textContent": "RULEMAKING R.24-09-012 LONG-TERM GAS TRANSITION SCENARIOS: JOINT AGENCY PRESENTATIONS NOVEMBER 14, 2024 WORKSHOP REPORT ISSUED: DECEMBER 13, 2024 FILED 02/06/25 04:59 PM R2409012 -i- GAS LONG TERM PLANNING SCENARIO NOVEMBER 14, 2024 WORKSHOP REPORT ISSUED: DECEMBER 13, 2024 TABLE OF CONTENTS I. Introduction .......................................................................................................................... 1 II. Background .......................................................................................................................... 1 III. Welcome and Opening Remarks .......................................................................................... 2 IV. Overview of 2022 Scoping Plan for Achieving Carbon Neutrality.......................................... 3 V. Overview of CEC Gas Assessments .................................................................................. 16 VI. Discussion and Public Comment ........................................................................................ 21 VII. Conclusion ......................................................................................................................... 26 Appendix A – Workshop Agenda ...................................................................................... AppA-1 Appendix B – Gas Long Term Planning Scenario Workshop Presentations by the California Air Resource Board and the California Energy Commission .............................. AppB-1 -1- I. Introduction On November 14, 2024, the California Public Utilities Commission (Commission or CPUC) hosted a workshop in the Order Instituting Rulemaking (OIR) to Establish Policies, Processes and Rules to Ensure a Safe and Reliable Gas Systems in California and Perform Long Term Gas System Planning (Gas Transition OIR or Rulemaking), Rulemaking (R.) 24-09-012. The purpose of the workshop was to (1) provide insights for gas utilities, stakeholders, and the Commission on developing a range of gas transition scenarios, (2) develop a better understanding of gas demand scenarios that may be considered in the Gas Transition OIR, and (3) understand inputs and assumptions used by the California Air Resources Board (CARB) to develop the 2022 Scoping Plan (Scoping Plan) and the California Energy Commission (CEC) to develop Gas Demand Forecast assessments, some or all of which the gas utilities may incorporate into future scenario analysis work. II. Background On September 26, 2024, the Commission opened a new Rulemaking to continue the work of R.20-01-007 along with potential new issues that may need to be examined in resolving some of the outstanding issues. 1 The Rulemaking noted the following: “The policy complexity and technical considerations for transitioning away from fossil gas will require close coordination among State agencies over a long-term planning horizon. No process currently exists to coordinate gas planning across utilities, over time or with related activities and State goals” 2 and “To achieve California’s decarbonization goals and effectuate an equitable gas transition, a coordinated, iterative, and long-term planning process will help the State agencies and utilities align initiatives related to gas system planning efforts and analytics”. 3 On October 21, 2024, Administrative Law Judge (ALJ) Van Dyken and ALJ Purchia issued a Ruling Providing Workshop Notice (ALJ Ruling). The Ruling indicated that the virtual workshop would feature staff presentations, followed by opportunities for questions 1 R.24-09-012 at p. 1. 2 Id. at p. 6. 3 Id. -2- and answers and public comment. Additionally, the ALJ Ruling indicated that Notice of the workshop would be posted on the Commission’s Daily Calendar to inform the public that a decisionmaker would be in attendance. PG&E was directed to prepare an after-workshop Report and distribute the Report to the service list by December 13, 2024. 4 The Workshop Agenda was served on the service list on November 12, 2024. A copy of the Workshop Agenda is included in Appendix A to this Report. The CPUC’s Energy Division Staff (Kristina Boyaci and Eileen Hvalka – co-leads for the CPUC’s Gas Transition OIR) facilitated the workshop. The workshop was held from 10:00 am to 11:55 am and included opening remarks from CPUC Commissioner Karen Douglas, CARB Chair Lianne Randolph, and CEC Vice Chair Siva Gunda, and presentations on CARB’s 2022 Scoping Plan and the CEC’s Gas Demand Forecast Assessments with an opportunity for workshop participants to ask clarifying questions and/or provide public comments. Panel presentations are also included in Appendix B. III. Welcome and Opening Remarks Commissioner Karen Douglas, California Public Utilities Commission welcomed workshop participants, Chair Randolph, and Vice Commissioner Gunda and expressed appreciation for their participation in the workshop. In the long-term gas transition planning work, scenario analysis is an important tool for assessing the trajectory of change and developments in the gas sector. There are multiple transition paths with potentially different impacts or effects relative to customer rates, infrastructure needs, reliability and other factors. A scenario-based analysis with a long-term view will allow the Commission and other state agencies to track and monitor progress against real world changes, provide critical insights into system needs, while we continue to learn. Commissioner Douglas expressed hope that by integrating insights from today’s workshop presentations and subsequent comments from stakeholders and parties, the gas utilities will be better positioned to develop thoughtful scenarios that incorporate key input and assumptions that will be informative to long-term planning. Chair Liane Randolph, California Air Resources Board thanked Commissioner Douglas for her leadership and Energy Division Staff for working together with staff from CARB and the CEC to plan for the transition of the gas system in support of the state’s work to achieve carbon neutrality. The 2022 Scoping Plan lays out a technologically 4 ALJ Ruling at 2. -3- feasible and cost-effective path that transitions away from fossil fuels to clean alternatives. The focus must now be on rapid deployment and implementation of zero emission vehicles, electric appliances and increased renewable generation (electric, wind, solar), and ramp up hydrogen at scale. Between now and 2045, the electricity sector will need to support decarbonization efforts across transportation, buildings and industry, and this requires sustainability build rates of all these things, of the renewable resources, of the zero carbon technologies, of grid integration solutions, energy storage, demand response, and other innovative approaches that ensure a reliable, affordable, and resilient grid. In parallel with the expansion of the electricity sector, we need to ensure that the gas system continues to operate reliably and that residents who are the least able to decarbonize don't unduly bear the burden of that transition. Planning efforts really need to consider scenarios that reflect the system wide changes necessary to achieve our climate goals. The work completed thus far by the CPUC, CARB and the CEC to integrate the inputs from planning efforts will allow us to think about the right planning scenarios that should be analyzed and studied in addition to the policy strategies necessary to achieve our very ambitious, but achievable, goals. Vice Chair Siva Gunda, California Energy Commission expressed appreciation to Commissioner Douglas and commended her for her leadership. Vice Chair Gunda recognized the complexity of the gas transition and collaboration of Energy Division staff and sister agencies over the last several years to move this important work forward. Vice Commissioner Gunda noted that the gas transition is occurring holistically between electricity and natural gas, and petroleum and many other fuels, and it's important as we move forward boldly and in an accelerated fashion towards realizing our clean energy goals that the work is rooted both in reliability and affordability. Scenario planning will play an important role in helping us to understand what the variety of futures could look like and how to operationalize these scenarios along with what additional policies may be necessary to be consistent with our reliability and affordability goals. IV. Overview of 2022 Scoping Plan for Achieving Carbon Neutrality Presenter: Jéa Boodry, Air Pollution Specialist, CARB Overview of CARB’s Climate Policy Framework -4- CARB began the workshop with an overview of the goals outlined in California's 2022 Scoping Plan (Figure 1) for achieving carbon neutrality and how they relate to the transition away from fossil gas. GHG targets and goals are informed by California legislation and executive orders that provide targets for total statewide emissions. There are also sector specific targets such as those set by Senate Bill (SB) 100 for the electric sector. The GHG emissions inventory provides an annual evaluation of progress towards these goals. Targets are shown in the pie chart of emissions by inventory sector in 2022 (Figure 1). The 2022 Scoping Plan lays out a cost effective and technologically feasible path to achieve the GHG targets in a way that's consistent with all directives. The Scoping Plan is updated at least once every five years. After each Scoping Plan is approved, CARB and other state agencies review, update or develop new regulations and programs to align with the actions in the plan based on established roles and authority. FIGURE 1: CALIFORNIA'S CLIMATE POLICY FRAMEWORK Figure 2 shows California’s climate goals relative to current progress. The blue line shows actual annual emissions compared to statutory targets for 2020, 2030, and 2045. In 2016, the legislature called for a 40% reduction in emissions below 1990 levels by 2030 via SB 32. In 2022, Assembly Bill (AB) 1279 established two goals:(1) to reduce anthropogenic -5- GHG emissions by 85% by 2045 compared to 1990 levels and (2) achieve carbon neutrality no later than 2045. FIGURE 2: GHG REDUCTION TARGETS 2022 Scoping Plan for Achieving Carbon Neutrality The scenario in the adopted plan includes an analysis of the actions needed across sources covered by both the AB 32 GHG inventory sectors and natural and working lands (see Figure 3). For the AB 32 GHG inventory sectors, the 2022 Scoping Plan scenario uses a broad portfolio of existing and emerging fossil fuel alternatives and includes achievement of the zero emission vehicles Executive Order eliminating internal combustion engines in new vehicle sales in the majority of legacy vehicle fleets. For national and working lands, the scenario includes ambitious levels of land management action across land types with activities that prioritize restoration and enhancement of ecosystem functions to improve resiliency to reduce negative climate change impacts. -6- FIGURE 3: THE SCOPING PLAN SCENARIO Achieving carbon neutrality is the most ambitious climate goal today to deliver benefits (Figure 4). It requires unprecedented deployment of low carbon technology and energy, and harnessing nature-based climate solutions. -7- FIGURE 4: AMBITIOUS ACTION DELIVERS HUGE BENEFITS The 2022 Scoping Plan prioritizes aggressive emission reduction in AB 32 emissions by 2045, primarily by transitioning energy demand away from fossil fuel sources, but also by targeting short-lived climate pollutants and capturing carbon dioxide directly from combustion at industrial facilities like refineries and cement plants. It is estimated that natural working lands will remain a modest source of emissions over this planning period. To achieve carbon neutrality would require the remainder of emissions to be removed at the point where they were created, directly from the atmosphere through mechanical means. The amount of carbon dioxide capture (Figure 5) and removal required to achieve carbon neutrality by 2045 will be impacted by California's success in reducing emissions and actions to allow natural and working lands to become a carbon sink. -8- FIGURE 5: ROLE AND SCALING OF CARBON DIOXIDE REMOVAL (CDR) FIGURE 6: BUILDING A CLEAN, AFFORDABLE, RELIABLE GRID A clean grid (Figure 6) serves as the backbone for the transition with high levels of electrification across sectors. In the 2022 Scoping Plan, electricity demand nearly doubles, requiring significant wind and solar capacity, along with increases in other renewables and zero carbon resources are needed. In line with directives, the Scoping Plan restricts new -9- gas fired electric generation capacity additions. To meet additional demand and resource adequacy requirements, the scenario relies on a mix of strategies, including offshore wind, battery storage, hydrogen gas turbines, and demand response. The Scoping Plan matches fossil fuel supply with reductions in demand, producing dramatic decreases in liquid petroleum fuels usage (Figure 7). Demand for fossil gas and sectors such as buildings and industry is reduced by 88% compared to today. This is accomplished primarily by transitioning to clean energy, in parts of clean electricity and renewable hydrogen. Efficiency improvements also contribute to reduced demand for fossil fuels. Implementing these changes and building out renewable and zero carbon fridge resources would also decrease reliance on existing gas generation over time, and the modeling results show a 47% reduction in fossil gas used by the electric sector by 2045. FIGURE 7: FOSSIL FUEL COMBUSTION DECLINES SIGNIFICANTLY ACROSS ALL SECTORS California's industrial sector faces specific issues in its efforts to decarbonize as many processes are difficult to electrify. The Scoping Plan scenario shows a 73% drop in fossil gas demand by 2045 (Figure 8). Compared to 2022 levels in the industrial sector, electrification or conversion to other clean energy sources is an effective decarbonization method for industrial processes that have lower heat requirements representing the majority of the decrease in fossil gas demand from 2022 to 2045. Industrial processes with high heat -10- requirements, such as steel forging and glass manufacturing, may be able to substitute to hydrogen, biomethane or other low carbon fuels, or explore other measures to decarbonize. FIGURE 8: DECARBONIZING INDUSTRIAL MANUFACTURING The Scoping Plan also identifies action to reduce fossil gas use in buildings and in the residential and commercial sectors. The Scoping Plan scenario demonstrates a reduction in fossil gas demand by 91% by 2045 (Figure 9), supported by meeting the Governor’s goal for 3 million climate-ready and climate-friendly homes and the deployment of 6 million heat pumps by 2030. Importantly, building decarbonization will contribute to improved air quality as well. -11- FIGURE 9: DECARBONIZING BUILDINGS The 2022 Scoping Plan models all electric appliances for new home and commercial building construction beginning in 2026 and 2029 respectively and for existing homes starting in 2030 (Figure 10). Additionally, the model assumes gas appliances are replaced end of life, leading to 80% of overall sales to be electric by 2030 and a hundred percent of new equipment sales by 2035. The model assumes existing commercial buildings have a similar plan for electric appliance adoption - with 80% of sales being electric by 2030 and a hundred percent of sales by 2045. By 2030, these changes result in 3 million “all electric” homes, and by 2035, 7 million homes, along with 6 million heat pumps. Zero emission standards for new space and water heaters are in alignment with the 2022 Scoping Plan. CARB committed to developing and proposing zero emission GHG standards for new space and water heaters sold in California as part of the 2022 strategy for the state implementation plan. -12- FIGURE 10: BUILDING ELECTRIFICATION The 2022 Scoping Plan modeled integration of low carbon hydrogen in multiple sectors and anticipates that hydrogen fuel cell vehicle use in the transportation sector will serve as an important part of the state's transition to zero emission vehicles particularly for medium and heavy duty vehicles (Figure 11). Other end uses with relatively smaller volumes make up the rest of anticipated use. These uses include renewable hydrogen that is blended into the natural gas system to reduce fossil gas use in buildings, routed to replace fossil fuel in certain industries and for use in the electric sector. SB 1075 will further evaluate the viability of using hydrogen methane blends in various sectors. -13- FIGURE 11: 2022 SCOPING PLAN – HYDROGEN USE BY SECTOR In the 2022 Scoping Plan update, hydrogen is an alternative fuel for liquid transportation fuels and natural gas (Figure 12). The modeling estimated the annual amount of hydrogen needed to achieve GHG emission reduction goals from now out to 2045. CARB’s modeling assumes that hydrogen is supplied by three methods: (1) electrolysis produced from zero carbon electricity, (2) steam methane reformation of biomethane, and (3) bio max gasification with carbon capture and storage. The volume that each method could contribute as modeled is shown on Figure 12. The electricity needed to produce the hydrogen was not captured. The Scoping Plan includes an approximate amount (21 GW of solar) that directly feeds hydrogen production. These model assumptions were strictly for the purpose of the Scoping Plan, utilizing the information available at the time. This is an area of rapid development and CARB’s understanding of the issues involved in hydrogen production and use are currently being studied through CARB’s other agencies work as directed by SB 1075. -14- FIGURE 12: 2022 SCOPING PLAN – HYDROGEN SUPPLY The 2022 Scoping Plan update includes more comprehensive air quality modeling and health analysis than in previous Scoping Plans (Figure 13). The analysis shows that the Scoping Plan would reduce air pollution associated with fossil fuel combustion by 71% compared to the baseline. The decrease in air pollution will also result in improved public health and is estimated to result in over $200 billion of annual health cost savings in 2045. -15- FIGURE 13: AIR QUALITY BENEFITS OF REDUCED FOSSIL FUEL COMBUSTION CARB concluded their presentation by providing References including where to locate additional information on the modeling inputs and assumptions, detail outputs and strategies in the 2022 Scoping Plan. Jason Hartzel – Are there any considerations to reliability or affordability in the CARB proposed scenarios? The plan seems to incorporate new unproved energy sources in unrealistic timelines based on current technology capability and transmission limitations. CARB responded that in the Scoping Plan adopted and approved in 2022, there was analysis of some of the economic impacts associated with the scenario and modeling results showing fuel transitions. The Scoping Plan provides directional insights about the magnitude of changes that are needed along with the actions of other state agencies. Center for Accessible Technology (Melissa Kasnitz) – Would the scenario planning described earlier be impacted by a lack of ongoing federal support for clean fuel transitions? CARB’s scenario modeling represents a number of actions and policies and regulations that were in effect at the time CARB was modeling the Scoping Plan along with a number of additional changes to address planned actions, technology impacts and fuel transitions. CARB does not necessarily see a direct relationship with federal support to achieve the fuel transitions envisioned in the scoping plan. -16- Pacific Gas and Electric (PG&E), Rachel Kuykendall – Can you confirm if there was any sort of utility rate analysis included as part of the scoping plan analysis and if not, could that lens be added to the building electrification and would that change the results? CARB confirmed that the plan included a high-level economic analysis and did not look at it from a rates level noting that there are other actions or venues such as these planning processes where that level of detail can be applied. CEC inquired as to the level of disaggregation and what geographical constraints may be considered within the Scoping Plan. CARB reaffirmed that the Scoping Plan is intended to provide a high-level pathway to achieving these aggressive climate goals and does not consider temporal analysis of energy use or specific geographic resolution. By starting with high level goals as set out in the Scoping Plan, it can be used to establish what type of adoption levels are necessary and how to assess how that adoption would unfold such that we can plan for the transition. V. Overview of CEC Gas Assessments Presenters: Heidi Javanbakht, Demand Analysis Branch Manager, CEC Nicholas Janusch, Efficiency Analysis Unit Supervisor, CEC The CEC provides an overview of the CEC’s natural gas planning processes (Figure 14). The CEC’s planning efforts are guided by California’s economy wide carbon neutrality goals and as presented by CARB, the 2022 Scoping Plan proposes air quality and greenhouse gas emission reduction strategies. Energy programs, standards, and regulations that are developed in support of carbon neutrality and feed into the CEC's Integrated Energy Policy Report (IEPR) demand forecasts, or both gas and electricity, are also considered. The electricity and gas forecasts are interdependent. The CEC's IEPR demand forecasts are the foundation for the CEC’s long-term demand scenarios and where the CEC also assesses the impacts of relevant Scoping Plan components on fuel demand. -17- FIGURE 14: NATURAL GAS PLANNING PROCESS Separately from the IEPR forecast, CEC produces a peak day demand forecast, which is an input to CEC's gas system reliability assessments. These assessments are performed for the SoCal and PG&E regions. The CPUC independently conducts gas system reliability assessments for SoCal Gas based on inputs from the California Gas Report, which is developed by the gas utilities. The California Gas Report, the CPUC assessments, and CalGEM safety regulations all inform the CPUC gas proceedings around rates and system planning. Figure 15 shows the different gas assessments and the planning time frames. The summer and winter reliability assessments look at the risk of curtailments for the upcoming season. The California Gas Report, which is the basis for gas infrastructure decisions, looks out to 2040 and the state's climate goals. -18- FIGURE 15: GAS SYSTEM PLANNING – LAYERED PLANNING HORIZONS Figure 16 depicts the CEC’s three gas demand forecast products. The IEPR Gas Demand Forecast looks at the impacts of current and under-development programs and regulations on both gas and electricity demand. This includes scenarios for energy efficiency, fuel substitution, and transport. The IEPR forecast looks at annual gas sales and consumption going out 15 years published every two years. The long-term gas demand scenarios extend the IEPR Gas Demand Forecast out to 2050, and models additional strategies for meeting the State's carbon neutrality goals. The Peak Day Gas Forecast independently assesses the same metrics reported in the California Gas Report. -19- FIGURE 16: CEC GAS DEMAND ASSESSMENTS The CEC also forecasts Additional Achievable Energy Efficiency (AAEE) and Additional Achievable Fuel Substitution (AAFS); see Figure 17. AAEE is incremental energy efficiency savings from market potential that is not included in the baseline demand forecast but is expected to occur. AAFS is where a fuel substitution refers to the substitution of one utility supply for another type. -20- FIGURE 17: AAEE & AAFS – LOAD MODIFIERS The scenarios depicted in Figure 18 show the overall gas impact from AAFS in the residential commercial sectors. The top four solid curves show the four scenarios. The two lower lines represent the impacts of the Scoping Plan, where the red line shows displacement of natural gas. The blue-line represents the impacts of including hydrogen and biogas. -21- FIGURE 18: 2023 IEPR STATEWIDE GAS IMPACTS (RESIDENTIAL AND COMMERCIAL SECTORS) VI. Discussion and Public Comment Following presentations by CARB and CEC staff, Energy Division opened the workshop forum for questions and public comment by workshop attendees. Jason Hartzel - Do you conduct any scenario analysis such as high load growth, solar and wind droughts, non-gas generation outage impacts, pipeline outage impacts, etc.? The CEC responded that its analysis focuses on demand rather than the supply side and noted that it is important to take a holistic and analytical approach to harmonize among the CPUC, CARB and CEC as overarching demand could vary under a variety of electrification strategies, both at an appliance level, but also at the distributed energy resources level which is inherently built into the forecast. A portion of the forecast is then modified using these additional fuel substitution and additional achievable load modifiers. On the supply side, there is an opportunity to look at how to optimize the demand and supply. This work is not completely siloed but work is performed within the context of resource planning and reliability framing. From the integration of the demand side it’s really important for the CEC to consider how these factors are interconnected and the extent of the resulting impact on the demand side. The CEC believes there is more work to do to ensure reliability and integrity of the pipeline system. -22- EarthJustice (Matthew Vespa) – Will the CEC be assessing the impact of the gas demand forecast in particular the gradual transformation? The Natural Gas Unit at the CEC is working on an analysis of twelve different scenarios based around the gas demand scenarios with different revenue requirement growth rates, as starting points that declined over time. Currently the CEC is building the data sets, performing a review and updating the models. The expected completion date is November 2024 to be followed by an internal CEC review process. The CEC tracks seasonal changes, as well as possible changes to supplies based on pipeline maintenance, storage withdrawal and constraints. On a daily basis, in addition to tracking PG&E and SoCalGas systems, the CEC also monitors what is occurring upstream and on interstate pipelines that deliver gas to California. Geographically California is at the “end of the line” and even though California has a robust storage infrastructure, outages upstream and outside of California's borders can impact the State. The CEC also performs hydraulic modeling analysis work to assess impacts such as when a compressor station is down. Jason Hartzel posed the following question: In the CEC’s scenario analysis, it showed a nearly 10% reduction in gas usage in just one year. How was this achieved? The CEC noted two factors likely contributing to the 10% reduction in natural gas: (1) CARB’s Scoping Plan curves use different assumptions which assume electrification of existing buildings whereas (2) the CEC’s forecast assumes 80% by 2030 (80% of buildings will be all electric, and for new construction starting in 2026 all electric construction at that time as well). CARB clarified that they strive to model a range of scenarios that are based on existing policies and policies that are under development, and so that gap on the chart between CARB’s forecast work and CARB’s Scoping Plan work highlights the need for some additional strategies to help with the gas transition. External Counsel for Environmental Defense Fund (EDF), (Beth Kelly)) asked: If it is correct that the IPER forecast uses solely a “system average gas rate”, am curious about the overall price assumptions used? The CEC confirmed it modeled rates using an average rate for a customer class on transmission or distribution. For electric generation customers, the CEC uses an average rate on the backbone. The CEC uses an average rate for all residential commercial and industrial customers across the three different utilities and does not use one average rate across sectors/utilities. -23- EDF (Beth Kelly) followed up with a request for the CEC to clarify if the CEC’s IEPR forecast is reflective that the expected demand declines associated with policies but not any associated customer price elasticity?” The CEC’s IEPR forecast reflects expected demand declines associated with policies but not any associated customer price elasticity. The CEC responded that when it comes to modeling of the zero emission appliance standards, the CEC’s model does not internalize elasticity of gas or price sensitivities in terms of adoption. The adoption rates are imposed “top down” in the model due to regulations and an option selected by the CEC. The Utility Reform Network (TURN) (Jalal Alwan) commented that “since you're including gas curtailment based on the peak day supply standard/California Gas Report (CGR), it might be worth looking at solar and wind curtailment, 13% and 3% of product production respectively, 2020 through 2023.” Southern California Generation Coalition (SCGC) (Norman Pedersen) asked “Given that the CPUC is anticipating a transition to using a CEC forecast instead of the California Gas Report prepared by the gas utilities, when will CEC forecasting be refined to the point of being usable for rate making purposes?” The CEC responded that it is certainly working towards this goal, but there are a couple improvements planned for the upcoming year. As an example, currently the CEC’s electricity generation portion of the forecast is based on a regression model. However, the CEC would prefer to move that component to Plexos modeling which will be key towards making this a usable product for work outside of the CEC. The CEC initiated an expert review of its gas forecasting models which concluded that the CEC’s gas forecasting models are equivalent to existing products used in gas planning. For a planning standard, the CEC believes its current forecasting model was adequate but noted its intention take additional time to ensure the forecasting modeling framework is robust enough to accommodate future changes. The CEC noted that its model does not account for customer choice as the model employs a top-down adoption approach and does not account for the fact that there will be a set of technologies (with a range of efficiencies) that will be eligible to replace gas appliances. For the upcoming forecasts of the 2024 IPER update, the CEC assumes an even distribution of efficiencies regardless of the technology. This assumption is premised on the fact that some customers (especially in multifamily houses/landlord situations) may choose the lower cost option as a way to minimize costs even if an appliance is less efficient. -24- Coalition for California Utility Employees (CUE) (Darian Johnston) commented that it was his understanding that there is not a one-to-one reduction in gas demand to gas pipe maintenance cost. Does the IPER help navigate this gap retention at all? The CEC noted that the IPER gas forecast is not currently used for gas system planning and would not likely address this issue. Energy Division further commented that a reduction in gas demand does not mean there's a reduction in gas infrastructure costs. The Energy Division is interested in scenarios planning which looks at how different scenarios impact rates and what that may mean for repairs. California Independent System Operator (CAISO) (Kevin Head) asked: “With the current obligation to serve will certain customer types EG electric generation customers be in scope for this proceeding”? Energy Division responded that the Scoping Memo for the Gas Transition OIR has not been issued by the Commission yet but noted that the issue of obligation to serve is not in the preliminary scope of the proceeding. Energy Division also noted that SB 1221 requires the Commission to establish a program for residential pilots based on certain criteria. For those pilots the obligation to serve would end for that particular area. EDF (Beth Kelly) observed that the CEC’s projections do not neatly fit with California Gas Reports due to differing units (millions of cubic feet per day versus therms per year) and also breaks down customer segmentation differently. As noted by the CEC, its IEPR forecast and demand scenarios forecast uses therms per year. The peak day demand forecast results are summarized outside of the IEPR Report. The CEC’s winter system reliability, summer reliability, and seasonal assessments utilize the same metrics included in the California Gas Report. (Unidentified)The following question was posed during the workshop: “In Washington state, the prohibition on future gas appliances was just overturned by voter initiative. Apparently, people want natural gas in their homes. Will this be reconsidered in California's planning?” In addition to the CEC’s earlier response regarding its demand forecast, the CEC noted that it would look to CARB and the CPUC to provide clarity on assumptions that should be included for building electrification scenarios. Hydrogen Coalition Council (Janice Lynn) inquired if there was coordination with Alliance for Renewable Clean Hydrogen Energy Systems (ARCHES). -25- The CEC confirmed that it continues to coordinate with ARCHES and would be pursuing additional collaboration and coordination with ARCHES regarding SB 1075. CUE (Darian Johnston) asked: “It seems like the costs of electric appliances and panel upgrades create significant cost barriers to building electrification. From what I understand, green financing programs to pay for these upgrades over time have had lukewarm success. Shifting these costs on the gas rate base comes with serious equitable concerns. Have any of the regulators or staff in this workshop explored whether new “fin tech” financing models, might offer new pathways to increase access to and adoption of electric appliances to facilitate building electrification?” The CEC acknowledged that there are definitely large cost barriers for adoption. With respect to alternative financing and mechanisms or any programmatic activity, the CEC tries to capture the potential impact to the extent possible with its programmatic AAFS modeling and by working with the CPUC’s potential and goal study team to capture all possibilities of financing options. Secondly, the CEC looks at zero emission appliance standards. The CEC acknowledged that in the spirit of the question, it was important to find resources such as the federal government to help pay for the cost. As an example, the CEC adopted its Equitable Building Decarbonization Program that is largely supported by state and federal funding which are essential funding streams to continue to help with the overall transformation of appliances. CARB also noted that it is currently engaging in the stakeholder process for zero emission appliance standard proposals and encouraged participants to engage in that process and daylight concerns through stakeholder discussion. EDF (Beth Kelly) asked if the CEC planned to create demand scenarios to oversee the effects between electricity, gas, and hydrogen? The CEC acknowledged the complexity, challenges and uncertainly around costs and timelines associated with Hydrogen. The CEC plans to consult with ARCHES and fulfill requirements under SB 1075. PG&E (Todd Peterson) thanked the CPUC, CARB and the CEC for the opportunity to offer comments. To facilitate decarbonization activities over time, PG&E offers three themes that should be considered: 1) Decarbonization activities should target an emission-based end state without a specific technology adoption requirement, and that culminates with affordable energy rates while delivering safe and reliable energy for our customers. -26- 2) The gas planning framework should integrate the gas and electric systems by including the CAISO transmission planning process and the CPUC’s Integrated Resource Planning Process (IRP). This will help capture the impacts on emissions, affordability and reliable electric generation and transmission. 3) The IOUs’ California Gas Report gas demands discussed at today’s workshop also include important non-utility and municipal gas transport throughput sectors and will help provide holistic forecasts and uncover key uncertainties. VII. Conclusion Energy Division thanked workshop presenters for their presentations and expressed appreciation to workshop participants for the insightful questions and responses and concluded the workshop. APPENDIX A WORKSHOP AGENDA Page 1 R.24-09-012 Workshop: Long-Term Gas Transition Scenarios: Joint Agency Presentations November 14, 2024 | 10:00 a.m. – 12:00 p.m. | Remote participation only Remote Participation Link: https://cpuc.webex.com/cpuc/j.php?MTID=m2d49b1e7b59f9eefe30e2a8b6e961ece Meeting Password: Gas workshop (42796757 when dialing from a phone or video system) Join by phone: 1-855-282-6330; Access code: 248 972 19568 Workshop Purpose: This workshop will provide insights for gas utilities, stakeholders, and the CPUC on developing a range of gas transition scenarios. California Air Resources Board’s (CARB’s) presentation will address the potential impacts of its 2022 Scoping Plan on gas demand, exploring measures like building decarbonization and appliance standards. The California Energy Commission (CEC) will provide information on its gas assessments focusing on the gas demand forecast framework, and projected impacts of zero emission appliance standards from the 2023 IEPR gas demand forecast. Intended Outcome: Workshop attendees will have a better understanding of the CEC and CARB’s gas demand scenarios that may be considered in the Long-Term Gas Planning Rulemaking. Attendees will also have a better understanding of the inputs and assumptions used to develop the scenarios, some or all of which utilities may incorporate into their own scenario analysis work. PG&E staff will publish a report summarizing the discussions held at the workshop. WORKSHOP AGENDA 10:00 – 10:20 Welcome and Housekeeping Commissioner Karen Douglas, California Public Utilities Commission Vice Chair Siva Gunda, California Energy Commission Chair Liane Randolph, California Air Resources Board Energy Division Staff 10:20 – 10:35 Overview of 2022 Scoping Plan for Achieving Carbon Neutrality CARB staff will provide an overview of the 2022 Scoping Plan Update for achieving carbon neutrality, which describes a broad portfolio of existing and emerging technologies and strategies that can help meet the State’s aggressive climate targets. The presentation will also describe changes to gas demand over time in buildings and industrial manufacturing that are consistent with the Scoping Plan Scenario. Jéa Boodry, Air Pollution Specialist, CARB 10:35 – 10:50 Q&A 10:50 – 11:10 Overview of CEC Gas Assessments AppA-1 Page 2 CEC staff will first provide an overview of their gas demand and system reliability assessments. Staff will then discuss their additional achievable energy efficiency and fuel substitution framework and results within the IEPR forecast with a focus on the potential impacts of zero emission appliance standards on future gas demand. Heidi Javanbakht, Demand Analysis Branch Manager, CEC Nicholas Janusch, Efficiency Analysis Unit Supervisor, CEC 11:10 – 11:25 Q&A 11:25 –11:50 Comments (Open to All) 11:50 – 12:00 Closing Remarks Energy Division staff Note: It is expected that one or more CPUC Commissioners may attend and participate in the workshop but no formal Commission action will be taken. One or more advisors to the CPUC Commissioners, as well as other decision-makers, may also be in attendance. The agenda will be publicly noticed on the CPUC’s Daily Calendar 10 days in advance, so statements made at the workshop will not constitute a reportable ex parte contact. This agenda is subject to change. The workshop will be recorded. AppA-2 APPENDIX B GAS LONG TERM PLANNING SCENARIO – WORKSHOP PRESENTATIONS BY CALIFORNIA AIR RESOURCE BOARD AND THE CALIFORNIA ENERGY COMMISSION CALIFORNIA AIR RESOURCES 2022 SCOPING PLAN AppB-1 Scoping Plan Overview California’s Strategy for Achieving Carbon Neutrality C P U C L O N G-T E R M G A S S Y S T E M P L A N N I N G W O R K S H O P N O V E M B E R 1 4 , 2 0 2 4 AppB-2 California’s Climate Policy Framework CALIFORNIA AIR RESOURCES BOARD 2 Updated every 5 years AppB-3 GHG Reduction Targets Achieved AB 32 Target in 2014 0 100 200 300 400 500 600 2000200520102015202020252030203520402045 AB 32 GHG Inventory Sector Emissions MMTCO 2 e/year 2020 Target 1990 Levels (AB 32) 431 MMTCO 2 e 40% 2030 Target (SB 32) 85% 2045 Target (AB 1279) ACHIEVING CARBON NEUTRALITY BY2045 GHGs included in statute: Carbon dioxide (CO 2 ), Methane (CH 4 ), Nitrous oxide (N 2 O), Hydrofluorocarbons (HFCs), Perfluorocarbons (PFCs), Sulfur hexafluoride (SF 6 ), Nitrogen trifluoride (NF 3 ) CALIFORNIA AIR RESOURCES BOARD 3 AppB-4 The Scoping Plan Scenario The path to build our way out of over a 100 years of existing fossil energy and the built environment landscapes AB 32 GHG Inventory Sectors Carbon neutrality by 2045, deploy a broad portfolio of existing and emerging fossil fuel alternatives and clean technologies, and align with statutes and Executive Orders Natural and Working Lands (NWL) Land management activities that prioritize restoration and enhancement of ecosystem functions to improve resilience to climate change impacts, including more stable carbon stocks CALIFORNIA AIR RESOURCES BOARD 4 AppB-5 Ambitious Action Delivers Huge Benefits UnprecedentedDeployment of Clean Technology and Nature-Based Climate Solutions 5 Significant GHG Reductions In 2045 relative to 2022 37x total on-road ZEVs 6x electric appliances in residences 1700x hydrogen supply 4x installed wind/solar generation capacity 9x battery storage > 2.5 Million acres of NWL climate action per year 94% decrease in liquid petroleum fueldemand 91% decrease in fossil gas used in buildings 66% decrease in methane emissions from agriculture 10% reduction in wildfire emissions CALIFORNIA AIR RESOURCES BOARD AppB-6 Role and Scaling of CarbonDioxideRemoval (CDR) CALIFORNIA AIR RESOURCES BOARD 6 AB 32 GHG Inventory Sectors: Significantly reduced, but some emissions remain NWL a modest source Need carbon dioxide removal to compensate for AB 32 GHG Inventory and NWL sectors •Role of CDR is reduced if: •We reduce the emissions from the AB 32 GHG Inventory Sectors faster •NWL are able to become a sink ± = Carbon Neutral - AppB-7 2022 Scoping Plan Update A Plan for Science-Driven Climate Action CALIFORNIA AIR RESOURCES BOARD 7 2030: 48% reduction below 1990 ▪Increased ambition from SB 32 40% target ▪SP scenario incorporates 20 MMTCO 2 e of mechanical carbon dioxide removal (CCUS/DAC*) in 2030 ▪462x increase in renewable hydrogen 2045: 85% reduction below 1990 ▪Need CCUS and carbon dioxide removal to compensate for residual emissions to achieve carbon neutrality -150 -50 50 150 250 350 450 202220302045 GHG Emissions (MMT CO 2 e) AgricultureHigh Global Warming Potential Electricity GenerationBuildings IndustrialTransportation Recycling and WasteAbated by CCS DAC 2020 Target (AB 32) 2030 Target (SB 32) 2045 Target (AB 1279) *CCUS: carbon capture, utilization, and storage; DAC: direct air capture; CCS: carbon capture and sequestration * AppB-8 Building a Clean, Affordable, Reliable Grid CALIFORNIA AIR RESOURCES BOARD 8 - 50,000 100,000 150,000 200,000 250,000 300,000 350,000 400,000 450,000 500,000 20222045 Electricity Demand (GWh) 2x existing electricity generation 4x existing wind and solar capacity in 2045 0 20,000 40,000 60,000 80,000 100,000 120,000 140,000 160,000 180,000 202320302045 New Capacity (MW) Hydrogen Combustion TurbineBiomass GeothermalWind Out-of-State WindOffshore Wind SolarCustomer Solar Battery StoragePumped Storage Demand Response AppB-9 Fossil Fuel Combustion Declines Significantly Across all Sectors CALIFORNIA AIR RESOURCES BOARD 9 *RESOLVE outputs start with 2023. Excludes fuel combustion from imported electricity. ▪Fossil gas use in all non- electricity sectors decreases by 88% in 2045 compared to today ▪Fossil gas use in electricity sector decreases by 47% in 2045 compared to today 0 0.5 1 1.5 2 2.5 3 3.5 4 4.5 All Other SectorsElectricity Sector*All Other SectorsElectricity Sector* 2022202320452045 Fuel Combustion (EJ) Liquid Petroleum FuelFossil GasLiquid BiofuelBiomassHydrogenBiomethaneOther AppB-10 Decarbonizing Industrial Manufacturing ▪73% reduction in fossil gas demand* ▪Low heat industrial processes transition to electric equipment ▪Some higher heat industrial processes substitute hydrogen, biomethane, and other low-carbon fuels CALIFORNIA AIR RESOURCES BOARD 10 *In 2045 relative to 2022 0.0 0.1 0.2 0.3 0.4 0.5 202220302045 Energy Demand (EJ) ElectricityHydrogenBiomethane Liquid BiofuelOtherFossil Gas Liquid Petroleum Fuel AppB-11 Decarbonizing Buildings CALIFORNIA AIR RESOURCES BOARD 11 *In 2045 relative to 2022 ▪91% reduction in fossil gas demand* ▪Improved outdoor and indoor air quality ▪3 million all-electric and electric ready buildings by 2030, 7 million by 2035 ▪6 million heat pumps by 2030 0.0 0.2 0.4 0.6 0.8 1.0 1.2 1.4 202220302045 Energy Demand (EJ) ElectricityHydrogenBiomethaneLiquid BiofuelOtherFossil GasLiquid Petroleum Fuel AppB-12 Building Electrification ▪Strengthen California’s building standards to support zero-emission new construction ▪Modeled asall electric appliances beginning 2026 (residential) and 2029 (commercial) ▪Existing Residential Buildings ▪80% of appliance sales are electric by 2030 ▪100% of appliance sales are electric by 2035 ▪Existing Commercial Buildings ▪80% of appliance sales are electric by 2030 ▪100% of appliance sales are electric by 2045 CALIFORNIA AIR RESOURCES BOARD 12 AppB-13 Hydrogen Use by Sector in the Scoping Plan 0.00 0.05 0.10 0.15 0.20 0.25 202320302045 Hydrogen Demand (Exajoule) BuildingsIndustrialTransportation Hydrogen demand largely driven by non-combustion uses in transportation sector: ▪Fuel cells for light-, medium-, and heavy-duty vehicles, aviation, ocean-going vessels, freight and passenger rail Other end-uses with relatively smaller volumes include: ▪Gas replacement toreduce fossil gas use in buildings and industrial sectors ▪Hydrogen turbines in electric sector CALIFORNIA AIR RESOURCES BOARD 13 AppB-14 Hydrogen Supply in the Scoping Plan CALIFORNIA AIR RESOURCES BOARD 14 ▪Hydrogen identified as important tool to displace fossil fuel use ▪Assumed hydrogen supplied by 3 methods:electrolysis from zero-carbon electricity, steam methane reformation (SMR) of biomethane, and biomass gasification with CCS (BECCS) ▪Electrolytic hydrogen modeled as additional ~21 GWof off-grid solar capacityin 2045 ▪Hydrogen production will be further studied through Senate Bill 1075 Report 0.00 0.05 0.10 0.15 0.20 0.25 202320302045 Hydrogen Supply (Exajoule) ElectrolysisSMR with BiomethaneBECCS AppB-15 AirQuality Benefits of ReducedFossil Fuel Combustion CALIFORNIA AIR RESOURCES BOARD 15 -$200 Billion In 2045 $200 Billion in health cost savings from decreased fuel combustion 0 200 400 600 800 1,000 1,200 1,400 2020 Base2045 NOx (Tons per Day) 71% reduction in NOx AppB-16 References ▪California Greenhouse Gas Emissions from 2000 to 2022: Trends of Emissions and Other Indicators ▪2022 Scoping Plan for Achieving Carbon Neutrality ▪Appendix F: Building Decarbonization ▪Appendix H: AB 32 GHG Inventory Sector Modeling ▪AB 32 GHG Inventory Sectors Modeling Data Spreadsheet ▪All 2022 Scoping Plan Update documents may be found here: https://ww2.arb.ca.gov/our- work/programs/ab-32-climate-change-scoping-plan/2022-scoping-plan-documents CALIFORNIA AIR RESOURCES BOARD 16 AppB-17 Thank You CALIFORNIA AIR RESOURCES BOARD 17 AppB-18 CALIFORNIA ENERGY COMMISSION GAS ASSESSMENTS AppB-19 Overview of CEC Gas Assessments November 14, 2024 Heidi Javanbakht Nicholas Janusch, Ph.D. Energy Assessments Division AppB-20 Acronyms and Initialisms AAEE – Additional Achievable Energy Efficiency AAFS – Additional Achievable Fuel Substitution Aliso – Aliso Canyon AQMD – Air Quality Management Districts BAU – Business as Usual CARB – California Air Resources Board CalGEM - Geologic Energy Management Division CEC – California Energy Commission CED/CEDF – California Energy Demand Forecast Comm. – Commercial Sector DAWG – Demand Analysis Working Group DPP – Distribution Planning Process FSSAT – Fuel Substitution Scenario Analysis Tool FSSAT-ZEAS AAFS – Zero-emission appliance standard modeling GRCs – General Rate Cases GT – Gradual Transformation (scenario) IEPR – Integrated Energy Policy Report IRP – Integrated Resource Plan NC – New Construction NOx – Nitrogen Oxides Prog. AAEE - Programmatic AAEE Prog. AAFS – Programmatic AAFS Regs – Regulation Res. – Residential Sector RASS – Residential Appliance Saturation Study ROB – Replace on Burnout TPP – Transmission Planning Process TCU - Transportation, Communication, and Utilities ZEAS – Zero-Emission Appliance Standards 2 AppB-21 Presentation Outline 1.Statewide Gas Planning Process 2.Overview of CEC’s Gas Assessments A.Gas System Reliability and Rates B.IEPR Forecast C.Demand Scenarios D.Peak Day Forecast 3.AAEE/AAFS Load Modifiers Framework 4.Summary of 2023 IEPR Forecast AAFS Results AppB-22 Natural Gas Planning Process Economy-Wide Carbon Neutrality Resource & System Planning SB 100 Joint Agency Report CA Gas Report CPUC Gas Reliability Assessments CPUC Hydraulic Modeling CEC Gas Demand Forecasting CEC Long- Term Demand Scenarios CEC Peak Day Gas Demand Forecast CEC Gas Price & Rates Forecast CEC Production Costs Modeling CEC Hydraulic Modeling CEC Gas Reliability Assessments CEC Electricity Demand Forecast CPUC Gas Proceedings (Aliso, GRCs, etc.) CPUC Potential/Goals Study CalGEM Safety Regs CARB Scoping Plan Standards/regs (CEC, CARB, etc.) AppB-23 Gas System Planning – Layered Planning Horizons Climate Goals Timeline (20-25 years ahead) Summer and Winter Reliability Assessments (up to 1 year ahead) California Gas Report (up to 15 years ahead) 5 AppB-24 CEC Gas Assessments Gas System Reliability and Rates Gas Demand Forecasts 6 AppB-25 CEC Gas Analysis Demand Forecasts IEPR forecast, long-term demand scenarios, peak day forecast Reliability Seasonal gas reliability assessments - PG&E & SoCalGas oGas curtailment risk oCurrent: Winter 2024-25 Gas Reliability Assessment oUp next: Summer 2025 Gas Assessment - California Energy Resource and Reliability Outlook 2025 Rates •Updating delivered price models (current) oUsed in the IEPR Gas Demand Forecast •Updated results – Jan. 2025 oIncluding CA Demand Forecast Scenarios 7 AppB-26 Forecasting: A Core CEC Activity IRPTPPDPP Used in Multiple Planning Efforts Vetting and Engagement by Public, Partner Agencies, and Stakeholders Broad Economic Sectors Evaluated ▪IEPR Process ▪Regular Joint Agency Meetings ▪Demand Analysis Working Group AgricultureResidentialCommercial TCUTransportationIndustrial (+Petroleum) Planning ForecastLocal/Reliability Scenario All Fuels Evaluated H 2 8 AppB-27 CEC Gas Demand Assessments IEPR Gas Demand Forecast Long-Term Demand Scenarios Peak Day Gas Forecast Uses Some components used by gas utilities in the CGR SB 100 planning CEC Gas System Reliability Assessments Forecast period15+ years2050Next winter or summer Update cycleEvery two yearsEvery two yearsTwice per year Products Annual sales and consumption Annual sales and consumption Monthly peak day demand; Same 1-in-X metrics reported in CGR Scenarios Energy efficiency, fuel substitution, transportation electrification Energy efficiency, fuel substitution, transportation electrification, hydrogen None Gas for Electricity Generation Not includedNot includedIncluded 9 AppB-28 AAEE/AAFS Load Modifiers Framework 10 AppB-29 AAEE & AAFS – Load Modifiers Additional Achievable Energy Efficiency (AAEE) Refers to the incremental energy efficiency savings from market potential that is not included in the baseline demand forecast but is reasonably expected to occur. These savings include future updates of building standards, appliance regulations, and new or expanded energy efficiency programs. Additional Achievable Fuel Substitution (AAFS) Fuel substitution refers to substitution of one end use fuel type for another such as changing out gas appliances in buildings for cleaner, more efficient electric appliances. Analogous to AAEE, gas savings and incremental added electricity impacts are accounted for in AAFS. These impacts are modeled based on programmatic impacts and technology- based impacts (i.e., zero-emission appliance standards). 11 AppB-30 AA Framework & Scenarios ▪Additional Achievable framework: is applied to energy efficiency, fuel substitution, and transportation electrification for the 2023 IEPR forecast. ▪The additional achievable scenarios capture a range of incremental market potential impacts, beyond what are included in the baseline demand forecast, but are within the range of what is reasonably expected to occur. Additional Achievable Scenarios AAEE 1, AAEE 2, AAEE 3, AAEE 4, AAEE 5, AAEE 6 AAFS 1, AAFS 2, AAFS 3, AAFS 4, AAFS 5, AAFS 6 Conservative Optimistic 12 AppB-31 CEC’s AAEE AAFS Nomenclature ▪The Fuel Substitution Scenario Analysis Tool (FSSAT) creates IEPR AAFS Load Modifier Scenarios using different input scenarios beginning with the Baseline Gas Demand Forecast: 1.Programmatic AAFS 2.Zero-emission appliance standards (ZEAS) modeled using FSSAT 3.Programmatic gas AAEE ▪Because of interdependencies, the 1-2-3 order is required ▪The inclusion of programmatic AAEE in AAFS does not imply “efficient electrification” ➢AAFS combines electricity and gas from both programmatic and FSSAT modeling and has interplay with gas AAEE ➢IEPR Electric AAEE is independent of AAFS process and only programmatic Baseline Gas Forecast 1. Programmatic AAFS 2. ZEAS modeling 3. Programmatic Gas AAEE IEPR Gas AAEE IEPR Electric AAEE IEPR AAFS Load Modifier Scenario 13 AppB-32 Summary of 2023 IEPR AAFS Results 14 AppB-33 Highlighted 2023 IEPR AAFS Gas Scenarios 2023 AAFS Scenario Name Programmatic Scenarios FSSAT-ZEAS Scenario Programmatic AAFS 2AAFS 2•Not included Programmatic AAFS 3AAFS 3•Not included Gradual Transformation AAFS (“GT AAFS”)* AAFS 3 AAEE 3 (gas and electric) •Increasing linear statewide adoption rate, reaching 100% by 2040 •Bay Area AQMD 9-4 & 9-6 •South Coast AQMD 1146.2 AAFS 3** (Programmatic + FSSAT-ZEAS) AAFS 3 AAEE 3 (gas and electric) •CARB space and water heating ZEAS (Initial 2030 compliance date) •Bay Area AQMD 9-4 & 9-6 Source: CEC *The CEC adopted the GT AAFS forecast at the May 8, 2024, Business Meeting. **Assumed in the Reference scenario in the CEC’s Demand Scenarios. AppB-34 2023 IEPR Statewide Gas Impacts (Residential and Commercial Sectors) 0% 10% 20% 30% 40% 50% 60% 70% 80% 202420262028203020322034203620382040 Percent Gas Reduction Programmatic AAFS 2 Programmatic AAFS 3 Gradual Transformation AAFS AAFS 3 (Programmatic + FSSAT-ZEAS) CARB Scoping Plan (ng; Relative to BAU Reference) CARB Scoping Plan (ng, h2, biogas; Relative to BAU Reference) Source: CEC 16 AppB-35 Thank you Please send any written comments or questions to: Heidi Javanbakht (heidi.javanbakht@energy.ca.gov) Nicholas Janusch, Ph.D. (nicholas.janusch@energy.ca.gov) AppB-36 BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Perform Long-Term Gas System Planning. Rulemaking 24-09-012 (Filed September 26, 2024) INFORMAL COMMENTS OF THE UTILITY REFORM NETWORK ON PACIFIC GAS AND ELECTRIC COMPANY’S AFTER WORKSHOP REPORT ON THE NOVEMBER 14, 2024 LONG-TERM GAS TRANSITION SCENARIOS WORKSHOP January 10, 2025 Jalal Awan Energy & Climate Policy Analyst Sylvie Ashford Energy & Climate Policy Analyst Hayley Goodson Managing Attorney THE UTILITY REFORM NETWORK 360 Grand Avenue, #150 Oakland, CA 94610 Telephone: (415) 929-8876 Facsimile: (415) 912-1422 E-mail: hayley@turn.org 1 INFORMAL COMMENTS OF THE UTILITY REFORM NETWORK ON PACIFIC GAS AND ELECTRIC COMPANY’S AFTER WORKSHOP REPORT ON THE NOVEMBER 14, 2024 LONG-TERM GAS TRANSITION SCENARIOS WORKSHOP I. INTRODUCTION On November 14, 2024, the Commission conducted a workshop with staff presentations from the Commission, the California Air Resources Board (CARB), and the California Energy Commission (CEC) on long-term gas transition scenarios. The Commission directed Pacific Gas and Electric Company (PG&E) to create an “after-workshop report” and distribute the report to the service list on or before December 13, 2024. 1 Pursuant to this directive, PG&E distributed its “After Workshop Report” to the service list on December 13, 2024. On December 16, 2024, Administrative Law Judge (ALJ) Purchia issued an e-mail ruling directing, in pertinent part, entities that participated in the workshop to review PG&E’s Workshop Report and distribute any corrections and/or clarifications to the service list by January 10, 2025. Pursuant to ALJ Purchia’s ruling, The Utility Reform Network (TURN) recommends that PG&E’s After Workshop Report be modified to incorporate the following clarifications / corrections. II. CLARIFICATIONS AND/OR CORRECTIONS TO PG&E’S AFTER WORKSHOP REPORT A. CARB’s 2022 Scoping Plan Report Reference Clarification / Correction Regarding Figure 6 (pp. 8-9): “To meet additional demand and resource adequacy requirements, the scenario relies on a mix of strategies, including offshore wind, battery storage, hydrogen gas turbines, and demand response.” Clarification: Figure 6 shows 4x increase in existing wind (out-of-state, offshore) and solar (utility scale, customer-sited) capacity by 2045 under CARB’s 2022 Scoping Plan. Key supply changes in 2030 and 2045 appear to be solar, storage, and wind. Hydrogen demand is largely driven by non-combustion uses in 1 Assigned Administrative Law Judge’s Ruling Providing Workshop Notice, 10/21/24, p. 2. 2 transportation e.g. fuel cells (see Figure 11, p.13). Moreover, feasibility and uptake of hydrogen as an alternative to natural gas is the purview of SB 1075, as mentioned in the Q&A (p.25). Regarding Figure 9 (pp. 10, 11): “supported by meeting the Governor’s goal for 3 million climate-ready and climate-friendly homes and the deployment of 6 million heat pumps by 2030.” Regarding p.11: “The 2022 Scoping Plan models all electric appliances for new home and commercial building construction beginning in 2026 and 2029 respectively and for existing homes starting in 2030 (Figure 10).” Clarification: “At least fifty percent of the funding to achieve these goals shall be directed toward disadvantaged communities.” (Governor’s Letter to CARB - July 22, 2022) https://www.gov.ca.gov/wp- content/uploads/2022/07/07.22.2022- Governors-Letter-to-CARB.pdf Clarification: “The 2022 Scoping Plan models varying percentages of appliance electrification for new home and commercial building construction beginning in 2026 and 2029 respectively and for existing homes starting in 2030 (Figure 10).” On p.13: “bio max gasification with carbon capture and storage” Correction of typo: “biomass gasification with carbon capture and storage” Regarding p.14: “The decrease in air pollution will also result in improved public health and is estimated to result in over $200 billion of annual health cost savings in 2045.” The CARB 2022 Scoping Plan (p. 131) states that “In total, the benefits reach $78 billion in 2035 and $199 billion in 2045.” https://ww2.arb.ca.gov/sites/default/files/2023- 04/2022-sp.pdf Correction: “The decrease in air pollution will also result in improved public health and is estimated to result in approximately $200 billion total health cost savings by 2045.” B. CEC Gas Assessment Report Reference Clarification / Correction The description of Figure 18 (pp. 20-21) Clarification: Figure 18 represents a comparison of a few of IEPR’s statewide gas “impacts (i.e. AAFS)” scenarios against the 2022 CARB Scoping Plan. IEPR’s “Managed Gas Forecast Set” is broader than the scenarios mentioned. Page 3 149 of IEPR (2023) states: “...baseline gas demand can be combined with six AAEE savings scenarios and six AAFS scenarios to create a managed gas forecast...” Scenario Numbers i.e. 1-6 in IEPR (2023) represent a progression from extremely conservative to extremely optimistic scenarios, in terms of aggressive building electrification and other energy-saving measures. Moreover, although not directly relevant to gas demand, IEPR’s scenarios (IEPR, 2023 – p.115) also include load modifiers reflecting Additional Achievable Transportation Electrification (AATE). III. CONCLUSION TURN appreciates the opportunity to comment on PG&E’s After Workshop Report and looks forward to continued participation in this proceeding. Date: January 10, 2025 Respectfully submitted, By: __________/s/______________ Hayley Goodson The Utility Reform Network 360 Grand Avenue, #150 Oakland, CA 94610 Phone: (415) 929-8876 Fax: (415) 912-1422 Email: hayley@turn.org From:Darion N. Johnston To:\"MVespa@Earthjustice.org\"; \"JHouck@FormEnergy.com\"; \"Mish@Urbint.com\"; \"BTurner@AdvancedEnergyUnited.org\"; \"LSG@dwgp.com\"; \"LSG@dwgp.com\"; \"jburris@tigernaturalgas.com\"; \"Kevin.Erwin@EnergyTransfer.com\"; \"SLipton@EnchantedRock.com\"; \"TRDill@WesternHubs.com\"; \"Amanda.Frazier@VistraCorp.com\"; \"JSchlesinger@KeyesFox.com\"; \"Leah.Capritta@HKLaw.com\"; \"Leah.Capritta@HKLaw.com\"; \"Vincent.Vitatoe@SWgas.com\"; \"Justin.Brown@SWGas.com\"; \"EHsu2@SoCalGas.com\"; \"RVanDerLeeden@SempraUtilities.com\"; \"TDusenberry@CityOfVernon.org\"; \"npedersen@hanmor.com\"; \"Klatt@EnergyAttorney.com\"; \"Janet.Combs@sce.com\"; \"Tomas@ClimateActionCampaign.org\"; \"JazzeLL2@yahoo.com\"; \"Malinda@ProtectOurCommunities.org\"; \"BTheaker@MRPgenco.com\"; \"CFaber@SempraUtilities.com\"; \"Tom.Hintz@Seahold.com\"; \"Government@CGNP.org\"; \"JSharp@PeninsulaCleanEnergy.com\"; Rachael E. Koss; Rachael E. Koss; \"Maren.Wenzel@SVCleanEnergy.org\"; Peleo, Marion; \"Camille.Stough@SFcityAtty.org\"; \"hayley@turn.org\"; \"Jennifer@UtilityAdvocates.org\"; \"MBorgeson@nrdc.org\"; \"Seth.Hilton@stoel.com\"; \"bcragg@downeybrand.com\"; \"JBerg@BayAreaMetro.gov\"; \"MAlcantar@Buchalter.com\"; \"MDay@DowneyBrand.com\"; \"MColvin@edf.org\"; \"NSheriff@Buchalter.com\"; \"jkarp@sheppardmullin.com\"; \"KatieJorrie@dwt.com\"; \"Seth.Hilton@Stoel.com\"; \"VidhyaPrabhakaran@dwt.com\"; \"JKarp@SheppardMullin.com\"; \"JKarp@SheppardMullin.com\"; \"Deborah.Behles@gmail.com\"; \"April@WildTree.org\"; \"J1Pc@pge.com\"; \"Mad.Stano@Greenlining.org\"; \"SBillimoria@rmi.org\"; \"pgetariffs@pge.com\"; \"Service@c4at.org\"; \"JForte@GHCoalition.org\"; \"JLevin@BioEnergyCa.org\"; \"WStano@MCEcleanEnergy.org\"; \"Heather.Dauler@SanJoseCa.gov\"; \"Mike@AlpineNaturalGas.com\"; \"BrillT@GTlaw.com\"; \"nreardon@sonomacleanpower.org\"; \"JHCaldwellJr@gmail.com\"; \"ABlanke@caiso.com\"; \"Sam@RNGCoalition.com\"; \"SKozal@caiso.com\"; \"TMcRae@CaliforniaHydrogen.org\"; \"ckm@eslawfirm.com\"; \"RL@esLawFirm.com\"; \"westgas@aol.com\"; \"ATrowbridge@DayCarterMurphy.com\"; \"R.Daniel.GRS@NWNatural.com\"; \"Jason.Dubchak@niskags.com\"; \"jason.dubchak@rockpointgs.com\"; \"jason.dubchak@rockpointgs.com\"; \"alopez@ebce.org\"; \"Anthony.Dixon@Energy.ca.gov\"; \"bethany.rowell@pge.com\"; \"bramirez@opiniondynamics.com\"; \"RegrelcpucCases@pge.com\"; \"CentralFiles@semprautilities.com\"; \"christa.lim@shell.com\"; \"eric@strategyi.com\"; \"emily.turkel@calpine.com\"; \"GStaples@MendotaGroup.com\"; \"JimRoss@r-c-s-inc.com\"; \"jkopyciok-lande@peninsulacleanenergy.com\"; \"Jason.Orta@Energy.ca.gov\"; \"Jennifer.Campagna@Energy.ca.gov\"; \"Jennifer.Roecks@pge.com\"; \"jgreco@GrecoEnergyConsulting.onmicrosoft.com\"; \"josh@hsinsights.com\"; \"dwtcpucdockets@dwt.com\"; \"julia.zuckerman@clearwayenergy.com\"; \"Kari.Cameron@bbklaw.comm\"; \"KAnisove@sdge.com\"; \"Kavya@UtilityDive.com\"; \"Kaylee.DAmico@treasurer.ca.gov\"; \"kevin@westernenergylaw.com\"; \"leo.kim@sce.com\"; \"mariah.chavez@sdge.com\"; \"Mark.Sippola@arb.ca.gov\"; \"Matthew.Harrison@arb.ca.gov\"; \"Max.Solanki@Energy.ca.gov\"; \"Meghan.obrien@stoel.com\"; \"Mich.Hein@Electrochaea.com\"; \"Natalie.Lee@ARB.ca.gov\"; \"nbazaj@gridworks.org\"; \"Nick.Wills-Johnson@agig.com.au\"; \"rachel.gold@arb.ca.gov\"; Topper, Samuel; \"ssoor@gridworks.org\"; \"SMiller@WPTF.org\"; \"Steven.Hearn@EnergyTransfer.com\"; \"tim_dorpinghaus@kindermorgan.com\"; \"Bill.Heberger@Treasurer.ca.gov\"; \"mrw@mrwassoc.com\"; \"mrw@mrwassoc.com\"; \"dwtcpucdockets@dwt.com\"; \"JBosco@nclc.org\"; \"diamond@energyhub.net\"; \"mmurray@aga.org\"; \"Cathleen.Colbert@VistraCorp.com\"; \"jonathannamazi@dwt.com\"; \"LSG@dwgp.com\"; \"ekaboli@earthjustice.org\"; \"ALuna@Earthjustice.org\"; \"Bethany.Allen@igs.com\"; \"Tyson@CleanStrat.com\"; \"AJohnson@CalicheStorage.com\"; \"Cem.turhal@nrg.com\"; \"KMcCoy@SouthernCo.com\"; \"kirby.bosley@edftrading.com\"; \"Paul.Gendron@edftrading.com\"; \"JBellinger@eCORPusa.com\"; \"issac.wallace@swgas.com\"; \"Tashia.Garry@swgas.com\"; \"RegServe@swgas.com\"; \"Valerie.Ontiveroz@swgas.com\"; \"marlon.santacruz@LADWP.com\"; \"Priscila.Kasha@ladwp.com\"; \"Rodney.Luck@ladwp.com\"; Marti, Alexander; \"AWhatley@SoCalGas.com\"; \"apatel@socalgas.com\"; Tang, Benjamin; Moore, Christopher; Tan, Donovan; \"GHealy@socalgas.com\"; Ahlstedt, James; \"JFohrer@SoCalGas.com\"; \"jlsalazar@semprautilities.com\"; \"JMock@SoCalGas.com\"; \"KMar@socalgas.com\"; Boyaci, Kristina; \"MSilva@SoCalGas.com\"; \"MHovsepian@SoCalGas.com\"; \"PWu@SoCalGas.com\"; \"PDeang@SoCalGas.com\"; Ciupagea, Radu; Sarria, Sebastian; \"SMortazavi@socalgas.com\"; \"richard@redeemercp.org\"; \"AAlemu@ci.vernon.ca.us\"; \"akimmey@cityofvernon.org\"; \"iaguilar@hanmor.com\"; \"jgarlock@sheppardmullin.com\"; \"RothEnergy@gmail.com\"; \"tdaquila@cityofpasadena.net\"; \"Douglass@EnergyAttorney.com\"; \"cchwang@burbankca.gov\"; \"HPandey@ci.burbank.ca.us\"; \"Alex.Gutierrez@sce.com\"; \"Case.Admin@sce.com\"; \"Dhaval.Dagli@sce.com\"; \"Ka-wing.Poon@sce.com\"; \"Mario.E.Dominguez@sce.com\"; \"Melodee.Black@sce.com\"; \"Rebecca.Meiers.DePastino@SCE.com\"; \"stephen.keehn@sce.com\"; \"ColtonC@sandiego.gov\"; \"Meghan.OBrien@Stoel.com\"; \"shafez@buchalter.com\"; \"Liddell@EnergyAttorney.com\"; \"Courtney@ucan.org\"; \"Edward@ucan.org\"; \"jane@ucan.org\"; \"jane@ucan.org\"; \"CentralFiles@SempraUtilities.com\"; \"CSummers@SempraUtilities.com\"; \"JNewlander@sdge.com\"; \"KChong@sdge.com\"; \"BMalowney@sdge.com\"; \"EMartin8@SDGE.com\"; \"KGill@sdge.com\"; \"Epasos@iid.com\"; \"ralaurie@iid.com\"; \"scbarber@iid.com\"; \"SDHarding@iid.com\"; \"CopperBeechLLC@gmail.com\"; \"Melicia.Charles@MainspringEnergy.com\"; \"MRutherford@PeninsulaCleanEnergy.com\"; Darion N. Johnston; Marc D. Joseph; Rachael E. Koss; Rachael E. Koss; William Mumby; \"EMoreno5@SoCalGas.com\"; \"FAbuSneneh@SFwater.org\"; \"GKay@SFwater.org\"; \"kyater@sfwater.org\"; \"SSidhar1@SempraUtilities.com\"; \"Theresa.Mueller@SFcityAtty.org\"; Durvasula, Anand; \"za8@cpuc.ca.gov\"; Fisher, Arthur \"Iain\"; Vinod, Aswathy; Kaneshiro, Bruce; Lambert, Christian; Myers, Christopher; Vo, Eric; Beck, Fredric; Vinogradov, Inna; Chang, Jack; Donovan, James; Ormond, Jamie; Spencer, Jean; Bromson, Jonathan; Koltz, Jonathan; Halligan, Julie; Hagler, Justin; Peterson, Kaj; Hieta, Karin M.; Ouyang, Ke Hao; Casimere, Kelley; Taul, Matthew; Kito, Michele; Skinner, Nathaniel; Bonino, Nicholas; Purchia, Robyn; O\"Hara, Rosanne; \"st7@cpuc.ca.gov\"; Logan, Scott; Simon, Sean A.; Babka, Sophie; Green, Stephanie; Thompson, Suzanne; \"TLong@turn.org\"; \"R2001007@ethree.com\"; \"KVelez@nrdc.org\"; \"Lilly.McKenna@Stoel.com\"; \"BCragg@DowneyBrand.com\"; \"cparker@buchalter.com\"; \"jseong@edf.org\"; \"MSomogyi@DowneyBrand.com\"; \"MCade@Buchalter.com\"; \"JMosher@Buchalter.com\"; \"AnnaFero@dwt.com\"; \"JArmstrong@GoodinMacBride.com\"; \"LCottle@SheppardMullin.com\"; \"ldyble@sheppardmullin.com\"; \"RBarker@Earthjustice.org\"; \"ssaadat@earthjustice.org\"; \"stevegreenwald@dwt.com\"; \"MeganMMyers@yahoo.com\"; \"ssmyers@att.net\"; \"Beth@emk-law.com\"; \"Amy.Bartell@CityOfPaloAlto.org\"; \"Jin@Decodees.com\"; \"Service@spurr.org\"; \"KowalewskiA@Calpine.com\"; \"GALamberg@PetersonPower.com\"; \"diana.gallegos@calpine.com\"; \"MikeFlorio@RocketMail.com\"; \"AAdeyeye@UCSUSA.org\"; \"Policy@CEDMC.org\"; \"jawan@turn.org\"; \"Sashford@turn.org\"; \"Cathy@BarkovichAndYap.com\"; \"AAlter@rmi.org\"; \"Ana.Boyd@SierraClub.org\"; \"C7MO@pge.com\"; \"EFM2@pge.com\"; \"PGETariffs@pge.com\"; \"Annie.Ho@pge.com\"; \"Leah.Bahramipour@SierraClub.org\"; \"Grady.Mathai-Jackson@pge.com\"; \"Mad@CalEJA.org\"; \"M2OX@pge.com\"; \"Nihal.Shrinath@SierraClub.org\"; \"Sean@BRBLawGroup.com\"; \"Ron.Perry@CommercialEnergy.net\"; \"ASlipski@c4at.org\"; \"policy@common- spark.com\"; \"rsweetnam@c4at.org\"; \"CESA_Regulatory@StorageAlliance.org\"; \"lnelson@ghcoalition.org\"; \"Jlin@ghcoalition.org\"; \"Regulatory@GHCoalition.org\"; \"mschwartz@cityofberkeley.info\"; \"TomB@CrossBorderEnergy.com\"; \"ccho@cbecal.org\"; \"JKim@cbecal.org\"; \"SLazerow@CBEcal.org\"; \"PhilM@SCDenergy.com\"; \"Berlin@SusieBerlinLaw.com\"; \"Marisa.Blackshire@BloomEnergy.com\"; \"csanada@caiso.com\"; \"DHou@caiso.com\"; \"ELagerquist@caiso.com\"; \"JGuan@caiso.com\"; \"khead@caiso.com\"; \"e-recipient@caiso.com\"; \"vrubtsova@caiso.com\"; \"cmkehrein@ems-ca.com\"; Hlavka, Eileen; \"cpucfilings@wellhead.com\"; Wadhwa, Abhilasha; \"AHartmann@SWMconsult.com\"; \"Iles@BraunLegal.com\"; \"Carleigh@ceert.org\"; \"CReheis@wspa.org\"; \"David.Erne@Energy.ca.gov\"; Van Dyken, David; Genesis, Etchissa; Lao, Franky; \"GOHara@buchalter.com\"; \"John@JMcKinseylaw.com\"; \"Stoops@BraunLegal.com\"; Johnson, Khalil; \"MBoccadoro@WestCoastAdvisors.com\"; \"regulatory@braunlegal.com\"; \"Samantha.Holdstock@Stoel.com\"; \"energy_regulatory_ca@stoel.com\"; \"Blaising@BraunLegal.com\"; \"SMN@dwgp.com\"; \"Siva.Gunda@energy.ca.gov\"; \"SD@DWGP.com\"; \"Terra.Weeks@energy.ca.gov\"; \"abb@eslawfirm.com\"; \"elsi@caliberstrat.com\"; \"BSB@esLawFirm.com\"; \"Jennifer.Venema@smud.org\"; \"Joshua.Stoops@smud.org\"; \"Joy.Mastache@SMUD.org\"; \"kelder@aspeneg.com\"; \"kjohnston@cfbf.com\"; \"Regulatory@Stoel.com\"; Ali, Molla Mohammad Subject:[EXTERNAL] R.24-09-012: CUE Corrections to Gas Planning Workshop Report Date:Friday, January 10, 2025 2:24:39 PM CAUTION: This email originated from outside of the organization. Do not click links or open attachments unless you recognize the sender and know the content is safe. Good Afternoon ALJ Purchia, ALJ Van Dyken, and Parties to R.24-09-012: Pursuant to the December 16, 2024 email ruling directing parties to review PG&E's After Workshop Report on the November 14, 2024 Long-Term Gas Transition Scenarios Workshop, the Coalition of California Utility Employees (CUE) offers the following typographical corrections: Page 24: Coalition for of California Utility Employees (CUE) (Darian Darion Johnston) commented that it was his her understanding that there is not a one-to-one reduction in gas demand to gas pipe maintenance cost. Does the IPER IEPR help navigate this gap retention at all? Page 25: CUE (Darian Darion Johnston) Thank you, Darion Darion N. Johnston Adams Broadwell Joseph & Cardozo 601 Gateway Boulevard, Suite 1000 South San Francisco, CA 94080 (650) 589-1660 voice, Ext. 14 (650) 589-5062 fax djohnston@adamsbroadwell.com ___________________ This e-mail may contain material that is confidential, privileged and/or attorney work product for the sole use of the intended recipient. Any review, reliance or distribution by others or forwarding without express permission is strictly prohibited. If you are not the intended recipient, please contact the sender and delete all copies. BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Perform Long-Term Gas System Planning. Rulemaking 24-09-012 (Filed September 26, 2024) THE UTILITY CONSUMERS’ ACTION NETWORK REQUESTED CORRECTIONS AND CLARIFICATIONS ON PG&E’s WORKSHOP REPORT Tyson Siegele Clean Energy Strategies LLC Consultant to UCAN Edward Lopez Executive Director Utility Consumers' Action Network 404 Euclid Avenue, Suite 377 San Diego, CA 92114 Phone: (619) 696-6966 Email: edward@ucan.org www.ucan.org Dated: January 10, 2025 FILED 01/10/25 04:59 PM R2409012 1 BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Perform Long-Term Gas System Planning. Rulemaking 24-09-012 (Filed September 26, 2024) THE UTILITY CONSUMERS’ ACTION NETWORK REQUESTED CORRECTIONS AND CLARIFICATIONS ON PG&E’s WORKSHOP REPORT Pursuant to ALJ Purchia’s email ruling directing Pacific Gas & Electric to confirm service and e ntities to r eview its Workshop Report (“Ruling”), 1 the Utility Consumers’ Action Network (“UCAN”) requests the following clarifications be added to the Report. 2 I. BACKGROUND AND RECOMMENDED REVISIONS November 14, 2024, the California Public Utilities Commission (“Commission”) hosted a workshop in the Long-Term Gas Planning (“LTGP”) proceeding, R.24-09-012. The workshop was intended to inform stakeholders about the California Energy Commission’s (“CEC”) and California Air Resources Board’s (“CARB”) actions and activities that may be leveraged for planning the gas transition. ALJ Van Dyken and ALJ Purchia instructed PG&E to write and serve a workshop report (“Report”). 3 PG&E served its Report on December 13, 2024. The 1 R.24-09-012, Email Ruling Directing Pacific Gas & Electric to Confirm Service and Entities to Review Workshop Report (December 16, 2024), https://docs.cpuc.ca.gov/PublishedDocs/Efile/G000/M549/K797/549797761.PDF. 2 R.24-09-012, Assigned Administrative Law Judge’s Ruling Providing Workshop Notice (October 21, 2024), p. 2, https://docs.cpuc.ca.gov/PublishedDocs/Efile/G000/M543/K418/543418963.PDF. 3 PG&E, Long-Term Gas Transition Scenarios: Joint Agency Presentations November 14, 2024 Workshop Report (December 13, 2024). 2 Ruling instructs entities that participated in the workshop to distribute any corrections and/or clarifications to the to the service list. 4 Accordingly, UCAN offers the following Report revision requests. • Page 1: Requested clarification – include a link to a recording of the workshop. • Page 1: Requested clarification – include one additional quote from the OIR before the two OIR quotes on page 1, “Broadly, the primary purpose of gas transition planning is to facilitate decarbonization activities...” 5 • Page 9: typo correction – replace “fridge” with “grid” • Page 13: typo correction – replace “bio max” with “biomass” The foregoing constitutes UCAN’s revision requests. Dated: January 10, 2025 /s/ Edward Lopez Edward Lopez, Executive Director Utility Consumers' Action Network 404 Euclid Avenue, Suite 377 San Diego, CA 92114 Phone: (619) 696-6966 Email: edward@ucan.org 4 Ruling, p. 6. 5 R.24-09-012, Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Long-Term Gas System Planning (September 26, 2024), p. 2, https://docs.cpuc.ca.gov/PublishedDocs/Published/G000/M542/K029/542029029.PDF."
  },
  {
    "id": 3,
    "title": "556410338",
    "category": "Uncategorized",
    "summary": "This document appears to be a service list for a proceeding before the California Public Utilities Commission regarding safe and reliable gas systems and long-term gas system planning.",
    "url": "/documents/556410338.pdf",
    "lastModified": "2025-03-03T21:12:22.934Z",
    "size": 474581,
    "author": "Chan, Jennifer",
    "creationDate": "2025-02-06T21:24:28.000Z",
    "pageCount": 29,
    "producer": "Microsoft® Word for Microsoft 365",
    "textContent": "- 1 - ALJ/RP6/DVD/jnf BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Establish Policies, Processes, and Rules to Ensure Safe and Reliable Gas Systems in California and Perform Long-Term Gas System Planning. Rulemaking 24-09-012 INFORMATION REGARDING SERVICE I have electronically served all persons on the attached official service list who have provided an email address for R.24-09-012. Upon confirmation of this document’s acceptance for filing, I will cause a copy of the filed document to be served by U.S. mail on all parties listed in the “Party” category of the official service list for whom no email address is provided. Dated February 6, 2025, at San Francisco, California. /s/ JENNIFER CHAN Jennifer Chan FILED 02/06/25 04:59 PM R2409012 R.24-09-012 ALJ/RP6/DVD/jnf - 2 - N O T I C E Persons should notify the Process Office, Public Utilities Commission, 505 Van Ness Avenue, Room 2000, San Francisco, CA 94102, of any change of address to ensure that they continue to receive documents. You must indicate the proceeding number on the service list on which your name appears. * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * The Commission’s policy is to schedule hearings (meetings, workshops, etc.) in locations that are accessible to people with disabilities. To verify that a particular location is accessible, call: Calendar Clerk (415) 703-1203. If specialized accommodations for the disabled are needed, e.g., sign language interpreters, those making the arrangements must call the Public Advisor at (415) 703-2074 or TDD# (415) 703-2032 five working days in advance of the event. ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 1 - ************** PARTIES ************** Rachael E. Koss Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BLVD., SUITE 1000 SOUTH SAN FRANCISCO CA 94080 (650) 589-1660 X13 RKoss@AdamsBroadwell.com For: Coalition of California Utility Employees (CUE) ____________________________________________ Rachael E. Koss Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BOULEVARD, SUITE 1000 SOUTH SAN FRANCISCO CA 94080 (650) 589-1660 X20 RKoss@AdamsBroadwell.com For: California State Association of Electrical Workers ____________________________________________ Brian Turner Regulatory Dir., Western States ADVANCED ENERGY UNITED, INC. 1010 VERMONT AVE. NW, SUITE 1050 WASHINGTON DC 20005 (202) 380-1950 X3047 BTurner@AdvancedEnergyUnited.org For: Advanced Energy United ____________________________________________ Mike Lamond Cfo / Coo ALPINE NATURAL GAS OPERATING CO. #1 LLC 15 ST. ANDREWS RD. / PO BOX 550 VALLEY SPRINGS CA 95252 (209) 772-3006 Mike@AlpineNaturalGas.com For: Alpine Natural Gas ____________________________________________ Jennifer K. Berg Assist. Dir ASSOCIATION OF BAY AREA GOVERNMENTS 375 BEALE STREET, SUITE 700 SAN FRANCISCO CA 94105 (415) 820-7947 JBerg@BayAreaMetro.gov For: Association of Bay Area Governments (ABAG Power) ____________________________________________ Julia A. Levin Executive Dir. BIOENERGY ASSOCIATION OF CALIFORNIA PO BOX 6184 ALBANY CA 94706 (510) 610-1733 JLevin@BioEnergyCa.org For: Bioenergy Association of California ____________________________________________ Michael Alcantar Attorney At Law BUCHALTER, A PROFESSIONAL CORPORATION 55 SECOND STREET, SUITE 1700 SAN FRANCISCO CA 94105 (415) 227-0900 MAlcantar@Buchalter.com For: Western States Petroleum Association (WSPA) ____________________________________________ Nora Sheriff Counsel BUCHALTER, A PROFESSIONAL CORPORATION 55 SECOND STREET, STE. 1700 SAN FRANCISCO CA 94105 (415) 227-3551 NSheriff@Buchalter.com For: Indicated Shippers ____________________________________________ James H. Caldwell, Jr. 1650 E. MAPA STREET SONOMA CA 95476 (443) 621-5168 JHCaldwellJr@gmail.com For: Center for Energy Efficiency and Renewable Technologies (CEERT) ____________________________________________ Deborah Behles Of Counsel CALIFORNIA ENVIRONMENTAL JUSTICE ALLIANC 2912 DIAMOND STREET, NO. 160 SAN FRANCISCO CA 94131 (415) 841-3304 Deborah.Behles@gmail.com For: California Environmental Justice Alliance (CEJA) ____________________________________________ Tim Mcrae Vp Of Public Affairs CALIFORNIA HYDROGEN BUSINESS COUNCIL 9010H STREET, STE. 120 / BOX 74 SACRAMENTO CA 95814 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 2 - (916) 995-9685 TMcRae@CaliforniaHydrogen.org For: California Hydrogen Business Council. ____________________________________________ Sarah Kozal CALIFORNIA ISO 250 OUTCROPPING WAY FOLSOM CA 95814 (916) 956-8838 SKozal@caiso.com For: California Independent System Operator Corporation ____________________________________________ Gene A. Nelson, Ph.D Sr. Legal Researcher & President CALIFORNIANS FOR GREEN NUCLEAR POWER 1375 EAST GRAND AVE., STE. 103, NO. 523 ARROYO GRANDE CA 93420 (805) 363-4697 Government@CGNP.org For: Californians for Green Nuclear Power, Inc. ____________________________________________ Melissa W. Kasnitz Legal Dir CENTER FOR ACCESSIBLE TECHNOLOGY 3075 ADELINE STREET, STE. 220 BERKELEY CA 94703 (510) 841-3224 X2019 Service@c4at.org For: Center for Accessible Technology ____________________________________________ Todd Dusenberry Gm - Public Utilities CITY OF VERNON 4305 SANTA FE AVENUE VERNON CA 90058 (323) 583-8811 X579 TDusenberry@CityOfVernon.org For: City of Vernon ____________________________________________ Tomas Castro Advocate / Organizer CLIMATE ACTION CAMPAIGN 3900 CLEVELAND AVE., STE. 208 SAN DIEGO CA 92103 (619) 419-1222 Tomas@ClimateActionCampaign.org For: Climate Action Campaign ____________________________________________ Katie Jorrie Attorney DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLOOR SAN FRANCISCO CA 94111 (415) 276-6500 KatieJorrie@dwt.com For: Gill Ranch Storage, LLC ____________________________________________ Vidhya Prabhakaran Attorney DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO CA 94111 (415) 276-6500 VidhyaPrabhakaran@dwt.com For: Bloom Energy Corporation (Bloom Energy) ____________________________________________ Ann L. Trowbridge Attorney DAY CARTER & MURPHY LLP 3620 AMERICAN RIVER DR., STE. 205 SACRAMENTO CA 95864 (916) 246-7303 ATrowbridge@DayCarterMurphy.com For: Agricultural Energy Consumers Association (AECA) ____________________________________________ Amelia Blanke, Ph.D. Mgr - Monitoring & Reporting DEPT OF MARKET MONITORING OF CAISO CORP 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 474-1384 ABlanke@caiso.com For: Department of Market Monitoring of the California Independent System Operator Corporation (DMM) ____________________________________________ Gregory Klatt Attorney DOUGLASS & LIDDELL 411 E. HUNTINGTON DRIVE, STE. 107-356 ARCADIA CA 91006 (626) 802-5733 Klatt@EnergyAttorney.com For: Western Power Trading Forum (WPTF) ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 3 - Sam Wade Dir - Public Policy COALITION FOR RENEWABLE NATURAL GAS 1017 L STREET, SUITE 513 SACRAMENTO CA 95814 (916) 588-3033 Sam@RNGCoalition.com For: Coalition for Renewable Natural Gas ____________________________________________ ____________________________________________ Brian T. Cragg Attorney DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 SAN FRANCISCO CA 94105 (415) 848-4813 bcragg@downeybrand.com For: Independent Energy Producers Association ____________________________________________ Michael B. Day Attorney DOWNEY BRAND LLP 455 MARKET STREET, STE. 1500 SAN FRANCISCO CA 94105 (415) 848-4800 MDay@DowneyBrand.com For: Commercial Energy of California ____________________________________________ Lisa S. Gast Attorney DUNCAN, WEINBERG, GENZER & PEMBROKE, P.C 1667 K STREET, N.W. SUITE 700 WASHINGTON DC 20006 (202) 467-6370 LSG@dwgp.com For: City of Long Beach, Public Utilities Department (formerly City of Long Beach, Energy Resources Department) ____________________________________________ Lisa S. Gast, Esq. DUNCAN, WEINBERG, GENZER & PEMBROKE, P.C 1667 K STREET, N. W., SUITE 700 WASHINGTON DC 20006 (202) 467-6370 LSG@dwgp.com For: City of Palo Alto ____________________________________________ Matthew Vespa Staff Attorney EARTHJUSTICE 50 CALIFORNIA ST., SUITE 500 Chase K. Maxwell ELLISON SCHNEIDER HARRIS & DONLAN, LLP 2600 CAPITOL AVENUE, SUITE 400 SACRAMENTO CA 95816 (916) 447-2166 ckm@eslawfirm.com For: Electrochaea Corporation f/k/a Electrochaea GMBH ____________________________________________ Scott D. Lipton Energy Policy Mgr, Western Region ENCHANTED ROCK, LLC 1113 VINE STREET, STE. 101 HOUSTON TX 77002 (661) 428-7732 SLipton@EnchantedRock.com For: Enchanted Rock Holdigns, LLC ____________________________________________ Kevin P. Erwin Assoc. Gen. Counsel ENERGY TRANSFER PARTNERS 1300 MAIN STREET HOUSTON TX 77002 (713) 989-2745 Kevin.Erwin@EnergyTransfer.com For: Transwestern Pipeline Company, LLC ____________________________________________ Michael Colvin Dir - Regulatory ENVIRONMENTAL DEFENSE FUND 123 MISSION ST, 28TH FL. SAN FRANCISCO CA 94105 (415) 293-6122 MColvin@edf.org For: Environmental Defense Fund ____________________________________________ Jason Houck Policy And Regulatory Affairs Lead FORM ENERGY, INC. 444 SOMERVILLE AVE. SOMERVILLE MA 02143 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 4 - SAN FRANCISCO CA 00000 (415) 217-2123 MVespa@Earthjustice.org For: Sierra Club ____________________________________________ Ronald Liebert Attorney ELLISON SCHNEIDER HARRIS & DONLAN LLP 2600 CAPITOL AVENUE, SUITE 400 SACRAMENTO CA 95816-5931 (916) 447-2166 RL@esLawFirm.com For: California Manufacturers & Technology Association ____________________________________________ (844) 367-6462 JHouck@FormEnergy.com For: Form Energy, Inc. ____________________________________________ Richard Daniel President GILL RANCH STORAGE, LLC 220 NW SECOND AVENUE PORTLAND OR 97209 (503) 226-4211 R.Daniel.GRS@NWNatural.com For: Gill Ranch Storage, LLC ____________________________________________ Tim Kamermayer Dir Policy & Regulatory Affairs GREEN HYDROGEN COALITION 2150 ALLSTON WAY, STE. 400 BERKELEY CA 94704 (916) 247-9533 tkamermayer@ghcoalition.org For: Green Hydrogen Coalition ____________________________________________ Thomas R. Brill Attorney GREENBERG TRAURIG, LLP 18565 JAMBOREE ROAD, SUITE 500 IRVINE CA 95312 (949) 732-6537 BrillT@GTlaw.com For: Central Valley Gas Storage, LLC ____________________________________________ Norman A. Pedersen, Esq. Attorney HANNA AND MORTON LLP 444 S. FLOWER STREET, SUITE 2530 LOS ANGELES CA 90071-2916 (213) 430-2510 npedersen@hanmor.com For: Southern California Generation Coalition ____________________________________________ Leah E. Capritta, Esq. Attorney HOLLAND & KNIGHT, LLP 1801 CALIFORNIA STREET, STE. 5000 DENVER CO 80207 (303) 974-6660 Leah.Capritta@HKLaw.com For: School Project for Utility Rate Reduction (SPURR) Jacob Schlesinger Counsel KEYES & FOX LLP 1580 LINCOLN ST., STE. 1105 DENVER CO 80203 (970) 531-2525 JSchlesinger@KeyesFox.com For: San Diego Community Power (SDCP) ____________________________________________ Thomas Dill President LODI GAS STORAGE, LLC 14811 ST. MARYS LANE, STE. 150 HOUSTON TX 77079 (281) 679-3599 TRDill@WesternHubs.com For: Lodi Gas Storage, LLC ____________________________________________ Wade Stano Sr. Policy Counsel MARIN CLEAN ENERGY 1125 TAMALPAIS AVENUE SAN RAFAEL CA 94901 (415) 464-6024 WStano@MCEcleanEnergy.org For: Marin clean Energy (MCE) ____________________________________________ Brian Theaker Dir., Western Regulatory & Market Affair MIDDLE RIVER POWER, LLC 4350 EXECUTIVE DRIVE, SUITE 320 SAN DIEGO CA 92121 (530) 295-3305 BTheaker@MRPgenco.com For: Middle River Power, LLC ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 5 - ____________________________________________ Leah E. Capritta, Esq. Attorney HOLLAND & KNIGHT, LLP 1801 CALIFORNIA STREET, SUITE 5000 DENVER CO 80207 (303) 974-6660 Leah.Capritta@HKLaw.com For: United Energy Trading, LLC ____________________________________________ ____________________________________________ Merrian Borgeson Sr. Scientist, Energy Program NATURAL RESOURCES DEFENSE COUNCIL 111 SUTTER ST., 21ST FL. SAN FRANCISCO CA 94104 (415) 875-6100 X6174 MBorgeson@nrdc.org For: Natural Resources Defense Council (NRDC) ____________________________________________ Camille Stough Deputy City Attorney OFFICE OF THE CITY ATTORNEY DAVID CHIU CITY HALL, ROOM 234 1 DR. CARLTON B. GOODLETT PLACE SAN FRANCISCO CA 94102-4682 (415) 554-3878 Camille.Stough@SFcityAtty.org For: City and County of San Francisco ____________________________________________ Jonathan D. Pendleton Counsel PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 973-2916 J1Pc@pge.com For: Pacific Gas and Electric Company ____________________________________________ Sidney Bob Dietz Ii Dir - Regulatory Pr PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 973-4977 pgetariffs@pge.com For: Pacific Gas & Electric Company ____________________________________________ Jenna Sharp Regulatory Analyst PENINSULA CLEAN ENERGY AUTHORITY 2075 WOODSIDE ROAD REDWOOD CITY CA 94061 (650) 562-5668 JSharp@PeninsulaCleanEnergy.com For: Peninsula Clean Energy Authority ____________________________________________ Jason A. Dubchak Vice President Legal & Regulatory ROCKPOINT GAS STORAGE 400 - 607 8TH AVE SW CALGARY AB T2P 0A7 CANADA (403) 513-8647 jason.dubchak@rockpointgs.com For: Lodi Gas Storage, L.L.C. ____________________________________________ Jason A. Dubchak Vice President Legal & Regulatory ROCKPOINT GAS STORAGE 400 - 607 8TH AVE SW CALGARY AB T2P 0A7 CANADA (403) 513-8647 jason.dubchak@rockpointgs.com For: Wild Goose Storage, LLC ____________________________________________ Sherri Billimoria Mgr ROCKY MOUNTAIN INSTITUE 1901 HARRISON STREET, STE. 200 OAKLAND CA 94612 (303) 245-1003 SBillimoria@rmi.org For: Rocky Mountain Institute (RMI) ____________________________________________ Clay Faber Dir. Ca & Federal Regulatory SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP32F SAN DIEGO CA 92123 (858) 654-1756 CFaber@SempraUtilities.com For: San Diego Gas & Electric Company ____________________________________________ ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 6 - Marion Peleo Legal Division RM. 4107 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2130 map@cpuc.ca.gov For: Public Advocates Office Heather Dauler Duputy Dir - Regulatory SAN JOSE CLEAN ENERGY 200 EAST SANA CLARA STREET SAN JOSE CA 95113 (408) 975-2619 Heather.Dauler@SanJoseCa.gov For: City of San Jose, Administrator San Jose Clean Energy ____________________________________________ Thomas M. Hintz Managing Partner SEAHOLD LLC 14500 LAS PALMAS DRIVE, UNIT 54 BAKERSFIELD CA 93306 (951) 943-9697 Tom.Hintz@Seahold.com For: SeaHold LLC ____________________________________________ Joseph M. Karp Attorney SHEPPARD MULLIN RICHTER & HAMPTON LLP FOUR EMBARCADERO CENTER, 17TH FLOOR SAN FRANCISCO CA 94111-4109 (415) 774-3118 JKarp@SheppardMullin.com For: Sacramento Municipal Utility District ____________________________________________ Joseph M. Karp Attorney At Law SHEPPARD MULLIN RICHTER & HAMPTON LLP FOUR EMBARCADERO CENTER, 17TH FL. SAN FRANCISCO CA 94111-4109 (415) 434-9100 JKarp@SheppardMullin.com For: Central Valley Gas Storage LLC ____________________________________________ Joseph M. Karp Attorney At Law SHEPPARD MULLIN RICHTER & HAMPTON LLP FOUR EMBARCADERO CENTER, 17TH FLOOR SAN FRANCISCO CA 94111 (415) 774-3118 jkarp@sheppardmullin.com For: Calpine Corporation ____________________________________________ Maren Wenzel Sr. Mgr. Of Policy & Regulatory Analysis SILICON VALLEY CLEAN ENERGY AUTHORITY 333 W EL CAMINO REAL, SUITE 330 Jennifer L. Weberski Litigation Supervisor SMALL BUSINESS UTILITY ADVOCATES 548 MARKET STREET, SUITE 11200 SAN FRANCISCO CA 94104 (703) 489-2924 Jennifer@UtilityAdvocates.org For: Small Business Utility Advocates ____________________________________________ Neal Reardon Director, Regulatory Affairs SONOMA CLEAN POWER AUTHORITY 431 E STREET SANTA ROSA CA 95404 (707) 890-8488 nreardon@sonomacleanpower.org For: Sonoma Clean Power Authority ____________________________________________ Janet S. Combs, Esq. Sr. Attorney SOUTHERN CALIFORNIA EDISON COMPANY 2244 WALNUT GROVE AVE. / PO BOX 800 ROSEMEAD CA 91770-3714 (626) 302-1524 Janet.Combs@sce.com For: Southern California Edison Company ____________________________________________ Edward L. Hsu Sr Counsel SOUTHERN CALIFORNIA GAS COMPANY 555 WEST 5TH STREET, GT14E7, STE. 1400 LOS ANGELES CA 90013 (213) 244-8197 EHsu2@SoCalGas.com For: Southern California Gas Company ____________________________________________ Ronald Van Der Leeden Dir. - Regulatory Affairs SOUTHERN CALIFORNIA GAS COMPANY 555 W. FIFTH STREET, GT14D6 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 7 - SUNNYVALE CA 94087 (408) 716-4745 Maren.Wenzel@SVCleanEnergy.org For: Silicon Valley Clean Energy Authority ____________________________________________ LOS ANGELES CA 90013 (213) 244-2009 RVanDerLeeden@SempraUtilities.com For: Southern California Gas Company ____________________________________________ Justin Lee Brown Vp - Regulation & Public Affairs SOUTHWEST GAS CORPORATION PO BOX 98510 LAS VEGAS NV 89193 (702) 876-7321 Justin.Brown@SWGas.com For: Southwest Gas Corporation ____________________________________________ Vincent J. Vitatoe, Esq. Associate General Counsel SOUTHWEST GAS CORPORATION 8360 S. DURANGO BLVD LAS VEGAS NV 89113 (702) 876-7396 Vincent.Vitatoe@SWgas.com For: Southwest Gas Corporation ____________________________________________ Seth D. Hilton Attorney STOEL RIVES LLP ONE MONTGOMERY ST., STE 3230 SAN FRANCISCO CA 94104 (415) 617-8900 Seth.Hilton@stoel.com For: Air Products and Chemicals, Inc. ____________________________________________ Seth D. Hilton Attorney STOEL RIVES LLP THREE EMBARCADERO CENTER, STE. 1120 SAN FRANCISCO CA 94111 (415) 617-8943 Seth.Hilton@Stoel.com For: Shell Energy North America (US), L.P. (formerly Shell Energy Solutions) (â€œShell Energyâ€) ____________________________________________ Mad Stano Sr. Legal Counsel THE GREENLINING INSTITUTE 360 14TH STREET, 2ND FL. OAKLAND CA 94612 (510) 809-1820 Mad.Stano@Greenlining.org For: The Greenlining Institute Malinda Dickenson Dir - Legal & Exec. THE PROTECT OUR COMMUNITIES FOUNDATION 4452 PARK BLVD., STE 309 SAN DIEGO CA 92116 (619) 693-4788 Malinda@ProtectOurCommunities.org For: The Protect Our Communities Foundation ____________________________________________ Hayley Goodson Attorney THE UTILITY REFORM NETWORK 785 MARKET ST., STE. 1400 SAN FRANCISCO CA 94103 (415) 929-8876 hayley@turn.org For: The Utility Reform Network (TURN) ____________________________________________ Johnathan Burris Vice President, Marketing TIGER NATURAL GAS, INC. 1422 E. 71ST ST., SUITE J TULSA OK 74136 (918) 491-6998 jburris@tigernaturalgas.com For: Tiger Natural Gas, Inc. ____________________________________________ Mishal Thadani Dir - Development & Policy URBINT 636 BROADWAY, STE.1102 NEW YORK NY 10012 (713) 385-9729 Mish@Urbint.com For: Urbint ____________________________________________ Jason Zeller Staff Attorney UTILITY CONSUMERSâ€™ ACTION NETWORK 3405 KENYON STREET, SUITE 401 SAN DIEGO CA 92110 (619) 696-6966 JazzeLL2@yahoo.com For: Utility Consumers' Action Network (UCAN) ____________________________________________ ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 8 - ____________________________________________ Amanda Frazier Svp - Regulatory VISTRA ENERGY CORP. 1005 CONGRESS AVENUE, SUITE 750 AUSTIN TX 78701 (512) 349-6442 Amanda.Frazier@VistraCorp.com For: Vistra Corp (formerly Vistra Energy Corp.) ____________________________________________ Raymond J. Czahar Chief Financial Officer WEST COAST GAS CO., INC. 9203 BEATTY DR. SACRAMENTO CA 95826-9702 (916) 364-4100 westgas@aol.com For: West Coast Gas Company ____________________________________________ Jason A. Dubchak Assoc. Gen. Counsel WILD GOOSE STORAGE LLC 607 8TH AVENUE S.W., SUITE 400 CALGARY AB T2P 047 CANADA (403) 513-8647 Jason.Dubchak@niskags.com For: Wild Goose Storage Inc. ____________________________________________ April Rose Maurath Sommer Executive And Legal Dir WILD TREE FOUNDATION 1547 PALOS VERDES MALL, STE 196 WALNUT CREEK CA 94597 (925) 310-6070 April@WildTree.org For: Wild Tree Foundation ____________________________________________ ********** STATE EMPLOYEE *********** ********* INFORMATION ONLY ********** Darion Johnston ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BOULEVARD, SUITE 1000 SOUTH SAN FRANCISCO CA 94080 (650) 589-1660 X14 DJohnston@AdamsBroadwell.com Marc D Joseph Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BLVD., STE. 1000 SO. SAN FRANCISCO CA 94080 (650) 589-1660 mdjoseph@adamsbroadwell.com Rachael E. Koss Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BOULEVARD, SUITE 1000 SO. SAN FRANCISCO CA 94080 (650) 589-1660 X13 RKoss@AdamsBroadwell.com Rachael Koss Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BOULEVARD, SUITE 1000 SO SAN FRANCISCO CA 94080 (650) 589-1660 RKoss@AdamsBroadwell.com For: Western States Council of Sheet Metal Workers ____________________________________________ William C. Mumby Attorney ADAMS BROADWELL JOSEPH & CARDOZO 601 GATEWAY BOULEVARD, STE. 1000 SO. SAN FRANCISCO CA 94080 (650) 589-1660 WMumby@AdamsBroadwell.com For: Coalition of California Utility Employees (CUE) ____________________________________________ Michael Boccadoro AGRICULTURAL ENERGY CONSUMERS ASSOC. 925 L STREET, SUITE 800 SACRAMENTO CA 95814 (916) 441-4383 MBoccadoro@WestCoastAdvisors.com Michael Murray General Counsel AMERICAN GAS ASSOCIATION 400 N. CAPITOL ST., NW, 4TH FLOOR WASHINGTON DC 20001 (202) 824-7071 mmurray@aga.org For: American Gas Association ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 9 - ____________________________________________ Catherine M. Elder Principal Associate & Practice Lead ASPEN ENVIRONMENTAL GROUP 8801 FOLSOM BLVD, SUITE 173 SACRAMENTO CA 95826 (916) 235-9390 kelder@aspeneg.com Nick Wills-Johnson Head Of Economics AUSTRALIAN GAS INFRASTRUCTURE GROUP EMAIL ONLY EMAIL ONLY AA 00000 Nick.Wills-Johnson@agig.com.au Kristina Abadjian Energy Division 320 West 4th Street Suite 500 Los Angeles CA 90013 (213) 576-1310 ka3@cpuc.ca.gov James Ahlstedt Public Advocates Office 320 West 4th Street Suite 500 Los Angeles CA 90013 (415) 703-3196 ja7@cpuc.ca.gov Molla Mohammad Ali Safety and Enforcement Division (415) 471-9289 ma5@cpuc.ca.gov Catherine E. Yap Consultant BARKOVICH & YAP, INC. PO BOX 11031 OAKLAND CA 94611 (510) 450-1270 Cathy@BarkovichAndYap.com Marisa Blackshire Sr. Dir - Compliance & Ehrs BLOOM ENERGY CORPORATION 4353 NORTH FIRST STREET SAN JOSE CA 95143 Marisa.Blackshire@BloomEnergy.com Brittany Iles Attorney BRAUN BLAISING & WYNNE, P.C. Scott Blaising Attorney BRAUN BLAISING & WYNNE, P.C. 555 CAPITOL MALL, SUITE 570 SACRAMENTO CA 95814 (916) 326-5812 Blaising@BraunLegal.com For: behalf of Joint CCAs ____________________________________________ Regulatory Clerk BRAUN BLAISING & WYNNE, PC (BB&W) 555 CAPITOL MALL, STE 570 SACRAMENTO CA 95814 regulatory@braunlegal.com Josh Stoops Attorney BRAUN BLAISING SMITH WYNNE, P.C. 555 CAPITOL MALL, SUITE 570 SACRAMENTO CA 95814 (916) 326-5812 Stoops@BraunLegal.com Sean P. Beatty Partner BRB LAW LLP PO BOX 70527 OAKLAND CA 94612 (925) 324-3483 Sean@BRBLawGroup.com Gwenneth O'Hara Attorney BUCHALTER, A PROFESSIONAL CORPORATION 500 CAPITOL MALL, SUITE 1900 SACRAMENTO CA 95814 (916) 945-5174 GOHara@buchalter.com James P. Mosher Attorney BUCHALTER, A PROFESSIONAL CORPORATION 425 MARKET STREET, 29TH FL. SAN FRANCISCO CA 94105-2491 (415) 308-7712 JMosher@Buchalter.com Michael Cade Analyst BUCHALTER, A PROFESSIONAL CORPORATION 55 SECOND STREET, SUITE 1700 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 10 - 555 CAPITOL MALL, STE. 570 SACRAMENTO CA 95814 (916) 326-5812 Iles@BraunLegal.com SAN FRANCISCO CA 94105 (415) 227-0900 MCade@Buchalter.com Samir A. Hafez Attorney BUCHALTER, APC 655 W BROADWAY SUITE 1625 SAN DIEGO CA 92101 (619) 219-6326 shafez@buchalter.com Chris Chwang BURBANK WATER AND POWER 164 WEST MAGNOLIA BLVD. BURBANK CA 91502 (818) 238-5715 cchwang@burbankca.gov Sophie Babka Energy Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1329 sb8@cpuc.ca.gov Fredric Beck Energy Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-5432 fbk@cpuc.ca.gov Nicholas Bonino Administrative Law Judge Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1801 nbo@cpuc.ca.gov Jonathan Bromson Legal Division RM. 4107 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2362 jab@cpuc.ca.gov Greg Wikler Exe. Dir CA EFFICIENCY + DEMAND MGMT. COUNCIL 1111 BROADWAY, STE. 300 OAKLAND CA 94607 Delphine Hou CA. INDEPENDENT SYSTEMS OPERATOR CORP 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 608-5910 DHou@caiso.com Kaylee D'Amico CAEATFA EMAIL ONLY EMAIL ONLY CA 00000 (916) 653-3036 Kaylee.DAmico@treasurer.ca.gov William Heberger Program Analyst CAEATFA EMAIL ONLY EMAIL ONLY CA 00000 (916) 653-2511 Bill.Heberger@Treasurer.ca.gov Rachel A. Gold, Esq CAIFORNIA AIR RESOURCES BOARD EVALUATION BRANCH EMAIL ONLY EMAIL ONLY CA 00000 (916) 327-1517 rachel.gold@arb.ca.gov Manal Yamout Mcdermid CALIBER STRATEGIES PO BOX 160724 SACRAMENTO CA 95816 elsi@caliberstrat.com Amy Johnson Dir - Regulatory CALICHE DEVELOPMENT PARTNERS II, LLC 919 MILAM STREET, STE. 2425 HOUSTON TX 77002 (832) 753-4803 AJohnson@CalicheStorage.com Mad Stano Program Dir. CALIF. ENVIRONMENTAL JUSTICE ALLIANCE 1825 SAN PABLO AVE., STE. 200 OAKLAND CA 94612 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 11 - (925) 286-1710 Policy@CEDMC.org (510) 808-5898 Mad@CalEJA.org Mark Sippola CALIFORNIA AIR RESOURCES BOARD EMAIL ONLY EMAIL ONLY CA 00000 Mark.Sippola@arb.ca.gov Matthew Harrison CALIFORNIA AIR RESOURCES BOARD EMAIL ONLY EMAIL ONLY CA 00000 Matthew.Harrison@arb.ca.gov Natalie Lee CALIFORNIA AIR RESOURCES BOARD EMAIL ONLY EMAIL ONLY CA 00000 Natalie.Lee@ARB.ca.gov Anthony Dixon CALIFORNIA ENERGY COMMISSION EMAIL ONLY EMAIL ONLY CA 00000 Anthony.Dixon@Energy.ca.gov David Erne Supervisor - Energy Systems Research CALIFORNIA ENERGY COMMISSION 715 P STREET, MS-14 SACRAMENTO CA 95814 (916) 327-1399 David.Erne@Energy.ca.gov Jason Orta CALIFORNIA ENERGY COMMISSION EMAIL ONLY EMAIL ONLY CA 00000 Jason.Orta@Energy.ca.gov Jennifer Campagna CALIFORNIA ENERGY COMMISSION EMAIL ONLY EMAIL ONLY CA 00000 Jennifer.Campagna@Energy.ca.gov Max Solanki CALIFORNIA ENERGY COMMISSION EMAIL ONLY EMAIL ONLY CA 00000 Max.Solanki@Energy.ca.gov Siva Gunda CALIFORNIA ENERGY COMMISSION ENERGY ASSESSMENTS DIVISION 1516 9TH STREET, MS: 21 SACRAMENTO CA 95814 (916) 653-2728 Siva.Gunda@energy.ca.gov Kevin Johnston, Esq Attorney CALIFORNIA FARM BUREAU FEDERATION 2600 RIVER PLAZA DRIVE SACRAMENTO CA 95833 (916) 200-8037 kjohnston@cfbf.com Erik Lagerquist Corporation CALIFORNIA INDEPENDENT SYSTEM OPERATOR C 250 0UTCROPPING WAY FOLSOM CA 95630 (916) 531-5242 ELagerquist@caiso.com Cristy Sanada Lead Analyst CALIFORNIA ISO 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 221-8623 csanada@caiso.com Jasmie Guan CALIFORNIA ISO 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 200-6079 JGuan@caiso.com Kevin Head Lead Ca Regulatory Affairs Specialist CALIFORNIA ISO 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 293-2363 khead@caiso.com Legal Department CALIFORNIA ISO 250 OUTCROPPING WAY ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 12 - FOLSOM CA 95630 (916) 608-7273 e-recipient@caiso.com Vassilisa Rubtsova Analyst CALIFORNIA ISO 250 OUTCROPPING WAY FOLSOM CA 95630 (916) 633-9574 vrubtsova@caiso.com Avis Kowalewski Vp - Gov'T & Regulatory Affairs CALPINE CORPORATION 4160 DUBLIN BLVD, SUITE 100 DUBLIN CA 94568 (925) 557-2284 KowalewskiA@Calpine.com Diana Gallegos Dir Governmental & Regulatory Affairs CALPINE CORPORATION 3003 OAK ROAD, SUITE 400 WALNUT CREEK CA 94597 (925) 557-2250 diana.gallegos@calpine.com Emily Turkel Government Relations Analyst CALPINE CORPORATION EMAIL ONLY EMAIL ONLY CA 00000 (925) 557-2240 emily.turkel@calpine.com Carleigh Osen Policy Analyst CEERT 1100 11TH STREET, SUITE 311 SACRAMENTO CA 95814 (916) 442-7785 Carleigh@ceert.org For: Center for Energy Efficiency and Renewable Technologies (CEERT) ____________________________________________ Adrian Slipski Legal Fellow CENTER FOR ACCESSIBLE TECHNOLOGY 3075 ADELINE STREET, SUITE 220 BERKELEY CA 94703 (510) 841-3224 X2024 ASlipski@c4at.org Rachel Sweetnam Attorney CENTER FOR ACCESSIBLE TECHNOLOGY 3075 ADELINE STREET, SUITE 220 BERKELEY CA 94703 rsweetnam@c4at.org Theresa Mueller CITY AND COUNTY OF SAN FRANCISCO OFFICE OF CITY ATTORNEY 1 DR. CARLTON B. GOODLETT PLACE, RM 234 SAN FRANCISCO CA 94102 (415) 554-4700 Theresa.Mueller@SFcityAtty.org For: City and County of San Francisco ____________________________________________ Marna Schwartz CITY OF BERKELEY 1947 CENTER STREET BERKELEY CA 94704 (510) 981-7473 mschwartz@cityofberkeley.info Amy Bartell Assistant City Attorney CITY OF PALO ALTO 250 HAMILTON AVENUE, PO BOX 10250 PALO ALTO CA 94303 (650) 329-2171 Amy.Bartell@CityOfPaloAlto.org Abraham Alemu Resource Planning & Dev. Manager CITY OF VERNON 4305 SANTE FE AVENUE VERNON CA 90058 (323) 583-8811 X-275 AAlemu@ci.vernon.ca.us For: City of Vernon ____________________________________________ Angela Kimmey CITY OF VERNON, CALIFORNIA 4305 S. SANTA FE AVENUE VERNON CA 90058 (323) 826-3666 akimmey@cityofvernon.org Tyson Siegele ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 13 - Principal Consultant CLEAN ENERGY STRATEGIES 11750 W 135TH ST., STE. 1080 OVERLAND PARK KS 66062 (917) 771-2222 Tyson@CleanStrat.com Julia Zuckerman Senior Manager, External Affairs CLEARWAY ENERGY GROUP EMAIL ONLY EMAIL ONLY CA 00000 julia.zuckerman@clearwayenergy.com Ronald L. Perry President COMMERCIAL ENERGY OF CALIFORNIA 7677 OAKPORT AVE., SUITE 525 OAKLAND CA 94621-1944 (510) 567-2700 Ron.Perry@CommercialEnergy.net Michelle Vigen Ralston COMMON SPARK CONSULTING 1639 WOOLSEY ST. BERKELEY CA 94703 (612) 807-5272 policy@common-spark.com Jina Kim COMMUNITIES FOR A BETTER ENCIRONMENT 340 MARINA WAY RICHMOND CA 94801 (510) 302-0430 JKim@cbecal.org For: California Environmental Justice Alliance ____________________________________________ Connie Cho Attorney COMMUNITIES FOR A BETTER ENVIRONMENT 340 MARINA WAY RICHMOND CA 94801 (323) 826-9771 ccho@cbecal.org Shana Lazerow Attorney / Legal Dir. COMMUNITIES FOR A BETTER ENVIRONMENT 340 MARINA WAY RICHMOND CA 94801 (510) 302-0430 X 18 SLazerow@CBEcal.org Eileen Hlavka CPUC ENERGY DIVISION 400 R ST., STE. 270 SACRAMENTO CA 95811 Eileen.Hlavka@cpuc.ca.gov Samuel Topper CPUC EMAIL ONLY EMAIL ONLY CA 00000 samuel.topper@cpuc.ca.gov R. Thomas Beach Principal Consultant CROSSBORDER ENERGY 2560 NINTH STREET, SUITE 213A BERKELEY CA 94710 (510) 549-6922 TomB@CrossBorderEnergy.com Suzanne Casazza Executive Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-5906 sc8@cpuc.ca.gov Kelley Casimere Legal Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1707 kc9@cpuc.ca.gov Jack Chang Administrative Law Judge Division RM. 5020 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2837 cja@cpuc.ca.gov Radu Ciupagea Public Advocates Office 320 West 4th Street Suite 500 Los Angeles CA 90013 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 14 - James P. (Jim) Mosher COPPER BEECH CONSULTING LLC 11600 FINSBURY COURT BAKERSFIELD CA 93312 (661) 477-5303 CopperBeechLLC@gmail.com (415) 703-5235 rc5@cpuc.ca.gov DAVIS WRIGHT TREMAINE LLP EMAIL ONLY EMAIL ONLY CA 00000 (415) 276-6500 dwtcpucdockets@dwt.com Anna Fero Attorney DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO CA 94111 (415) 276-6500 AnnaFero@dwt.com Jonathan A. Namazi DAVIS WRIGHT TREMAINE LLP 1301 K STREET NW, SUITE 500 EAST WASHINGTON DC 20005 jonathannamazi@dwt.com For: Bloom Energy Corporation ____________________________________________ Judy Pau DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO CA 00000 (415) 276-6587 dwtcpucdockets@dwt.com Steve Greenwald Attorney DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO CA 94111 (415) 276-6500 stevegreenwald@dwt.com Jin Noh Principal DECODE ENERGY, LLC 622 10TH AVENUE SAN MATEO CA 94402 (703) 507-8809 Jin@Decodees.com Cem Turhal Donald C. Liddell Attorney DOUGLASS & LIDDELL 2928 2ND AVENUE SAN DIEGO CA 92103 (619) 993-9096 Liddell@EnergyAttorney.com Daniel W. Douglass Attorney DOUGLASS, LIDDELL & KLATT 5737 KANAN ROAD, STE. 610 AGOURA HILLS CA 91301-1601 (818) 961-3001 Douglass@EnergyAttorney.com Brian T. Cragg Attorney DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 SAN FRANCISCO CA 94105 (415) 848-4800 BCragg@DowneyBrand.com Megan J. Somogyi Attorney At Law DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 SAN FRANCISCO CA 94105 (415) 848-4800 MSomogyi@DowneyBrand.com Sean M. Neal Attorney DUNCAN WEINBERG GENZER & PEMBROKE, P.C. 915 L STREET, STE. 1410 SACRAMENTO CA 95814 (916) 498-0121 SMN@dwgp.com For: City of Long Beach, Public Utilities Department (formerly City of Long Beach, Energy Resources Department) ____________________________________________ Lisa S. Gast Attorney DUNCAN, WEINBERG, GENZER & PEMBROKE, P.C ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 15 - DIRECT ENERGY BUSINESS, LLC 910 LOUISIANA STREET, SUITE B200 HOUSTON TX 77002 (925) 699-6687 Cem.turhal@nrg.com 1667 K STREET, N.W., STE 700 WASHINGTON DC 20006 (202) 467-6370 LSG@dwgp.com For: City of Vernon ____________________________________________ Sylwia Dakowicz Attorney DUNCAN, WEINBERG, GENZER & PEMBROKE, PC 915 L STREET, STE. 1410 SACRAMENTO CA 95814 (916) 713-0010 SD@DWGP.com For: City of Palo Alto and City of Vernon ____________________________________________ James Donovan Administrative Law Judge Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1971 jd8@cpuc.ca.gov Anand Durvasula Legal Division RM. 5130 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2765 ad1@cpuc.ca.gov Rebecca Barker Attorney EARTHJUSTICE 50 CALIFORNIA STREET, SUITE 500 SAN FRANCISCO CA 94111 (415) 217-2056 RBarker@Earthjustice.org Sasan Saadat EARTHJUSTICE 50 CALIFORNIA STREET, SUITE 500 SAN FRANCISCO CA 94111 (415) 217-2000 ssaadat@earthjustice.org Allison Lopez Energy Efficiency Analyst EAST BAY COMMUNITY ENERGY EMAIL ONLY EMAIL ONLY CA 00000 alopez@ebce.org Kriby Bosley EDF TRADING NORTH AMERICA LLC 601 TRAVIS STREET, 17TH FLOOR HOUSTON TX 77002 (281) 653-1719 kirby.bosley@edftrading.com Paul Gendron EDF TRADING NORTH AMERICA LLC 601 TRAVIS STREET, 17TH FLOOR HOUSTON TX 77002 (925) 708-4994 Paul.Gendron@edftrading.com Mich Hein ELECTROCHAEA CORPORATION SEMMELWEISSTRABE 3 82152 PLANEGG-STEINKIRCHEN GERMANY CA 00000 (773) 241-4947 Mich.Hein@Electrochaea.com Brian S. Biering Attorney ELLISON SCHNEIDER HARRIS & DONAN LLP 2600 CAPITOL AVE., STE. 400 SACRAMENTO CA 95816-5931 (916) 447-2166 BSB@esLawFirm.com Andrew B. Brown Attorney ELLISON SCHNEIDER HARRIS & DONLAN LLP 2600 CAPITOL AVE., STE. 400 SACRAMENTO CA 95816 (916) 447-2166 abb@eslawfirm.com Aryeh Gold-Parker Associate Dir ENERGY AND ENVIRONMENTAL ECONOMICS 44 MONTGOMERY ST STE 1500 SAN FRANCISCO CA 94104 (415) 391-5100 R2001007@ethree.com Carolyn Kehrein ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 16 - Jack N. Bellinger General Counsel, Evp ECORP INTERNATIONAL, LLC 10000 MEMORIAL, STE. 200 HOUSTON TX 77024-3444 (713) 520-0993 JBellinger@eCORPusa.com ENERGY MANAGEMENT SERVICES 2602 CELEBRATION WAY WOODLAND CA 95776 (530) 668-5600 cmkehrein@ems-ca.com For: Energy Users Forum ____________________________________________ Steven Hearn Sr. Dir - Mkt & Bus. Development ENERGY TRANSFER PARTNERS EMAIL ONLY EMAIL ONLY TX 00000 Steven.Hearn@EnergyTransfer.com Erika Diamond Vp, Utility And Market Services ENERGYHUB 232 3RD STREET, SUITE 201 BROOKLYN NY 11215 (718) 522-7051 diamond@energyhub.net Joon Hun Seong Sr. Analyst ENVIRONMENTAL DEFENSE FUND 123 MISSION ST, 28TH FL. SAN FRANCISCO CA 94105 (415) 293-6050 JSeong@edf.org Jason Hoyle EQ RESEARCH 1155 KILDAIRE FARM ROAD, STE 203 CARY NC 27511 (919) 825-3341 CPUCdockets@eq-research.com Michel Peter Florio Outside Counsel FLORIO CONSULTING 7823 CREST AVENUE OAKLAND CA 94605 (415) 202-4071 MikeFlorio@RocketMail.com Arthur Fisher Public Advocates Office 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2056 aei@cpuc.ca.gov Jeanne B. Armstrong Joe Greco GRECO ENERGY CONSULTING EMAIL ONLY EMAIL ONLY CA 00000 (775) 527-2038 jgreco@GrecoEnergyConsulting.onmicrosoft.com Janice Lin Co-Founder And President GREEN HYDROGEN COALITION 2150 ALLSTON WAY SUITE 400 BERKELEY CA 94704 (510) 665-7811 Jlin@ghcoalition.org Neha Bazaj GRIDWORKS EMAIL ONLY EMAIL ONLY CA 00000 nbazaj@gridworks.org Sarina Soor GRIDWORKS EMAIL ONLY EMAIL ONLY CA 00000 ssoor@gridworks.org Etchissa Genesis Administrative Law Judge Division 300 Capitol Mall Sacramento CA 95814 4309 (415) 696-7302 eg3@cpuc.ca.gov Stephanie Green External Affairs Division RM. 3-98 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-5245 sjg@cpuc.ca.gov Josh Schellenberg Principal And Coo H&S INSIGHTS EMAIL ONLY ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 17 - Attorney GOODIN, MACBRIDE, SQUERI & DAY, LLP 505 SANSOME ST., STE. 900 SAN FRANCISCO CA 94111 (415) 392-7900 JArmstrong@GoodinMacBride.com EMAIL ONLY AA 00000 (415) 613-6274 josh@hsinsights.com Irma Aguilar HANNA AND MORTON LLP 444 S. FLOWER STREET, SUITE 2530 LOS ANGELES CA 90071 (626) 689-0077 iaguilar@hanmor.com Justin Hagler Executive Division AREA 4-A 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-5355 jh9@cpuc.ca.gov Julie Halligan Public Advocates Office RM. 5041 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1587 jmh@cpuc.ca.gov Karin M. Hieta Public Advocates Office RM. 5010 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-4253 kar@cpuc.ca.gov Bethany Allen Counsel - Regulatory IGS ENERGY 6100 EMERALD PARKWAY DUBLIN OH 43016 (614) 659-5384 Bethany.Allen@igs.com Ernesto Pasos IMPERIAL IRRIGATION DISTRICT 333 EAST BARIONI BLVD. IMPERIAL CA 92251 (760) 339-0794 Epasos@iid.com Robert A. Laurie Sabrina Barber IMPERIAL IRRIGATION DISTRICT 333 EAST BARIONI BLVD. IMPERIAL CA 92251 (760) 482-3686 scbarber@iid.com Scott Harding IMPERIAL IRRIGATION DISTRICT 333 EAST BARIONI BLVD. IMPERIAL CA 92251 (760) 482-3365 SDHarding@iid.com Khalil Johnson Executive Division RM. 514 300 Capitol Mall Sacramento CA 95814 4309 kjo@cpuc.ca.gov Tim Dorpinghaus Director Of Marketing KINDER MORGAN INC. WESTERN REGION EMAIL ONLY EMAIL ONLY AA 00000 (719) 520-4245 tim_dorpinghaus@kindermorgan.com Bruce Kaneshiro Energy Division AREA 4-A 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1187 bsk@cpuc.ca.gov Michele Kito Energy Division AREA 4-A 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2197 mk1@cpuc.ca.gov Jonathan Koltz ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 18 - Asst. General Counsel, Energy IMPERIAL IRRIGATION DISTRICT 333 EAST BARIONI BLVD IMPERIAL CA 92251 (760) 791-1094 ralaurie@iid.com Legal Division RM. 5035 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2760 jk5@cpuc.ca.gov Marlon O. Santa Cruz L.A. DEPT OF WATER AND POWER 111 NORTH HOPE STREET, ROOM 1150 LOS ANGELES CA 90012 (213) 367-1735 marlon.santacruz@LADWP.com Elizabeth M. Kelly Attorney LAW OFFICE OF ELIZABETH KELLY PO BOX 225037 SAN FRANCISCO CA 94122 (415) 535-9998 Beth@emk-law.com Megan M. Myers Attorney LAW OFFICES OF SARA STECK MYERS 122 - 28TH AVENUE SAN FRANCISCO CA 94121 (415) 994-1616 MeganMMyers@yahoo.com For: Center for Energy Efficiency and Renewable Technologies (CEERT) ____________________________________________ Sara Steck Myers Attorney LAW OFFICES OF SARA STECK MYERS 122 - 28TH AVENUE SAN FRANCISCO CA 94121 (415) 387-1904 ssmyers@att.net C. Susie Berlin Attorney LAW OFFICES OF SUSIE BERLIN 1346 THE ALAMEDA, SUITE 7-141 SAN JOSE CA 95126 (408) 778-8478 Berlin@SusieBerlinLaw.com For: City of Long Beach, Public Utilities Department ____________________________________________ Priscila Castillo Kasha Assistant City Attorney LOS ANGELES DEPARTMENT OF WATER & POWER Christian Lambert Public Advocates Office 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1419 cl8@cpuc.ca.gov Franky Lao Public Advocates Office 915 L Street Suite 1140 Sacramento CA 95814 (916) 210-1832 fla@cpuc.ca.gov Scott Logan Public Advocates Office RM. 4108 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1418 sjl@cpuc.ca.gov Melicia Charles Dir - Regulatory MAINSPRING ENERGY, INC. 3601 HAVEN AVENUE MENLO PARK CA 94025 (650) 269-8926 Melicia.Charles@MainspringEnergy.com John Mckinsey Counsel MCKINSEY LAW OFFICE 1121 L STREET, SUITE 700 SACRAMENTO CA 95814 (213) 819-2615 John@JMcKinseylaw.com For: Middle River Power, LLC ____________________________________________ MRW & ASSOCIATES, LLC EMAIL ONLY EMAIL ONLY CA 00000 (510) 834-1999 mrw@mrwassoc.com Emma Maggioncalda ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 19 - 221 NORTH FIGUEROA STREET, SUITE 1000 LOS ANGELES CA 90012 (213) 367-2850 Priscila.Kasha@ladwp.com Energy Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1726 em9@cpuc.ca.gov Alexander Marti Energy Division 320 West 4th Street Suite 500 Los Angeles CA 90013 (213) 266-4775 alz@cpuc.ca.gov Christopher Moore External Affairs Division 320 West 4th Street Suite 500 Los Angeles CA 90013 (213) 576-7095 cm8@cpuc.ca.gov Christopher Myers Public Advocates Office RM. 4104 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2908 cg2@cpuc.ca.gov Jenifer Bosco Staff Attorney NATIONAL CONSUMER LAW CENTER 7 WINTHROP SQUARE, 4TH FL. BOSTON MA 02110 (617) 542-8010 X350 JBosco@nclc.org Kiki Velez NATURAL RESOURCES DEFENSE COUNCIL (NRDC) 111 SUTTER STREET, 21ST FL. SAN FRANCISCO CA 94104 (415) 875-6100 KVelez@nrdc.org Rosanne O'Hara Legal Division RM. 5039 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2386 ro4@cpuc.ca.gov Bob Ramirez OPINION DYNAMICS EMAIL ONLY Jamie Ormond Administrative Law Judge Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1193 jo2@cpuc.ca.gov Ke Hao Ouyang Consumer Protection and Enforcement Division AREA 2-E 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1235 kho@cpuc.ca.gov I Ho Regulatory Relations PACIFIC GAS & ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 973-8794 Annie.Ho@pge.com Bethany Rowell Case Coordinator PACIFIC GAS AND ELECTRIC COMPANY EMAIL ONLY EMAIL ONLY CA 00000 (925) 813-0325 bethany.rowell@pge.com Case Coordination PACIFIC GAS AND ELECTRIC COMPANY EMAIL ONLY EMAIL ONLY CA 00000 (415) 973-2776 RegrelcpucCases@pge.com Chris Mcroberts PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 973-4859 C7MO@pge.com Eileen Cotroneo Regulatory Mgr. PACIFIC GAS AND ELECTRIC COMPANY ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 20 - EMAIL ONLY CA 00000 bramirez@opiniondynamics.com 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 260-0555 EFM2@pge.com Erik Jacobson Dir - Regulatory Relations PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 973-4977 PGETariffs@pge.com For: Pacific Gas and Electric Company ____________________________________________ Jenny Roecks PACIFIC GAS AND ELECTRIC COMPANY EMAIL ONLY EMAIL ONLY AA 00000 (650) 763-6788 Jennifer.Roecks@pge.com M. Grady Mathai-Jackson Attorney PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 (415) 652-5447 Grady.Mathai-Jackson@pge.com Maria Osorio Regulatory Case Coordinator PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE OAKLAND CA 94612 M2OX@pge.com Anthony Dâ€™Aquila PASADENA DEPARTMENT OF WATER & POWER 150 SOUTH LOS ROBLES AVENUE, SUITE 200 PASADENA CA 91101 (626) 744-7916 tdaquila@cityofpasadena.net Jana Kopyciok-Lande Associate Director, Innovation Strategy PENINSULA CLEAN ENERGY EMAIL ONLY EMAIL ONLY CA 00000 (650) 399-3073 jkopyciok-lande@peninsulacleanenergy.com Matthew Rutherford Sr. Regulatory Analyst Greg Lamberg PETERSON POWER SYSTEMS, INC. 2828 TEAGARDEN STREET SAN LEANDRO CA 94577 (510) 292-3151 GALamberg@PetersonPower.com Kaj Peterson Public Advocates Office 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2771 kjp@cpuc.ca.gov Robyn Purchia Administrative Law Judge Division RM. 4300 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2354 rp6@cpuc.ca.gov James Ross RCS, INC. EMAIL ONLY EMAIL ONLY CA 00000 (636) 530-9544 JimRoss@r-c-s-inc.com For: Western States Petroleum Association (WSPA) ____________________________________________ Richard Parks REDEEMER COMMUNITY PARTNERSHIP PO BOX 180499 LOS ANGELES CA 90018 (323) 285-1949 richard@redeemercp.org Abigail Alter ROCKY MOUNTAIN INSTITUTE 1901 HARRISON STREET, STE. 200 OAKLAND CA 94612 (303) 245-1003 AAlter@rmi.org Tom Roth Consultant ROTH ENERGY COMPANY 545 S. FIGUEROA STREET, STE. 1235 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 21 - PENINSULA CLEAN ENERGY AUTHORITY 2075 WOODSIDE ROAD REDWOOD CITY CA 94061 (650) 263-1590 MRutherford@PeninsulaCleanEnergy.com LOS ANGELES CA 90071 (213) 622-6700 RothEnergy@gmail.com Jennifer Venema Sr. Strategic Bus. Planner SACRAMENTO MUNICIPAL UTILITY DISTRICT 6201 S STREET, MS B3N012 SACRAMENTO CA 95817 (916) 732-6555 Jennifer.Venema@smud.org Josh Stoops Gov'T Affairs Rep. - Regulatory SACRAMENTO MUNICIPAL UTILITY DISTRICT 6201 S STREET, MS B404 SACRAMENTO CA 95817 (916) 732-5701 Joshua.Stoops@smud.org Joy Mastache Sr. Attorney SACRAMENTO MUNICIPAL UTILITY DISTRICT 6201 S STREET, MS B406 SACRAMENTO CA 95817 (916) 732-5906 Joy.Mastache@SMUD.org For: Sacramento Municipal Utility District ____________________________________________ Mariah Chavez Regulatory Business Manager SAN DIEGO GAS & ELECTRIC EMAIL ONLY EMAIL ONLY CA 00000 (858) 880-8346 mariah.chavez@sdge.com Brittany Malowney Regulatory Case Manager, Reg Affairs SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK CT SAN DIEGO CA 92123-1530 (619) 807-8229 BMalowney@sdge.com Central Files SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP31-E SAN DIEGO CA 92123 (858) 654-1240 Erica L. Martin Sr. Attorney SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP32D SAN DIEGO CA 92123-1530 (858) 654-1813 EMartin8@SDGE.com Jonathan Newlander Sr. Counsel SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP32D SAN DIEGO CA 92123 (828) 654-1652 JNewlander@sdge.com Kathy Anisovets Mgr - Regulatory SAN DIEGO GAS & ELECTRIC COMPANY EMAIL ONLY EMAIL ONLY CA 00000 (619) 613-0852 KAnisove@sdge.com Kellen C. Gill California Regulatory Affairs SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK CT., CP32F SAN DIEGO CA 92123-1530 (619) 696-2972 KGill@sdge.com Shivani Sidhar Regulatory Case Mgr. SAN DIEGO GAS & ELECTRIC COMPANY 601 VAN NESS AVENUE. STE. 2090 SAN FRANCISCO CA 94102 (858) 637-7914 SSidhar1@SempraUtilities.com Kimberly Chong Case Mgr - Regulatory SAN DIEGO GAS AND ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP32F SAN DIEGO CA 92123 (619) 676-5833 KChong@sdge.com ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 22 - CentralFiles@SempraUtilities.com Christopher A. Summers Regulatory Business Mgr. SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK CT., CP32F SAN DIEGO CA 92123 (858) 637-7914 CSummers@SempraUtilities.com Grace Kay Legislative & Regulatory Compliance SAN FRANCISCO PUC 525 GOLDEN GATE AVENUE, 7TH FL. SAN FRANCISCO CA 94102 (415) 554-3129 GKay@SFwater.org For: City and County of San Francisco ____________________________________________ Taylor Knecht Sr Power Resources Specialist SAN JOSE CLEAN ENERGY REGULATORY COMPLIANCE AND POLICY 200 EAST SANTA CLARA STREET, 14TH FLOOR SAN JOSE CA 95113 (408) 535-4999 Taylor.Knecht@SanJoseCa.gov Phillip Muller President SCD ENERGY SOLUTIONS 436 NOVA ALBION WAY SAN RAFAEL CA 94903 (415) 479-1710 PhilM@SCDenergy.com Central Files SEMPRA ENERGY UTILITIES CENTRAL FILES EMAIL ONLY EMAIL ONLY CA 00000 CentralFiles@semprautilities.com Firas Abu-Sneneh SF PUBLIC UTILITIES COMMISSION 525 GOLDEN GATE AVE SAN FRANCISCO CA 94102 (415) 554-2436 FAbuSneneh@SFwater.org Kieran Yater SF PUBLIC UTILITIES COMMISSION 525 GOLDEN GATE AVE SAN FRANCISCO CA 94102 (415) 554-0758 kyater@sfwater.org Christa Lim Regulatory Affairs (West) SHELL ENERGY EMAIL ONLY EMAIL ONLY CA 00000 Lisa A. Cottle Attorney SHEPPARD MULLIN RICHTER & HAMPTON LLP FOUR EMBARCADERO CENTER, 17TH FL. SAN FRANCISCO CA 94111 (415) 774-3117 LCottle@SheppardMullin.com Louise Dyble Attorney At Law SHEPPARD MULLIN RICHTER & HAMPTON LLP FOUR EMBARCADERO CENTER, 17TH FLOOR SAN FANCISCO CA 94111 (415) 774-2997 ldyble@sheppardmullin.com Leah Bahramipour Legal Assist. SIERRA CLUB 2101 WEBSTER ST, SUITE 1300 OAKLAND CA 94612 (415) 977-5649 Leah.Bahramipour@SierraClub.org Nihal Shrinath Associate Attorney SIERRA CLUB 2101 WEBSTER STREET, SUITE 1300 OAKLAND CA 94612 (415) 977-5566 Nihal.Shrinath@SierraClub.org Audra Hartmann Principal SMITH, WATTS & HARTMANN 925 L STREET, SUITE 220 SACRAMENTO CA 95814 (916) 446-5508 AHartmann@SWMconsult.com Alex Gutierrez SOUTHERN CALIFORNIA EDISON 2244 WALNUT GROVE AVE ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 23 - (858) 241-4107 christa.lim@shell.com Jen Garlock Attorney At Law SHEPPARD MULLIN RICHTER & HAMPTON LLP 333 S. HOPE STREET, 43RD FLOOR LOS ANGELES CA 90071 (213) 617-5570 jgarlock@sheppardmullin.com ROSEMEAD CA 91770 Alex.Gutierrez@sce.com Leo Kim SOUTHERN CALIFORNIA EDISON EMAIL ONLY EMAIL ONLY CA 00000 leo.kim@sce.com Case Administration SOUTHERN CALIFORNIA EDISON COMPANY 8631 RUSH STREET ROSEMEAD CA 91770 (626) 302-6906 Case.Admin@sce.com Dhaval Dagli Principal Manager SOUTHERN CALIFORNIA EDISON COMPANY 8631 RUSH ST. ROSEMEAD CA 91770 Dhaval.Dagli@sce.com Ka-Wing Poon SOUTHERN CALIFORNIA EDISON COMPANY 2244 WALNUT GROVE AVE ROSEMEAD CA 91770 Ka-wing.Poon@sce.com Mario E. Dominguez Attorney SOUTHERN CALIFORNIA EDISON COMPANY 2244 WALNUT GROVE AVE., / PO BOX 800 ROSEMEAD CA 91770 (626) 302-6522 Mario.E.Dominguez@sce.com Melodee Black SOUTHERN CALIFORNIA EDISON COMPANY 8631 RUSH STREET ROSEMEAD CA 91770 (626) 302-3104 Melodee.Black@sce.com Rebecca Meiers-De Pastino Sr. Attorney SOUTHERN CALIFORNIA EDISON COMPANY 2244 WALNUT GROVE AVENUE ROSEMEAD CA 91770 (626) 302-6016 Rebecca.Meiers.DePastino@SCE.com Angela Whatley Attorney SOUTHERN CALIFORNIA GAS COMPANY 555 WEST 5TH STREET, GT14E7 LOS ANGELES CA 90013 (213) 218-5465 AWhatley@SoCalGas.com Avisha A. Patel Attorney SOUTHERN CALIFORNIA GAS COMPANY 555 WEST FIFTH STREET, GT-14E7 LOS ANGELES CA 90013 (213) 244-2954 apatel@socalgas.com Edith Moreno Regulatory Affairs SOUTHERN CALIFORNIA GAS COMPANY 601 VAN NESS AVENUE SUITE 2090 SAN FRANCISCO CA 94102 (213) 244-8263 EMoreno5@SoCalGas.com Gregory Healy Regulatory Business Manager SOUTHERN CALIFORNIA GAS COMPANY 555 WEST 5TH STREET, SUITE 1400 LOS ANGELES CA 90013 (213) 244-3314 GHealy@socalgas.com Jeffrey B. Fohrer Sr. Counsel - Regulatory SOUTHERN CALIFORNIA GAS COMPANY 555 W. FIFTH STREET, GT-14E7 LOS ANGELES CA 90013 (213) 244-3061 JFohrer@SoCalGas.com Jeffrey L. Salazar SOUTHERN CALIFORNIA GAS COMPANY ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 24 - Stephen A. Keehn Senior Advisor, Reg Affairs & Compl SOUTHERN CALIFORNIA EDISON COMPANY 8631 RUSH STREET ROSEMEAD CA 91770 stephen.keehn@sce.com 555 W. FIFTH STREET, GT14D6 LOS ANGELES CA 90013 jlsalazar@semprautilities.com Joe Mock Dir - Regulatory Affairs SOUTHERN CALIFORNIA GAS COMPANY 555 WEST FIFTH STREET, SUITE 1400 LOS ANGELES CA 90013 (213) 244-3718 JMock@SoCalGas.com Karen Mar Regulatory Affairs SOUTHERN CALIFORNIA GAS COMPANY 555 W. 5TH STREET, GT14D6 LOS ANGELES CA 90013 KMar@socalgas.com Megan Silva Mgr - Regulatory SOUTHERN CALIFORNIA GAS COMPANY 555 W. 5TH STREET, GT14D6 LOS ANGELES CA 90013 (213) 231-0743 MSilva@SoCalGas.com Melissa A. Hovsepian Assist. General Counsel SOUTHERN CALIFORNIA GAS COMPANY 555 WEST FIFTH STREET, GT-14E7 LOS ANGELES CA 90013 (213) 244-3978 MHovsepian@SoCalGas.com Pamela Wu Regulatory Case Mgr. SOUTHERN CALIFORNIA GAS COMPANY 555 W. FIFTH STREET, GT14D6 LOS ANGELES CA 90013 (213) 244-3047 PWu@SoCalGas.com Paul Deang Customer Program SOUTHERN CALIFORNIA GAS COMPANY 555 W. 5TH STREET GT14D6 LOS ANGELES CA 90013 (213) 244-4375 PDeang@SoCalGas.com Setareh Mortazavi Attorney At Law SOUTHERN CALIFORNIA GAS COMPANY SOUTHWEST GAS CORPORATION 8360 S. DURANGO DRIVE, LVD-110 LAS VEGAS NV 89113 (702) 780-9984 RegServe@swgas.com Issac Wallace Senior Analyst, Regulatory SOUTHWEST GAS CORPORATION 8360 SOUTH DURANGO DRIVE LAS VEGAS CA 89113 issac.wallace@swgas.com Tashia Garry Legal Assistant SOUTHWEST GAS CORPORATION 8360 S. DURANGO DRIVE, LVD-110 LAS VEGAS NV 89113 (702) 364-3312 Tashia.Garry@swgas.com Valerie Ontiveroz Regulatory Mgr / Ca SOUTHWEST GAS CORPORATION 8360 S. DURANGO DRIVE, LVD-110 LAS VEGAS NV 89113-0002 Valerie.Ontiveroz@swgas.com Michael Rochman Managing Director SPURR 1850 GATEWAY BLVD, SUITE 235 CONCORD CA 94520 (925) 743-1292 Service@spurr.org Jennifer Fry Ferc Specialist / Practice Assist. STOEL RIVES LLP 760 SW NINTH AVENUE, SUITE 3000 PORTLAND OR 97205 (503) 294-9273 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 25 - 555 WEST 5TH STREET, SUITE 1400 LOS ANGELES CA 90013 (213) 244-2975 SMortazavi@socalgas.com Kathryn L. Mccoy Assoc. Gen. Counsel SOUTHERN COMPANY GAS 1200 SMITH ST., STE. 900 HOUSTON TX 77002 (832) 397-8642 KMcCoy@SouthernCo.com For: Central Valley Gas Storage ____________________________________________ Regulatory@Stoel.com Lilly B. Mckenna Attorney STOEL RIVES LLP ONE MONTGOMERY STREET, STE 3230 SAN FRANCISCO CA 94104 (415) 500-6527 Lilly.McKenna@Stoel.com For: Shell Energy North America (US) L.P. ____________________________________________ Meghan O'Brien STOEL RIVES LLP 501 WEST BROADWAY, SUITE 2000 SAN DIEGO CA 92101 (858) 794-4112 Meghan.OBrien@Stoel.com Meghan Oâ€™Brien STOEL RIVES LLP EMAIL ONLY EMAIL ONLY AA 00000 Meghan.obrien@stoel.com Samantha Holdstock Paralegal STOEL RIVES LLP 500 CAPITOL MALL, STE. 1600 SACRAMENTO CA 95814 (916) 319-4650 Samantha.Holdstock@Stoel.com Sarah E. Kozal Attorney STOEL RIVES LLP 500 CAPITOL MALL, SUITE 1600 SACRAMENTO CA 95814 (916) 447-0700 energy_regulatory_ca@stoel.com Dr. Eric C. Woychik Executive Consultant & Principal STRATEGY INTEGRATION LLC EMAIL ONLY EMAIL ONLY CA 00000 (510) 387-5220 eric@strategyi.com Sebastian Sarria Energy Division Nathaniel Skinner Public Advocates Office AREA 4-A 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1393 nws@cpuc.ca.gov Jean Spencer Energy Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2630 js5@cpuc.ca.gov Grey Staples THE MENDOTA GROUP, LLC EMAIL ONLY EMAIL ONLY MN 00000 (651) 204-0458 GStaples@MendotaGroup.com A Mireille Fall-Fry THE UTILITY REFORM NETWORK 360 GRAND AVENUE, SUITE 150 OAKLAND CA 94610 (415) 929-8876 X309 afall@turn.org Jalal Awan THE UTILITY REFORM NETWORK 360 GRAND AVENUE SUITE 150 OAKLAND CA 94610 (415) 929-8876 jawan@turn.org Sylvie Ashford THE UTILITY REFORM NETWORK 360 GRAND AVENUE, STE. 150 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 26 - 320 West 4th Street Suite 500 Los Angeles CA 90013 (213) 266-4773 ses@cpuc.ca.gov Sean A. Simon Executive Division RM. 5201 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-3791 svn@cpuc.ca.gov OAKLAND CA 94610 (415) 929-8876 Sashford@turn.org Thomas J. Long Legal Director THE UTILITY REFORM NETWORK 785 MARKET ST., STE. 1400 SAN FRANCISCO CA 94103 (415) 929-8876 X-303 TLong@turn.org Donovan Tan Consumer Protection and Enforcement Division 320 West 4th Street Suite 500 Los Angeles CA 90013 (213) 266-4739 dtn@cpuc.ca.gov Benjamin Tang Public Advocates Office 320 West 4th Street Suite 500 Los Angeles CA 90013 (916) 531-2059 bt5@cpuc.ca.gov Matthew Taul Public Advocates Office 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-3308 mta@cpuc.ca.gov Adenike Adeyeye Mgr / Sr. Analyst UNION OF CONCERNED SCIENTISTS 500 12TH STREET, STE. 340 OAKLAND CA 94607 (510) 809-1565 AAdeyeye@UCSUSA.org Courtney Cook Paralegal / Office Admin. UTILITY CONSUMERS' ACTION NETWORK 3405 KENYON STREET, SUITE 401 SAN DIEGO CA 92110 (619) 696-6966 Courtney@ucan.org Edward Lopez Executive Dir UTILITY CONSUMERSâ€™ ACTION NETWORK Jane Krikorian, J.D. Cpuc Program Manager UTILITY CONSUMERSâ€™ ACTION NETWORK 3405 KENYON ST, SUITE 401 SAN DIEGO CA 92110 (619) 696-6966 jane@ucan.org Kavya Balaraman Reporter UTILITY DIVE EMAIL ONLY EMAIL ONLY DC 00000 Kavya@UtilityDive.com Cathleen Colbert Sr. Dir - Regulatory, Western VISTA CORPORATION 325 7TH STREET NW, SUITE 520 WASHINGTON DC 20004 (412) 720-7016 Cathleen.Colbert@VistraCorp.com David Van Dyken Administrative Law Judge Division 300 Capitol Mall Sacramento CA 95814 4309 (916) 928-2514 dvd@cpuc.ca.gov Aswathy Vinod Administrative Law Judge Division 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1234 av5@cpuc.ca.gov Inna Vinogradov Legal Division RM. 5040 ************ SERVICE LIST *********** Last Updated on 28-JAN-2025 by: AHB R2409012 LIST - 27 - 3405 KENYON ST. SUITE 401 SAN DIEGO CA 92110 (619) 696-6966 Edward@ucan.org Jane Kirkorian, J. D. Supervisor - Adv. & Admin. UTILITY CONSUMERSâ€™ ACTION NETWORK 3405 KENYON STREET, SUITE 401 SAN DIEGO CA 92110 (619) 696-6966 jane@ucan.org 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-1793 iv2@cpuc.ca.gov Eric Vo Public Advocates Office 505 Van Ness Avenue San Francisco CA 94102 3298 evo@cpuc.ca.gov Gregory Contreras WELLHEAD ELECTRIC COMPANY, INC. 650 BERCUT DR. SUITE C SACRAMENTO CA 95811 (916) 447-5171 cpucfilings@wellhead.com Kevin Smith WESTERN ENERGY LAW, P.C. EMAIL ONLY EMAIL ONLY CA 00000 (916) 835-6454 kevin@westernenergylaw.com Scott Miller Exe. Dir WESTERN POWER TRADING FORUM EMAIL ONLY EMAIL ONLY CA 00000 SMiller@WPTF.org Catherine Reheis-Boyd President WESTERN STATES PETROLEUM ASSOCIATION 1415 L STREET, SUITE 900 SACRAMENTO CA 95814 (916) 498-7752 CReheis@wspa.org For: WSPA ____________________________________________ Abhilasha Wadhwa Energy Division 300 Capitol Mall Sacramento CA 95814 4309 (916) 823-4774 awb@cpuc.ca.gov"
  },
  {
    "id": 4,
    "title": "557608897",
    "category": "Uncategorized",
    "summary": "San Diego Community Power and the Consumer Protection and Enforcement Division submitted a joint response regarding the need for hearings in an appeal by San Diego Community Power from a citation issued by the Enforcement Division.",
    "url": "/documents/557608897.pdf",
    "lastModified": "2025-03-03T21:13:35.557Z",
    "size": 230916,
    "author": "Unknown",
    "creationDate": "2025-03-04T02:28:27.000Z",
    "pageCount": 3,
    "producer": "macOS Version 15.3.1 (Build 24D70) Quartz PDFContext",
    "textContent": "BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Appeal of San Diego Community Power from Citation No. E-4195-0173 issued by Consumer Protection and Enforcement Division. K.24-05-026 CERTIFICATE OF SERVICE I, Alicia Zaloga, hereby certify that I have this day caused a copy of the Joint Response of San Diego Community Power and the Consumer Protection and Enforcement Division on Meet and Confer Regarding Need for Hearings to be served pursuant to Commission Rules of Practice and Procedure upon the individuals listed below via electronic mail. Dated March 3, 2025 at Cary, North Carolina. /s/ Alicia Zaloga Alicia Zaloga KEYES & FOX LLP 1155 Kildaire Farm Road, Ste. 202 Cary, NC 27511 Email: azaloga@keyesfox.com FILED 02/27/25 04:59 PM K2405026 CPUC Home CALIFORNIA PUBLIC UTILITIES COMMISSION Service Lists PROCEEDING: K2405026 - APPEAL OF SAN DIEGO FILER: SAN DIEGO COMMUNITY POWER LIST NAME: LIST LAST CHANGED: FEBRUARY 13, 2025 Download the Comma-delimited File About Comma-delimited Files Back to Service Lists Index Parties RITTA MERZA JACOB SCHLESINGER CALIF PUBLIC UTILITIES COMMISSION ATTORNEY LEGAL DIVISION KEYES & FOX LLP 320 West 4th Street Suite 500 580 CALIFORNIA STREET, 12TH FLOOR Los Angeles, CA 90013 SAN FRANCISCO, CA 94104 FOR: CONSUMER PROTECTION AND FOR: SAN DIEGO COMMUNITY POWER ENFORCEMENT DIVISION (CPED) Information Only BLAKE ELDER LENA AFARY EQ RESEARCH LLC CALIF PUBLIC UTILITIES COMMISSION 1155 KILDAIRE FARM ROAD, SUITE 203 ADMINISTRATIVE LAW JUDGE DIVISION CARY, NC 27511 320 West 4th Street Suite 500 Los Angeles, CA 90013 VEERA TYAGI KE HAO OUYANG SAN DIEGO COMMUNITY POWER CALIF PUBLIC UTILITIES COMMISSION PO BOX 12716 UTILITY & PAYPHONE ENFORCEMENT BRANCH SAN DIEGO, CA 92112 AREA 2-E 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 NATHAN CHRISTO VICKY ZHONG CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION UTILITY & PAYPHONE ENFORCEMENT BRANCH UTILITY & PAYPHONE ENFORCEMENT BRANCH AREA 2-E AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 TIM LINDL REGULATORY CLERK COUNSEL BRAUN BLAISING & WYNNE, PC (BB&W) KEYES & FOX LLP 555 CAPITOL MALL, STE 570 580 CALIFORNIA STREET, 12TH FL. SACRAMENTO, CA 95814 SAN FRANCISCO, CA 94104 FOR: SAN DIEGO COMMUNITY POWER SCOTT BLAISING ATTORNEY BRAUN BLAISING & WYNNE, P.C. 555 CAPITOL MALL, SUITE 570 SACRAMENTO, CA 95814 TOP OF PAGE BACK TO INDEX OF SERVICE LISTS"
  },
  {
    "id": 5,
    "title": "557609902",
    "category": "Uncategorized",
    "summary": "SAN DIEGO GAS & ELECTRIC COMPANY (U 902-E) filed an amendment to its public safety power shutoff post-event group report for January 7 – January 16, 2025 in proceeding R.18-12-005 before the California Public Utilities Commission.",
    "url": "/documents/557609902.pdf",
    "lastModified": "2025-03-03T21:13:42.787Z",
    "size": 653518,
    "author": "LFOrtiz",
    "creationDate": "2025-02-28T22:45:56.000Z",
    "pageCount": 23,
    "producer": "Acrobat Distiller 20.0 (Windows)",
    "textContent": "\u0003 BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Order Instituting Rulemaking to Examine Electric Utility De-Energization of Power Lines in Dangerous Conditions. Rulemaking 18-12-005 (Filed December 13, 2018) \u0003 CERTIFICATE OF SERVICE I hereby certify that a copy of SAN DIEGO GAS & ELECTRIC COMPANY (U 902-E) AMENDMENT TO PUBLIC SAFETY POWER SHUTOFF POST- EVENT GROUP REPORT FOR JANUARY 7 – JANUARY 16, 2025 has been electronically mailed to each party of record of the service list in R.18-12-005. Executed this 28th day of February, 2025 at San Diego, California. /s/ Lisa Fucci-Ortiz Lisa Fucci-Ortiz FILED 02/28/25 04:59 PM R1812005 CPUC Home CALIFORNIA PUBLIC UTILITIES COMMISSION Service Lists PROCEEDING: R1812005 - CPUC - OIR TO EXAMIN FILER: CPUC LIST NAME: LIST LAST CHANGED: FEBRUARY 24, 2025 Download the Comma-delimited File About Comma-delimited Files Back to Service Lists Index Parties CHARLES H. CARRATHERS III TIMOTHY K. CLARK ASSOCIATE GENERAL COUNSEL SR. ATTORNEY FRONTIER PACIFICORP (ROCKY MOUNTAIN POWER) EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 FOR: FRONTIER FOR: PACIFIC POWER & PACIFICORP VERA YAKOVLEVA JORDAN PINJUV REGULATORY AND LEGISLATIVE POLICY MGR PARTNER REDWOOD COAST ENERGY AUTHORITY WILKINSON BARKER KNAUER LLP EMAIL ONLY 2138 W 32ND AVENUE, SUITE 300 EMAIL ONLY, CA 00000 DENVER, CO 80211 FOR: REDWOOD COAST ENERGY AUTHORITY FOR: CTIA - THE WIRELESS ASSOCIATION ROBERT E. RALGAND C.C. SONG ATTORNEY DIR - REGULATORY POLICY COUNTY OF L.A., DEPT. OF PUBLIC HEALTH CLEAN POWER ALLIANCE OF SO. CALIF. 500 W. TEMPLE STREET, STE. 602 555 W. 5TH STREET, 35TH FLOOR LOS ANGELES, CA 90012 LOS ANGELES, CA 90013 FOR: COUNTY OF LOS ANGELES, DEPARTMENT FOR: CLEAN POWER ALLIANCE OF SOUTHERN OF PUBLIC HEALTH (LACDPH) CALIFORNIA RITTA MERZA GYMEKA WILLIAMS CALIF PUBLIC UTILITIES COMMISSION COORDINATOR - EMERGENCY MGNT LEGAL DIVISION COUNTY OF LOS ANGELES 320 West 4th Street Suite 500 1275 NORTH EASTERN AVENUE Los Angeles, CA 90013 LOS ANGELES, CA 90063 FOR: PUBLIC ADVOCATE OFFICE FOR: COUNTY OF LOS ANGELES WILLIAM E. NAYLOR DANIEL W. DOUGLASS COMMUNITY ADVOCATES ATTORNEY 1639 OAK DRIVE DOUGLASS & LIDDELL TOPANGA, CA 90290 5737 KANAN ROAD, STE. 610 FOR: JANE E. TERJUNG & WILLIAM E. NAYLOR AGOURA HILLS, CA 91301-1601 FOR: DIRECT ACCESS CUSTOMER COALITION & ON BEHALF OF ENERGY USERS FORUM OLIVIA SAMAD KEITH SWITZER SR. ATTORNEY BEAR VALLEY ELECTRIC SERVICE, INC. SOUTHERN CALIFORNIA EDISON COMPANY 630 EAST FOOTHILL BLVD. 2244 WALNUT GROVE AVENUE / PO BOX 800 SAN DIMAS, CA 91773 ROSEMEAD, CA 91770 FOR: BEAR VALLEY ELECTRIC SERVICE, INC. FOR: SOUTHERN CALIFORNIA EDISON COMPANY DIANE CONKLIN DAVID CHENG SPOKESPERSON STAFF ATTORNEY MUSSEY GRADE ROAD ALLIANCE THE UTILITY REFORM NETWORK PO BOX 683 1620 5TH AVENUE, SUITE 810 RAMONA, CA 92065 SAN DIEGO, CA 92101 FOR: MUSSEY GRADE ROAD ALLIANCE FOR: THE UTILITY REFORM NETWORK (TURN) EDWARD LOPEZ MALINDA DICKENSON EXECUTIVE DIR DIR - LEGAL & EXEC. UTILITY CONSUMERSâ€™ ACTION NETWORK THE PROTECT OUR COMMUNITIES FOUNDATION 3405 KENYON ST. SUITE 401 4452 PARK BLVD., STE 309 SAN DIEGO, CA 92110 SAN DIEGO, CA 92116 FOR: UTILITY CONSUMERSâ€™ ACTION NETWORK FOR: PROTECT OUR COMMUNITIES FOUNDATION HOLLY CRAWFORD LAURA FULTON DIR SENIOR COUNSEL COUNTY OF S.D. OFFICE OF EMERGENCY SRVC SAN DIEGO GAS & ELECTRIC COMPANY 5580 OVERLAND AVE., STE. 100 8330 CENTURY PARK, CP32D SAN DIEGO, CA 92123 SAN DIEGO, CA 92123 FOR: COUNTY OF SAN DIEGO OFFICE OF FOR: SAN DIEGO GAS & ELECTRIC COMPANY EMERGENCY SERVICES (SDG&E) STEPHEN H. KUKTA RYAN M. F. BARON DIRECTOR AND SENIOR COUNSEL ATTORNEY T-MOBILE WEST LLC BEST BEST & KRIEGER, LLP T-MOBILE REGULATORY AFFAIRS 18101 VON KARMAN AVE. STE. 1000 45750 CIELITO DRIVE IRVINE, CA 92612 INDIAN WELLS, CA 92210-8406 FOR: VALLEY CENTER MUNICIPAL WATER FOR: SPRINT DISTRICT (VCMWD) RYAN M. F. BARON RYAN M. F. BARON ATTORNEY ATTORNEY BEST BEST & KRIEGER, LLP BEST BEST & KRIEGER LLP 18101 VON KARMAN AVE., STE. 1000 18101 VON KARMAN AVENUE, STE. 1000 IRVINE, CA 92612 IRVINE, CA 92612 FOR: CITY OF LAFAYETTE FOR: PADRE DAM MUNICIPAL WATER DISTRICT (PDMWD) RYAN M.F. BARON JACK BROUWER ATTORNEY DIR. BEST BEST & KRIEGER LLP UNIVERSITY OF CALIFORNIA IRVINE 18101 VON KARMAN AVENUE, STE 1000 NATIONAIL FUEL CELL RESEARCH CENTER IRVINE, CA 92612 UNIVERSITY OF CALIFORNIA FOR: MUNICIPAL WATER DISTRICT OF ORANGE IRVINE, CA 92697-3550 COUNTY (MWDOC) FOR: NATIONAL FUEL CELL RESEARCH CENTER JEREMIAH OWEN JEREMY WAEN PRESIDENT DIR - REGULATORY THE ACTON TOWN COUNCIL PENINSULA CLEAN ENERGY AUTHORITY PO BOX 810 2075 WOODSIDE RD. ACTON, CA 93510 REDWOOD CITY, CA 94061 FOR: ACTION TOWN COUNCIL FOR: PENINSULA CLEAN ENERGY AUTHORITY RACHAEL E. KOSS AMY C. YIP-KIKUGAWA ATTORNEY CALIF PUBLIC UTILITIES COMMISSION ADAMS BROADWELL JOSEPH & CARDOZO LEGAL DIVISION 601 GATEWAY BOULEVARD, SUITE 1000 ROOM 4107 SO. SAN FRANCISCO, CA 94080 505 VAN NESS AVENUE FOR: COALITION OF CALIFORNIA UTILITY SAN FRANCISCO, CA 94102-3214 EMPLOYEES FOR: PUBLIC ADVOCATES OFFICE WILLIAM ROSTOV JAMES M. BIRKELUND DEPUTY CITY ATTORNEY PRESIDENT CITY AND COUNTY OF SAN FRANCISCO SMALL BUSINESS UTILITY ADVOCATES OFFICE OF CITY ATTORNEY DENNIS HERRERA 548 MARKET STREET, STE. 11200 1 DR. CARLTON B. GOODLETT PL., RM 234 SAN FRANCISCO, CA 94104 SAN FRANCISCO, CA 94102-5408 FOR: SMALL BUSINESS UTILITY ADVOCATES FOR: CITY AND COUNTY OF SAN FRANCISCO JULIA KANTOR JANE WHANG COUNSEL SR. COUNSEL - REGULATORY KEYES & FOX LLP VERIZON 580 CALIFORNIA STREET, 12TH FLOOR 201 SPEAR STREET, 7TH FL. SAN FRANCISCO, CA 94104 SAN FRANCISCO, CA 94105 FOR: SUNRUN INC. FOR: CELLCO PARTNERSHIP LLC D/B/A VERIZON WIRELESS MEGAN J. SOMOGYI MEGAN J. SOMOGYI ATTORNEY AT LAW ATTORNEY AT LAW DOWNEY BRAND LLP DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 455 MARKET STREET, SUITE 1500 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: COUNTY OF NEVADA FOR: COUNTY OF MARIN MEGAN J. SOMOGYI MEGAN J. SOMOGYI ATTORNEY AT LAW ATTORNEY AT LAW DOWNEY BRAND LLP DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 455 MARKET STREET, SUITE 1500 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: CITY OF SANTA ROSA FOR: COUNTY OF MENDOCINO, THE COUNTY OF NAPA, AND THE COUNTY OF SONOMA MEGAN J. SOMOGYI MEGAN J. SOMOGYI ATTORNEY AT LAW ATTORNEY AT LAW DOWNEY BRAND LLP DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 455 MARKET STREET, SUITE 1500 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: CITY OF MOORPARK FOR: COUNTY OF SAN LUIS OBISPO MEGAN J. SOMOGYI MEGAN J. SOMOGYI ATTORNEY AT LAW ATTORNEY AT LAW DOWNEY BRAND LLP DOWNEY BRAND LLP 455 MARKET STREET, SUITE 1500 455 MARKET STREET, SUITE 1500 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: CITY OF SIMI VALLEY FOR: KERN COUNTY MEGAN J. SOMOGYI MICHAEL ALCANTAR ATTORNEY AT LAW ATTORNEY AT LAW DOWNEY BRAND LLP BUCHALTER, A PROFESSIONAL CORPORATION 455 MARKET STREET, SUITE 1500 55 SECOND STREET, SUITE 1700 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: COUNTY OF SANTA BARBARA FOR: WESTERN STATES PETROLEUM ASSOCIATION (WSPA) NORA SHERIFF NORA SHERIFF ATTORNEY COUNSEL BUCHALTER, A PROFESSIONAL CORPORATION BUCHALTER, A PROFESSIONAL CORPORATION 55 SECOND STREET, STE 1700 425 MARKET STREET, 29TH FLR SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105-2491 FOR: CITY OF RIVERSIDE FOR: ENERGY PRODUCERS AND USERS COALITION NORA SHERIFF, ESQ. MARGARET M. THOMSON ATTORNEY AVP - SR. LEGAL COUNSEL BUCHALTER, A PROFESSIONAL CORPORATION AT&T SERVICES, INC. 55 SECOND STREET, SUITE 1700 430 BUSH STREET, 6TH FL. SAN FRANCISCO, CA 94105-3493 SAN FRANCISCO, CA 94108 FOR: CA LARGE ENERGY CONSUMERS FOR: AT&T SERVICES INC. A/K/A PACIFIC ASSOCIATION BELL TELEPHONE COMPANY LISA A. COTTLE STEVEN F. GREENWALD ATTORNEY ATTORNEY SHEPPARD MULLIN RICHTER & HAMPTOM LLP DAVIS WRIGHT TREMAINE LLP FOUR EMBARCADERO CENTER, 17TH FLOOR 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO, CA 94111 SAN FRANCISCO, CA 94111 FOR: NEXTERA ENERGY TRANSMISSION WEST, FOR: AD HOC COMMITTEE OF SENIOR LLC (NEET) UNSECURED NOTEHOLDERS OF PACIFIC GAS AND ELECTRIC COMPANY SUZANNE TOLLER MARI L. DAVIDSON ATTORNEY ATTORNEY DAVIS WRIGHT TREMAINE LLP NOSSAMAN LLP 50 CALIFORNIA STREET, 23RD FLR 50 CALIFORNIA STREET, 34TH FL. SAN FRANCISCO, CA 94111 SAN FRANCISCO, CA 94111-4799 FOR: COMCAST PHONE OF CALIFORNIA, LLC FOR: CALIFORNIA WATER ASSOCIATION STEVEN MOSS MEGAN M. MYERS PARTNER COUNSEL M.CUBED LAW OFFICES OF MEGAN M. MYERS 296 LIBERTY STREET 110 OXFORD STREET SAN FRANCISCO, CA 94114 SAN FRANCISCO, CA 94134 FOR: LOCAL GOVERNMENT SUSTAINABLE FOR: CALIFORNIA STATE ASSOCIATION OF ENERGY COALITION (LGSEC) COUNTIES DEBRA LLOYD THOMAS GREGORY UTILITIES COMPLIANCE MANAGER DEPUTY DIR CITY OF PALO ALTO UTILITIES CENTER FOR INDEPENDENT LIVING 1007 ELWELL CT. 2490 MARINER SQUARE LOOP, STE. 210 PALO ALTO, CA 94303 ALAMEDA, CA 94501 FOR: BAY AREA MUNICIPAL TRANSMISSION FOR: CENTER FOR INDEPENDENT LIVING GROUP (THECIL) ANDY SCHWARTZ DOUGLAS E. COTY MANAGING POLICY ADVISOR ATTORNEY TESLA, INC BOLD, POLISNER, MADDOW, NELSON & JUDSON 901 PAGE AVENUE 2125 OAK GROVE ROAD, SUITE 210 FREMONT, CA 94538 WALNUT CREEK, CA 94598 FOR: TESLA, INC FOR: CONTRA COSTA WATER DISTRICT CLAIRE HUANG KENNETH LEE REGULATORY ANALYST II ATTORNEY AVA COMMUNITY ENERGY PACIFIC GAS AND ELECTRIC COMPANY 1999 HARRISON STREET 300 LAKESIDE DRIVE OAKLAND, CA 94612 OAKLAND, CA 94612 FOR: AVA COMMUNITY ENERGY AUTHORITY FOR: PACIFIC GAS AND ELECTRIC COMPANY F/K/A EAST BAY COMMUNITY ENERGY (EBCE) LEON BLOOMFIELD PATRICK M. ROSVALL ATTORNEY PARTNER LAW OFFICES OF LEON M. BLOOMFIELD BRB LAW LLP 1970 BROADWAY, SUITE 1200 436 14TH STREET, STE. 1205 OAKLAND, CA 94612 OAKLAND, CA 94612 FOR: T-MOBILE WEST LLC FOR: SMALL LECS: CALAVERAS TELEPHONE CO., CAL-ORE TELEPHONE CO., DUCOR TELEPHONE CO., FORESTHILL TELEPHONE CO., HAPPY VALLEY TELEPHONE CO., HORNITOS TELEPHONE CO., KERMAN TELEPHONE CO., PINNACLES TELEPHONE CO., THE PONDEROSA TELEPHONE CO., SIERRA TELEPHONE CO., INC., THE SISKIYOU TELEPHONE CO., VOLCANO TELEPHONE CO., AND WINTERHAVEN TELEPHONE CO. SEAN P. BEATTY MELISSA W. KASNITZ PARTNER LEGAL DIR BRB LAW LLP CENTER FOR ACCESSIBLE TECHNOLOGY 436 14TH STREET, STE. 1205 3075 ADELINE STREET, STE. 220 OAKLAND, CA 94612 BERKELEY, CA 94703 FOR: CONSOLIDATED COMMUNICATIONS OF FOR: CENTER FOR ACCESSIBLE TECHNOLOGY CALIFORNIA COMPANY ALEX J. MORRIS SABRINNA SOLDAVINI EXE. DIR. SR. POLICY ANALYST CALIFORNIA ENERGY STORAGE ALLIANCE MARIN CLEAN ENERGY 2150 ALLSTON WAY, STE.400 1125 TAMALPAIS AVENUE BERKELEY, CA 94704 SAN RAFAEL, CA 94901 FOR: CALIFORNIA ENERGY STORAGE ALLIANCE FOR: MARIN CLEAN ENERGY ALEXANDRA LEUMER STEPHANIE SAFDI DIR - PUBLIC POLICY DEPUTY COUNTY COUNSEL CHARGEPOINT, INC. COUNTY OF SANTA CLARA 254 EAST HACIENDA AVENUE 70 WEST HEDDING STREET CAMPBELL, CA 95008 SAN JOSE, CA 95110 FOR: CHARGEPOINT, INC. FOR: COUNTY OF SANTA CLARA ELISA TOLENTINO YUE-HAN CHOW SR. DEPUTY CITY ATTORNEY SR. DEPUTY CITY ATTORNEY CITY OF SAN JOSE' CITY OF SAN JOSE OFFICE OF THE CITY ATTORNEY 200 E. SANTA CLARA STREET, 16TH FL 200 EAST SANTA CLARA STREET, 16TH FL. SAN JOSE, CA 95113 SAN JOSÃ‰, CA 95113 FOR: CITY OF SAN JOSÃ‰ FOR: CITY OF SAN JOSE C. SUSIE BERLIN C. SUSIE BERLIN ATTORNEY LAW OFFICES OF SUSIE BERLIN LAW OFFICES OF SUSIE BERLIN 1346 THE ALAMEDA, STE. 7, NO. 141 1346 THE ALAMEDA, STE. 7, NO. 141 SAN JOSE, CA 95126 SAN JOSE, CA 95126 FOR: NORTHERN CALIFORNIA POWER AGENCY FOR: GOLDEN STATE POWER COOPERATIVE NEAL M. REARDON WILLIAM B. ABRAMS DIR - REGULATORY AFFAIRS COMMUNITY ADVOCATE SONOMA CLEAN POWER AUTHORITY 1519 BRANCH OWL PLACE 50 SANTA ROSA AVE. 5TH FL SANTA ROSA, CA 95409 SANTA ROSA, CA 95404 FOR: WILLIAM B. ABRAMS FOR: SONOMA CLEAN POWER AUTHORITY JORDAN PINJUV NICHOLAS LEVENHAGEN SR. COUNSEL ATTORNEY CALIFORNIA INDEPENDENT SYSTEM OPERATOR DISABILITY RIGHTS CALIFORNIA 250 OUTCROPPING WAY 1831 K STREET FOLSOM, CA 95630 SACRAMENTO, CA 95811 FOR: CALIFORNIA INDEPENDENT SYSTEM FOR: DISABILITY RIGHTS CALIFORNIA OPERATOR CORPORATION (CAISO) BRITTANY ILES BRITTANY ILES ATTORNEY ATTORNEY BRAUN BLAISING SMITH WYNNE, P.C. BRAUN BLAISING SMITH WYNNE, P.C. 915 L STREET, STE. 1480 915 L STREET, STE. 1480 SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 FOR: THE CALIFORNIA COMMUNITY CHOICE FOR: CENTRAL COAST COMMUNITY ENERGY ASSOCIATION (CALCCA) F/K/A MONTEREY BAY COMMUNITY POWER AUTHORITY (MBCP) BRITTANY ILES CHELSEA HAINES ATTORNEY SR. REGULATORY ADVOCATE BRAUN BLAISING SMITH WYNNE, P.C. ASSOCIATION OF CALIFORNIA WATER AGENCIES 915 L STREET, SUITE 1480 980 9TH STREET, SUITE 1000 SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 FOR: PIONEER COMMUNITY ENERGY FOR: ASSOCIATION OF CALIFORNIA WATER AGENCIES (ACWA) JOSHUA NELSON JUSTIN WYNNE ASSOCIATE ATTORNEY BEST BEST & KRIEGER LLP BRAUN BLAISING SMITH WYNNE, P.C. 500 CAPITOL MALL, STE. 1700 915 L STREET, STE. 1480 SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 FOR: CITY OF MALIBU FOR: CALIFORNIA MUNICIPAL UTILITIES ASSOCIATION STACI HEATON JEROME F. CANDELARIA REGULATORY AFFAIRS ADVOCATE CALIF. BROADBAND & VIDEO ASSOCIATION RURAL COUNTY REPRESENTATIVES OF CALIF. 100 K STREET, 2ND FL. 1215 K ST., STE. 1650 SACRAMENTO, CA 95814-3832 SACRAMENTO, CA 95814 FOR: CALIFORNIA BROADBAND & VIDEO FOR: RURAL COUNTY REPRESENTATIVES OF ASSOCIATION (FORMERLY CALIFORNIA CABLE CALIFORNIA & TELECOMMUNICATIONS ASSOCIATION) LYNN M. HAUG RONALD LIEBERT ELLISON SCHNEIDER HARRIS & DONLAN LLP ATTORNEY 2600 CAPITOL AVENUE, SUITE 400 ELLISON, SCHNEIDER HARRIS & DONLAN LLP SACRAMENTO, CA 95816 2600 CAPITOL AVE., STE. 400 FOR: EAST BAY MUNICIPAL UTILITY DISTRICT SACRAMENTO, CA 95816 FOR: CALIFORNIA MANUFACTURERS & TECHNOLOGY ASSOCIATION DAVID SCRIBNER KAREN NOREEN MILLS CHIEF COUNSEL ATTORNEY DEPT OF COMMUNITY SERVICES & DEVELOPMENT CALIFORNIA FARM BUREAU FEDERATION 2389 GATEWAY OAKS DR., STE. 100 2600 RIVER PLAZA DRIVE SACRAMENTO, CA 95833 SACRAMENTO, CA 95833 FOR: DEPARTMENT OF COMMUNITY SERVICES FOR: CALIFORNIA FARM BUREAU FEDERATION AND DEVELOPMENT (CSD) BRIAN WEISEL ANN L. TROWBRIDGE LEGAL COUNSEL ATTORNEY STATE COUNCIL DEVELOPMENTAL DISABILITY DAY CARTER & MURPHY LLP 3/31 N. FREEWAY BLVD., STE. 125 3620 AMERICAN RIVER DR., STE. 205 SACRAMENTO, CA 95834 SACRAMENTO, CA 95864 FOR: STATE COUNCIL ON DEVELOPMENTAL FOR: AGRICULTURAL ENERGY CONSUMERS DISABILITIES (SCDD) ASSOCIATION DANIEL MARSH MGR - RATES & REGULATORY LIBERTY UTILITIES 933 ELOISE AVE. SO. LAKE TAHOE, CA 96150 FOR: LIBERTY UTILITIES (CALPECO ELECTRIC) LLC Information Only REGULATORY ADAM ABEL BEAR VALLEY ELECTRIC SERVICE, INC. CITY OF SANTA ROSA EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 AMULYA YERRAPOTU ANGELA GOULD MARIN CLEAN ENERGY CALIFORNIA ENERGY COMMISSION EMAIL ONLY EMAIL ONLY EMAIL ONLY, AA 00000 EMAIL ONLY, CA 00000 ANWAR SAFVI BILL POWERS, P.E. CPUC - WILDFIRE SAFETY TECHNICAL ADVISOR EMAIL ONLY POWERS ENGINEERING EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, CA 00000 DANIEL GARCIA DANIEL TEIMOURI CITY OF RIVERSIDE PACIFICORP EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, AA 00000 DARREN LEE DAVID B. PECK OPERATIONS MGR CALIFORNIA PUBLIC UTILITIES COMMISSION BRB LAW LLP EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 EBCE REGULATORY FAITH CARLSON EAST BAY COMMUNITY ENERGY REGULATORY & LEGISLATIVE POLICY MGR. EMAIL ONLY REDWOOD COAST ENERGY AUTHORITY EMAIL ONLY, CA 00000 EMAIL ONLY FOR: AVA COMMUNITY ENERGY AUTHORITY EMAIL ONLY, CA 00000 F/K/A EAST BAY COMMUNITY ENERGY (EBCE) FOREST KASER JEAN HAWLEY CPUC - SE&SP TELECOMMUNICATIONS PARALEGAL EMAIL ONLY FRIEND, HUDAK & HARRIS, LLP EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, AA 00000 JENNY KAN JONATHAN FROST PACIFIC GAS & ELECTRIC COMPANY ADVISOR | WILDFIRE SAFETY ADVISORY BOARD EMAIL ONLY CA OFFICE OF ENERGY INFRASTRUCTURE SAFTY EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, CA 00000 JORDAN PARILLO JOY MASTACHE LIBERTY UTILITIES SR. ATTORNEY - OFF. OF GEN. COUNSEL EMAIL ONLY SACRAMENTO MUNICIPAL UTILITY DISTRICT EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, CA 00000 JULIA ENDE JUSTIN BUKARTEK CALIFORNIA PUBLIC UTILITIES COMMISSION PACIFICORP EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 KARI CAMERON KAVYA BALARAMAN BBK LAW REPORTER ALCANTAR LAW GROUP UTILITY DIVE EMAIL ONLY EMAIL ONLY EMAL ONLY, CA 00000 EMAIL ONLY, DC 00000 FOR: UTILITY DIVE KE HAO OUYANG KEVIN ASHE PROGRAM & PROJECT SUPERVISOR - CPED HOLLAND & KNIGHT LLP CALIFORNIA PUBLIC UTILITIES COMMISSION EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 KEVIN MILLER LAUREN MILLER OEIS) PARALEGAL OFFICE OF ENERGY INFRASTRUCTURE SAFETY ( OFFICE OF CITY ATTORNEY DENNIS HERRERA EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 LEGAL DIVISION LES GULIASI CPUC RACHEL CARSON COLLEGE EMAIL ONLY UNIVERSITY OF CALIFORNIA, SANTA CRUZ EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, CA 00000 MADDY STRUTNER MCE REGULATORY REGULATORY MARIN CLEAN ENERGY SAN DIEGO GAS & ELECTRIC EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 MEGAN BUCKNER NATHAN POON PACIFICORP OFFICE OF ENERGY INFRASTRUCTURE SAFETY EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 NICHOLAS RAFT PAUL HUNT LIBERTY UTILITIES EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 SCOTT DUNBAR TAYLOR RENNER KEYES & FOX LLP PACIFIC GAS AND ELECTRIC COMPANY EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 FOR: SUNRUN INC. VICTOR ROOSEN WALTER PARK EMAIL ONLY DESIGNING ACCESSIBLE COMMUNITIES EMAIL ONLY, CA 00000 EMAIL ONLY EMAIL ONLY, CA 00000 WILL DUNDON PACIFICORP REGULATORY AFFAIRS UTILITIES ENGINEER, WATER DIVISION PACIFICORP CALIFORNIA PUBLIC UTILITIES COMMISSION EMAIL ONLY EMAIL ONLY EMAIL ONLY, AA 00000 EMAIL ONLY, CA 00000 MRW & ASSOCIATES LLC CAMERON-DANIEL, P.C. EMAIL ONLY EMAIL ONLY EMAIL ONLY, CA 00000 EMAIL ONLY, CA 00000 CHRISTOPHER CHOW PAUL CHERNICK PUBLIC INFORMATION OFFICER PRESIDENT CPUC RESOURCE INSIGHT EMAIL ONLY 5 WATER ST. EMAIL ONLY, CA 00000-0000 ARLINGTON, MA 02476 JENNIFER PELZMAN SARAH TROSCH VERIZON VERIZON 1300 I STREET NW 1300 I STREET NW WASHINGTON, DC 20005 WASHINGTON, DC 20005 OLIVIA B. WEIN BLAKE ELDER STAFF ATTORNEY POLICY RESEARCH ANALYST NATIONAL CONSUMER LAW CENTER EQ RESEARCH, LLC 1001 CONNECTICUT AVE., NW., STE. 510 1155 KILDAIRE FARM ROAD, SUITE 203 WASHINGTON, DC 20036-5528 CARY, NC 27511 STEVEN GRECO JIM ROSS REGULATORY AFFAIRS ANALYST RCS, INC. HORIZON WEST TRANSMISSION, LLC 266 PENNINGTON LANE 700 UNIVERSE BLVD CHESTERFIELD, MO 63005 JUNO BEACH, FL 33407 TRACY C. DAVIS ALCO ROBINSON SR. ATTORNEY ASSISTANT NEXTERA ENERGY TRANSMISSION, LLC AT&T 5920 W. WILLIAM CANNON DR., BLDG 2 6750 VIA ASTI PKWY AUSTIN, TX 78749 LAS VEGAS, NV 89119 STELLA FOGLEMAN HEIDI LIU DIR ASSOC COUNTY COUNSEL COUNTY OF LOS ANGELES COUNTY OF LOS ANGELES 600 S. COMMONWEALTH AVE., STE.700 500 WEST TEMPLE ST., STE. 651 LOS ANGELES, CA 90005 LOS ANGELES, CA 90012 FOR: COUNTY OF LOS ANGELES, DEPARTMENT FOR: COUNTY OF LOS ANGELES OF PUBLIC HEALTH JAMIE GARCIA JEFFERY A. WILLIAMS LOS ANGELES DEPT OF WATER AND POWER SUPERINTENDENT - CODES & ORDINANCES 11 N. HOPE ST. ROOM 856 L.A. DEPT OF WATER & POWER LOS ANGELES, CA 90012 111 NORTH HOPE STREET, RM. 856 LOS ANGELES, CA 90012 ANNE KIM BRIDGET HORAN CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY MANAGEMENT SYSTEM BRANCH ELECTRICITY PLANNING & POLICY BRANCH 320 West 4th Street Suite 500 320 West 4th Street Suite 500 Los Angeles, CA 90013 Los Angeles, CA 90013 BRYAN PENA CHRISTOPHER MOORE CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ELECTRIC SAFETY AND RELIABILITY BRANCH BUSINESS AND COMMUNITY OUTREACH 320 West 4th Street Suite 500 320 West 4th Street Suite 500 Los Angeles, CA 90013 Los Angeles, CA 90013 EDWIN SCHMITT ERIC WU CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY POLICY DIVISION SAFETY MANAGEMENT SYSTEM BRANCH 320 West 4th Street Suite 500 320 West 4th Street Suite 500 Los Angeles, CA 90013 Los Angeles, CA 90013 FADI DAYE JOAN WEBER CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ELECTRIC SAFETY AND RELIABILITY BRANCH ELECTRIC SAFETY AND RELIABILITY BRANCH 320 West 4th Street Suite 500 320 West 4th Street Suite 500 Los Angeles, CA 90013 Los Angeles, CA 90013 KOKO M. TOMASSIAN MATTHEW LANGER CALIF PUBLIC UTILITIES COMMISSION ATTORNEY SAFETY MANAGEMENT SYSTEM BRANCH CLEAN POWER ALLIANCE OF SO. CALIF. 320 West 4th Street Suite 500 555 WEST 5TH STREET, 35TH FL Los Angeles, CA 90013 LOS ANGELES, CA 90013 NANCY WHANG RAFFY STEPANIAN GENERAL COUNSEL CALIF PUBLIC UTILITIES COMMISSION CLEAN POWER ALLIANCE OF SO. CALIF. ELECTRIC SAFETY AND RELIABILITY BRANCH 555 WEST 5TH STREET, 35TH FLOOR 320 West 4th Street Suite 500 LOS ANGELES, CA 90013 Los Angeles, CA 90013 STEVEN KLAIBER ANDREW MCCARDLE CALIF PUBLIC UTILITIES COMMISSION DAVIS WRIGHT TREMAINE LLP WILDFIRE SAFETY & ENFORCEMENT BRANCH 865 S FIGUEROA STREET, SUITE 2400 320 West 4th Street Suite 500 LOS ANGELES, CA 90017 Los Angeles, CA 90013 B. TILDEN KIM BRIAN HAUCK ATTORNEY JENNER & BLOCK LLP RICHARDS, WATSON & GERSHON 633 W. 5TH ST., STE. 3500 350 SOUTH GRAND AVENUE, 37TH FL LOS ANGELES, CA 90071 LOS ANGELES, CA 90071 FOR: CITY OF MOORPARK JENNER & BLOCK LLP JANE E. TERJUNG 515 SOUTH FLOWER STREET 3300 COMMUNITY ADVOCATES LOS ANGELES, CA 90071 TOPANGA COMMUNITY ALLIANCE 1639 OAK DRIVE TOPANGA, CA 90290 FOR: JANE E. TERJUNG & WILLIAM E. NAYLOR FRED G. YANNEY, ESQ. GREGORY S.G. KLATT ATTORNEY ATTORNEY YANNEY LAW OFFICE DOUGLASS & LIDDELL 17409 MARQUARDT AVE. STE. C-4 411 E. HUNTINGTON DR., STE 107-356 CERRITOS, CA 90703 ARCADIA, CA 91006 BOONPING GOH ANNA M. WOJTYNA-MACHON ADVISOR SOUTHERN CALIFORNIA EDISON COMPANY SOUTHERN CALIFORNIA EDISON 2244 WALNUT GROVE AVE 3 INNOVATION WAY ROSEMEAD, CA 91770 POMONA, CA 91768 ANNA VALDBERG CONNOR J. FLANIGAN DIR & MANAGING ATTORNEY SR. ATTORNEY SOUTHERN CALIFORNIA EDISON COMPANY SOUTHERN CALIFORNIA EDISON COMPANY 2244 WALNUT GROVE AVENUE 2244 WALNUT GROVE AVE. / PO BOX 800 ROSEMEAD, CA 91770 ROSEMEAD, CA 91770 FOR: SOUTHERN CALIFORNIA EDISON COMPANY DEREK MATSUSHIMA KAREN CHUNG EDISON INTERNATIONAL MGR - PROJECT 2244 WALNUT GROVE AVE. SOUTHERN CALIFORNIA EDISON COMPANY ROSEMEAD, CA 91770 2244 WALNUT GROVE AVENUE ROSEMEAD, CA 91770 NATHANAEL GONZALEZ RYAN STEVENSON SOUTHERN CALIFORNIA EDISON COMPANY PRIN ADVISOR, REG AFFAIRS & COMPL 8631 RUSH STREET SOUTHERN CALIFORNIA EDISON COMPANY ROSEMEAD, CA 91770 2244 WALNUT GROVE AVE. ROSEMEAD, CA 91770 SCE WILDFIRES CASE ADMIN WILLIAM W. YU SOUTHERN CALIFORNIA EDISON COMPANY SENIOR ATTORNEY 8631 RUSH STREET SOUTHERN CALIFORNIA EDISON COMPANY ROSEMEAD, CA 91770 2244 WALNUT GROVE AVE. ROSEMEAD, CA 91770 ALICIA MENCHACA DR. QUAN NGUYEN RATE ANALYST, REGULATORY AFFAIRS BEAR VALLEY ELECTRIC SERVICE, INC. BEAR VALLEY ELECTRIC SERVICE, INC. 630 E. FOOTHILL BLVD. 630 E. FOOTHILL BLVD. SAN DIMAS, CA 91773 SAN DIMAS, CA 91773 JEFFREY LINAM LISA MAU MGR - REGULATORY REGULATORY BEAR VALLEY ELECTRIC SERVICE, INC. SOUTHERN CALIFORNIA EDISON 630 E. FOOTHILL BLVD. 2244 WALNUT GROVE AVE. SAN DIMAS, CA 91773 ROSEMEAD, CA 91773 PATRICIA NERI JESSICA KIRSHNER SOUTHERN CALIFORNIA EDISON LAW CLERK 1515 WALNUT GROVE AVE LAW OFFICES OF SHAWN E. CAINE, A.P.C. ROSEMEAD, CA 91773 1221 CAMINO DEL MAR DEL MAR, CA 92014 SHAWN E. CAINE JOSEPH W. MITCHELL, PH.D LAW OFFICES OF SHAWN E. CAINE M-BAR TECHNOLOGIES AND CONSULTING, LLC 1221 CAMINO DEL MAR 19412 KIMBALL VALLEY RD. DEL MAR, CA 92014 RAMONA, CA 92065 MARK NIEMIEC PAUL CLARKE INTERIM DIR - ENGINEERING & PLANNING DIR - OPER & WATER QUALITY PADRE DAM MUNICIPAL WATER DISTRICT PADRE DAM MUNICIPAL WATER DISTRICT 9300 FANITA PARKWAY 9300 FANITA PARKWAY SANTEE, CA 92071 SANTEE, CA 92071 GARY ARANT ASHLEY L. SALAS GENERAL MGR. STAFF ATTORNEY VALLEY CENTER MUNICIPAL WATER DISTRICT THE UTILITY REFORM NETWORK 29300 VALLEY CENTER ROAD 1620 5TH AVENUE, SUITE 810 VALLEY CENTER, CA 92082 SAN DIEGO, CA 92101 MEGHAN O'BRIEN DONALD C. LIDDELL, PC STOEL RIVES LLP COUNSEL 501 WEST BROADWAY, SUITE 2000 DOUGLASS & LIDDELL SAN DIEGO, CA 92101 2928 2ND AVENUE SAN DIEGO, CA 92103 COURTNEY COOK KRISTEN CAMUGLIA PARALEGAL / OFFICE ADMIN. COX COMMUNICATIONS UTILITY CONSUMERS' ACTION NETWORK 5887 COPLEY DRIVE, STE. 300 3405 KENYON STREET, SUITE 401 SAN DIEGO, CA 92111 SAN DIEGO, CA 92110 KARI KLOBERDANZ-YU CLAY FABER MANAGER- REGULATORY DIR. CA & FEDERAL REGULATORY SAN DIEGO GAS & ELECTRIC COMPANY SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP32D 8330 CENTURY PARK COURT, CP32F SAN DIEGO, CA 92122 SAN DIEGO, CA 92123 FOR: SAN DIEGO GAS & ELECTRIC COMPANY KELLEN C. GILL KRISTOPHER BOURBOIS REGULATORY CASE MGR. REGULATORY SAN DIEGO GAS & ELECTRIC COMPANY SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK COURT, CP 32D 8326 CENTURY PARK CT, BUILDING 3-2 SAN DIEGO, CA 92123 SAN DIEGO, CA 92123 TAYLOR MARVIN CENTRAL FILES SAN DIEGO GAS & ELECTRIC COMPANY SAN DIEGO GAS & ELECTRIC COMPANY 326 CENTURY PARK CT 8330 CENTURY PARK CT, CP31-E SAN DIEGO, CA 92123 SAN DIEGO, CA 92123-1530 SHEWIT WOLDEGIORGIS TIM LYONS MGR - REGULATORY REGULATORY AFFAIRS SAN DIEGO GAS & ELECTRIC COMPANY SAN DIEGO GAS & ELECTRIC COMPANY 8330 CENTURY PARK CT., CP32F 8330 CENTURY PARK CT, CP32F SAN DIEGO, CA 92123-1530 SAN DIEGO, CA 92123-1530 TYLER KIRCHHOFF PAUL MARCONI REGULATORY CASE MGR DIRECTOR SAN DIEGO GAS & ELECTRIC BEAR VALLEY ELECTRIC SERVICE, INC. 8330 CENTURY PARK CT., CP32F 42020 GRASTIN DRIVE / PO BOX 1547 SAN DIEGO, CA 92123-1530 BIG BEAR LAKE, CA 92315 GEORGE R. HANSON SUSAN D. WILSON ASSIST. GEN. MGR. ASSISTANT CITY ATTORNEY CITY OF RIVERSIDE - PUBLIC UTILITIES CITY OF RIVERSIDE 3750 UNIVERSITY AVE. 3900 MAIN STREET, 7TH FLOOR RIVERSIDE, CA 92501 RIVERSIDE, CA 92522 JESUS G. ROMAN KELLY HUBBARD ASSIST. GEN. COUNSEL WEROC PROGRAMS MANAGER VERIZON MUNICIPAL WATER DIST OF ORANGE COUNTY 15505 SAND CANYON AVE. D201 18700 WARD STREET IRVINE, CA 92618 FOUNTAIN VALLEY, CA 92708 VICKI OSBORN JON ANSOLABEHERE MWDOC ASSISTANT COUNTY COUNSEL 18700 WARD STREET COUNTY OF SAN LUIS OBISPO FOUNTAIN VALLEY, CA 92708 1055 MONTEREY ST., STE D320 SAN LUIS OBISPO, CA 93408 RITA L. NEAL JOHN J. WALLER COUNTY COUNSEL 2675 AVENA ROAD COUNTY OF SAN LUIS OBISPO LOMPOC, CA 93436 1055 MONTEREY ST., STE D320 SAN LUIS OBISPO, CA 93408 CHARLOTTE COSTAN ILANA PARMER MANDELBAUM THE ACTON TOWN COUNCIL DEPUTY COUNTY COUNSEL EMAIL ONLY SAN MATEO COUNTY COUNSEL'S OFFICE EMAIL ONLY, CA 93510 400 COUNTY CENTER, 6TH FLOOR REDWOOD CITY, CA 94063 AIDAN MARSHALL ANDREW J. GRAF ADAMS BROADWELL JOSEPH & CARDOZO ASSOCIATE ATTORNEY 601 GATEWAY BOULEVARD, SUITE 1000 ADAMS BROADWELL JOSEPH & CARDOZO SOUTH SAN FRANCISCO, CA 94080 601 GATEWAY BOULEVARD, SUITE 1000 SOUTH SAN FRANCISCO, CA 94080 MARC D. JOSEPH AARON LOUIE ATTORNEY AT LAW CALIF PUBLIC UTILITIES COMMISSION ADAMS BROADWELL JOSEPH & CARDOZO SAFETY BRANCH 601 GATEWAY BLVD., STE. 1000 AREA SOUTH SAN FRANCISCO, CA 94080 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 AMANDA ASADI ANAND DURVASULA CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH LEGAL DIVISION AREA ROOM 5130 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 ARTHUR FISHER BENJAMIN KATZENBERG CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH SAFETY BRANCH AREA AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 CHARLES MEE CHARLYN A. HOOK CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION WILDFIRE SAFETY & ENFORCEMENT BRANCH LEGAL DIVISION AREA ROOM 5123 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 FOR: PUBLIC ADVOCATES OFFICE CHLOE LUKINS CHRISTINE J. HAMMOND CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ENERGY INFRASTRUCTURE BRANCH LEGAL DIVISION ROOM 4102 ROOM 5138 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 CHRISTOPHER CHOW CHRISTOPHER CLAY CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION NEWS AND SOCIAL MEDIA LEGAL DIVISION ROOM 5301 ROOM 4300 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 FOR: OSA CHRISTOPHER PARKES DAISY E. YEE CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH WILDFIRE SAFETY & ENFORCEMENT BRANCH AREA 2-D AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 DAPHNE GOLDBERG DEVLA SINGH CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION WATER BRANCH BUILDING ELECTRIFICATION AND GAS POLICY ROOM 4208 ROOM 400 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 DREW HODEL ELIZABETH PODOLINSKY CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION PRESIDENT ALICE REYNOLDS ADMINISTRATION & BUDGET UNIT AREA AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 JAMIE ORMOND JONATHAN KOLTZ CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATIVE LAW JUDGE DIVISION LEGAL DIVISION AREA ROOM 5035 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 JULIAN ENIS JUSTIN HAGLER CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION DISTRIBUTION PLANNING BRANCH COMMISSIONER BAKER AREA AREA 4-A 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 KAREN M. SHEA KARIN NGUYEN CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATION & BUDGET UNIT WILDFIRE SAFETY & ENFORCEMENT BRANCH AREA 5-E AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 KENNETH YANG LESLIE L. PALMER CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION UTILITY & PAYPHONE ENFORCEMENT BRANCH SAFETY AND ENFORCEMENT DIVISION AREA 3-E ROOM 2203 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 LEUWAM TESFAI LUCY MORGANS CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION EXECUTIVE DIVISION SAFETY BRANCH ROOM 5137 AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 MARIANNE DIVINA MATTHEW A. KARLE CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATIVE LAW JUDGE DIVISION SAFETY BRANCH AREA ROOM 4108 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 MATTHEW TAUL MATTHEW YERGOVICH CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH LEGAL DIVISION AREA AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 MATTHEW YUNGE MICHELE M. KING CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ELECTRIC SAFETY AND RELIABILITY BRANCH BROADBAND, POLICY & ANALYSIS BRANCH AREA AREA 3-F 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 MINA BOTROS NATHANIEL SKINNER CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH SAFETY BRANCH AREA AREA 4-A 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 NOEL OBIORA NORA HAWKINS CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION LEGAL DIVISION PRESIDENT ALICE REYNOLDS ROOM 5121 AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 RAJAN MUTIALU REGINA DEANGELIS CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATIVE LAW JUDGE DIVISION ADMINISTRATIVE LAW JUDGE DIVISION AREA 4-A AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 RODERICK HILL RUDY SASTRA CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION LEGAL DIVISION UTILITY & PAYPHONE ENFORCEMENT BRANCH ROOM 4300 AREA 2-D 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 SEAN A. SIMON SUZANNE CASAZZA CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION COMMISSIONER DOUGLAS COMMISSIONER JOHN REYNOLDS ROOM 5201 AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 TALAL HARAHSHEH TYLER HOLZSCHUH CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH SAFETY BRANCH AREA AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 VALERIE KAO VICKY ZHONG CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATIVE LAW JUDGE DIVISION UTILITY & PAYPHONE ENFORCEMENT BRANCH ROOM 5105 AREA 505 VAN NESS AVENUE 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 SAN FRANCISCO, CA 94102-3214 VICTOR F. BANUELOS JENNIFER CAPITOLO CALIF PUBLIC UTILITIES COMMISSION EXE DIR UTILITY & PAYPHONE ENFORCEMENT BRANCH CALIFORNIA WATER ASSOCIATION AREA 2-F 601 VAN NESS AVE., STE. 2047, MC E3-608 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-6316 SAN FRANCISCO, CA 94102-3214 BRENDA VILLANUEVA KATY MORSONY MANAGING DIRECTOR AND LEAD COUNSEL STAFF ATTORNEY THE UTILITY REFORM NETWORK THE UTILITY REFORM NETWORK 785 MARKET STREET SUITE 1400 785 MARKET STREET, SUITE 1400 SAN FRANCISCO, CA 94103 SAN FRANCISCO, CA 94103 FOR: TURN REGINA COSTA TOM LONG TELECOM RESEARCH DIR. LEGAL DIRECTOR THE UTILITY REFORM NETWORK THE UTILITY REFORM NETWORK (TURN) 785 MARKET ST., STE. 1400 785 MARKET STREET, SUITE 1400 SAN FRANCISCO, CA 94103 SAN FRANCISCO, CA 94103 ARIEL STRAUSS J. PORTER WISEMAN COUNSEL - REGULATORY AKIN GUMP STRAUSS HAUER & FELD LLP SMALL BUSINESS UTILITY ADVOCATES 580 CALIFORNIA STREET, SUITE 1500 548 MARKET ST., SUITE 11200 SAN FRANCISCO, CA 94104 SAN FRANCISCO, CA 94104 FOR: AD HOC COMMITTEE OF SENIOR UNSECURED NOTEHOLDERS OF PACIFIC GAS AND ELECTRIC COMPANY BRIAN T. CRAGG CHRISTINE PARK ATTORNEY PACIFIC GAS & ELECTRIC COMPANY DOWNEY BRAND LLP 77 BEALE ST 455 MARKET STREET, SUITE 1500 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 FOR: COUNTY OF MENDOCINO, THE COUNTY OF NAPA, AND THE COUNTY OF SONOMA JAMES W. MCTARNAGHAN JULIE TAN ATTORNEY PACIFIC GAS AND ELECTRIC COMPANY PERKINS COLE LLP 245 MARKET STREET 505 HOWARD ST., STE. 1000 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 MEGHAN DEWEY MICHAEL CADE SR. MANAGER, EE PORTFOLIO MANAGEMENT ANALYST - ENERGY & NAT'L RESOURCES PACIFIC GAS AND ELECTRIC CO BUCHALTER, A PROFESSIONAL CORPORATION 245 MARKET STREET 55 SECOND STREET, SUITE 1700 SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105 ZEB C. ZANKEL SAMIR A. HAFEZ, ESQ. COUNSEL ATTORNEY JENNER & BLOCK LLP BUCHALTER, A PROFESSIONAL CORPORATION 525 MARKET STREET, 29TH FLOOR 425 MARKET STREET, 29TH FLOOR SAN FRANCISCO, CA 94105 SAN FRANCISCO, CA 94105-2491 MARGARET L. TOBIAS ADAM BENSAID TOBIAS LAW OFFICE AREA MANAGER â€“ REGULATORY RELATIONS 460 PENNSYLVANIA AVE AT&T SERVICES, INC. SAN FRANCISCO, CA 94107 430 BUSH STREET, 5TH FLOOR SAN FRANCISCO, CA 94108 ANDY A. UMANA ANKUR PATEL ATTORNEY DIRECTOR â€“ REGULATORY AT&T SERVICE, INC. AT&T SERVICES, INC. 430 BUSH STREET, ROOM 6043 430 BUSH ST, 5TH FLOOR SAN FRANCISCO, CA 94108 SAN FRANCISCO, CA 94108 FASSIL FENIKILE JEFFREY MONDON DIR - REGULATORY DIR - REGULATORY AT&T SERVICES, INC. AT&T SERVICES, INC. 430 BUSH STREET, 5TH FL. 430 BUSH STREET, 5TH FL SAN FRANCISCO, CA 94108 SAN FRANCISCO, CA 94108 JOSHUA MATHISEN RENEE MARFIA DIR - REGULATORY AREA MANAGER AT&T SERVICES, INC. AT&T SERVICES INC. 430 BUSH STREET, 5TH FL. STATE LEGISLATIVE & REGULATORY AFFAIRS SAN FRANCISCO, CA 94108 430 BUSH ST - FIFTH FLOOR SAN FRANCISCO, CA 94108 SAIRA PASHA SIRK ZENA AREA MGR - REGULATORY RELATIONS PROGRAM MANAGER AT&T SERVICES, INC. AT&T 430 BUSH STREET, 5TH FL. 430 BUSH ST, 6TH FLOOR SAN FRANCISCO, CA 94108 SAN FRANCISCO, CA 94108 STEVEN BERENBAUM ANNA FERO AREA MANAGER ATTORNEY AT&T SERVICES, INC. DAVIS WRIGHT TREMAINE LLP 430 BUSH STREET, 5TH FLOOR 50 CALIFORNIA STREET, 23RD FLR SAN FRANCISCO, CA 94108 SAN FRANCISCO, CA 94111 ANTHONY BRUNELLO DAVID HUANG CALIFORNIA STRATEGIES AND ADVOCACY ATTORNEY 1 EMBARCADERO CENTER, SUITE 1060 DAVIS WRIGHT TREMAINE LLP SAN FRANCISICO, CA 94111 50 CALIFORNIA STREET, 23RD FL. SAN FRANCISCO, CA 94111 JESSICA JANDURA JIM TOMLINSON ATTORNEY DAVIS WRIGHT TREMAINE LLP DAVIS WRIGHT TREMAINE LLP 50 CALIFORNIA STREET, 23RD FLR 505 MONTGOMERY STREET, STE. 800 SAN FRANCISCO, CA 94111 SAN FRANCISCO, CA 94111 KELCIE ABRAHAM LORI ANNE DOLQUEIST BCG ATTORNEY 2 EMBARCADERO CENTER SUITE 24 NOSSAMAN LLP SF, CA 94111 50 CALIFORNIA STREET, 34TH FLR. SAN FRANCISCO, CA 94111 FOR: CALIFORNIA WATER ASSOCIATION MARK P. SCHREIBER SARAH DEYOUNG ATTORNEY EXECUTIVE DIR COOPER, WHITE & COOPER LLP CALTEL 201 CALIFORNIA ST., 17TH FL. 50 CALIFORNIA ST., STE. 1500 SAN FRANCISCO, CA 94111 SAN FRANCISCO, CA 94111 VIDHYA PRABHAKARAN WILLIS HON ATTORNEY ATTORNEY DAVIS WRIGHT TREMAINE LLP NOSSAMAN LLP 50 CALIFORNIA STREET, 23RD FLR 50 CALIFORNIA STREET, 34TH FL. SAN FRANCISCO, CA 94111 SANF RANCISCO, CA 94111 FOR: AD HOC COMMITTEE OF SENIOR UNSECURED NOTEHOLDERS OF PACIFIC GAS AND ELECTRIC COMPANY DAVIS WRIGHT TREMAINE LLP ASHLEY VINSON CRAWFORD 50 CALIFORNIA STREET, 23RD FLR ATTORNEY SAN FRANCISCO, CA 94111 AKIN GUMP STRAUSS HAUER & FELD LLP 100 PINE STREET, STE. 3200 SAN FRANCISCO, CA 94111-5218 FOR: AD HOC COMMITTEE OF SENIOR UNSECURED NOTEHOLDERS OF PACIFIC GAS AND ELECTRIC COMPANY ALLIE DETRIO IRENE K. MOOSEN CHIEF STRATEGIST ATTORNEY AT LAW REIMAGINE POWER INC LAW OFFICE OF IRENE K. MOOSEN 77 SALA TERRACE 53 SANTA YNEZ STREET SAN FRANCISCO, CA 94112 SAN FRANCISCO, CA 94112 FOR: LOCAL GOVERNMENT SUSTAINABLE ENERGY COALITION (LGSEC) GERARDO HUERTA CASE COORDINATION ATTORNEY PACIFIC GAS AND ELECTRIC COMPANY PACIFIC GAS AND ELECTRIC COMPANY PO BOX 770000; MC B23A PO BOX 7442 SAN FRANCISCO, CA 94177 SAN FRANCISCO, CA 94120 JIN NOH ALEXEY ORKIN PRINCIPAL CONSULTANT DECODE ENERGY, LLC FLYNN RESOURCE CONSULTANTS INC. 622 10TH AVENUE 5440 EDGEVIEW DRIVE SAN MATEO, CA 94402 DISCOVERY BAY, CA 94505 BARRY FLYNN PUSHKAR WAGLE PRESIDENT MANAGING CONSULTANT FLYNN RESOURCE CONSULTANTS INC. FLYNN RESOURCE CONSULTANTS INC. 5440 EDGEVIEW DRIVE 5440 EDGEVIEW DRIVE DISCOVERY BAY, CA 94505 DISCOVERY BAY, CA 94505 MICHAEL ROCHMAN BRETT T. KAWAKAMI MANAGING DIR. EBMUD SCHOOL PROJECT UTILITY RATE REDUCTION 375 11TH STREET, STE. 200 1850 GATEWAY BLVD., STE. 235 OAKLAND, CA 94541 CONCORD, CA 94520 GREG LAMBERG BENJAMIN BODELL PETERSON POWER SYSTEMS, INC. ATTORNEY 2828 TEAGARDEN STREET BEST BEST AND KRIEGER LLP SAN LEANDRO, CA 94577 2001 N MAIN ST., STE. 390 WALNUT CREEK, CA 94596 FOR: PADRE DAM MUNICIPAL WATER DISTRICT (PDMWD); VALLEY CENTER MUNICIPAL WATER DISTRICT (VCMWD) SAJI THOMAS PIERCE STEPHEN CAMPBELL EAST BAY MUNICIPAL UTILITY DISTRICT DIR - POLICY, WEST 375 11TH STREET GRID ALTERNATIVES OAKLAND, CA 94607-4240 1171 OCEAN AVE., SUITE 200 OAKLAND, CA 94608 CATHERINE E. YAP ALYSSA T. KOO CONSULTANT ATTORNEY BARKOVICH & YAP, INC. PACIFIC GAS AND ELECTRIC COMPANY PO BOX 11031 300 LAKESIDE DRIVE OAKLAND, CA 94611 OAKLAND, CA 94612 BETTY TRAN CHARLES R. MIDDLEKAUFF PACIFIC GAS AND ELECTRIC COMPANY ATTORNEY 300 LAKESIDE DRIVE PACIFIC GAS AND ELECTRIC COMPANY OAKLAND, CA 94612 300 LAKESIDE DRIVE, STE. 210, 19TH FL. OAKLAND, CA 94612 ELECTRIC OPERATIONS COMMITMEN EVA CHU PACIFIC GAS AND ELECTRIC COMPANY PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE 300 LAKESIDE DRIVE OAKLAND, CA 94612 OAKLAND, CA 94612 JOHN NEWTON JULIE CERIO PRINCIPAL REGULATORY SR. MGR. PACIFIC GAS AND ELECTRIC COMPANY AVA COMMUNITY ENERGY 300 LAKESIDE DRIVE 1999 HARRISON ST, SUITE 2300 OAKLAND, CA 94612 OAKLAND, CA 94612 FOR: AVA COMMUNITY ENERGY AUTHORITY F/K/A EAST BAY COMMUNITY ENERGY (EBCE) PAUL D. HERNANDEZ SARAH J. BANOLA PRINCIPAL REGULATORY ANALYST PARTNER AVA COMMUNITY ENERGY AUTHORITY BRB LAW LLP 1999 HARRISON ST., STE. 800 436 14TH STREET, STE. 1205 OAKLAND, CA 94612 OAKLAND, CA 94612 FOR: AVA COMMUNITY ENERGY AUTHORITY F/K/A EAST BAY COMMUNITY ENERGY (EBCE) SPENCER OLINEK TODD EDMISTER PACIFIC GAS AND ELECTRIC COMPANY DIR & DEPUTY GEN. COUNSEL 300 LAKESIDE DRIVE EAST BAY COMMUNITY ENERGY OAKLAND, CA 94612 1999 HARRISON ST, SUITE 800 OAKLAND, CA 94612 FOR: AVA COMMUNITY ENERGY AUTHORITY F/K/A EAST BAY COMMUNITY ENERGY (EBCE) VIKTORIYA MALKINA WADE A. GREENACRE CASE MGR - REGULATORY REGULATORY CASE COORDINATOR PACIFIC GAS AND ELECTRIC COMPANY PACIFIC GAS AND ELECTRIC COMPANY 300 LAKESIDE DRIVE 300 LAKESIDE DRIVE OAKLAND, CA 94612 OAKLAND, CA 94612 ALEXANDRA GREEN MARILYN GOLDEN THE CENTER FOR ACCESSIBLE TECHNOLOGY SR POLICY ANALYST 3075 ADELINE STREET, STE. 220 DISABILITY RIGHTS EDU. & DEFENSE FUND BERKELEY, CA 94703 3075 ADELINE STREET, STE. 210 BERKELEY, CA 94703 FOR: DISABILITY RIGHTS EDUCATION & DEFENSE FUND RACHEL SWEETNAM PAUL SCHULMAN ATTORNEY SR RESEARCH FELLOW CENTER FOR ACCESSIBLE TECHNOLOGY CTR FOR CATASTROPHIC RISK MGNT 3075 ADELINE STREET, SUITE 220 MILLS COLLEGE BERKELEY, CA 94703 UNIVERSITY OF CALIFORNIA BERKELEY, CA 94720 MICHAEL CALLAHAN BRIAN E. WASHINGTON REGULATORY COUNSEL COUNTY COUNSEL MARIN CLEAN ENERGY COUNTY OF MARIN 1125 TAMALPAIS AVENUE 3501 CIVIC CENTER DRIVE, RM 275 SAN RAFAEL, CA 94901 SAN RAFAEL, CA 94903 PHILLIP MULLER RENEE BREWER SCD ENERGY SOLUTIONS CHIEF DEPUTY COUNTY COUNSEL 436 NOVA ALBION WAY COUNTY OF MARIN SAN RAFAEL, CA 94903 3501 CIVIC CENTER DRIVE, RM 275 SAN RAFAEL, CA 94903 MICHAEL ALCANTAR MARC KOLB ALCANTAR LAW GROUP GRID DEL SOL CONSULTING 1 BLACKFIELD DRIVE NO. 135 46 VISTA DEL SOL TIBURON, CA 94920 MILL VALLEY, CA 94941 TAYLOR KNECHT LUISA F. ELKINS SR POWER RESOURCES SPECIALIST SR. DEPUTY CITY ATTORNEY SAN JOSE CLEAN ENERGY CITY OF SAN JOSE REGULATORY COMPLIANCE AND POLICY OFFICE OF THE CITY ATTORNEY 200 EAST SANTA CLARA STREET, 14TH FLOOR 200 EAST SANTA CLARA ST., 16TH FL SAN JOSE, CA 95113 SAN JOSE, CA 95113-1905 FOR: SAN JOSE CLEAN ENERGY MICHAEL C. GHIZZONI MICHELLE MONTEZ COUNTY COUNSEL SR. DEPUTY COUNTY COUNSEL COUNTY OF SANTA BARBARA COUNTY OF SANTA BARBARA 105 EAST ANAPAMU ST., STE. 201 105 EAST ANAPAMU ST., STE. 201 SANTA BARBARA, CA 95310 SANTA BARBARA, CA 95310 FOR: COUNTY OF SANTA BARBARA FOR: COUNTY OF SANTA BARBARA SUE A. GALLAGHER RICHARD SKAFF CITY ATTORNEY EXECUTIVE DIRECTOR CITY OF SANTA ROSA DESIGNING ACCESSIBLE COMMUNITIES 100 SANTA ROSA AVE., RM 8 15500 MONTE ROSA AVE. SANTA ROSA, CA 95404 GUERNEVILLE, CA 95446 DELPHINE HOU KIM PEREZ CA. INDEPENDENT SYSTEMS OPERATOR CORP CALIFORNIA ISO 250 OUTCROPPING WAY 250 OUTCROPPING WAY FOLSOM, CA 95630 FOLSOM, CA 95630 LAURA J. MANZ STEPHEN KEEHN DIRECTOR PACIFIC ENERGY ADVISORS, INC ENERGY NAVIGANT 1839 IRON POINT RD., SUITE 120 35 IRON POINT CIRCLE, STE. 225 FOLSOM, CA 95630 FOLSOM, CA 95630 ALEXIA RETALLACK JENINE WINDESHAUSEN MGR - MRKTG & GOV'T AFFAIRS EXE. DIR PIONEER COMMUNITY ENERGY PIONEER COMMUNITY ENERGY 2510 WARREN DRIVE, SUITE B 2510 WARRANT DDRIVE, STE. B ROCKLIN, CA 95677 ROCKLIN, CA 95677 DAVID PEFFER JORDAN DAVIS ATTORNEY DISABILITY RIGHTS CALIFORNIA LAW OFFICE OF DAVID PEFFER 1831 K STREET 3424 COOK STREET SACRAMENTO, CA 95811 ROCKLIN, CA 95765 SAMUEL JAIN AMY WARSHAUER STAFF ATTORNEY II MGR - GOV'T & EXTERNAL AFFAIRS DISABILITY RIGHTS CALIFORNIA FRONTIER COMMUNICATIONS 1831 K STREET 1201 K STREET, SUITE 1980 SACRAMENTO, CA 95811 SACRAMENTO, CA 95814 FOR: DISABILITY RIGHTS CALIFORNIA ANNA YANG ANTHONY NOLL CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH WILDFIRE SAFETY & ENFORCEMENT BRANCH 915 L Street Suite 1140 300 Capitol Mall Sacramento, CA 95814 Sacramento, CA 95814 BETH OLHASSO CHARLIE BORN WEST COAST ADVISORS DIR - GOV'T & EXTERNAL AFFAIRS 925 L STREET, SUITE 800 FRONTIER COMMUNICATIONS SACRAMENTO, CA 95814 1201 K STREET, STE. 1980 FOR: AGRICULTURAL ENERGY CONSUMERS SACRAMENTO, CA 95814 ASSOCIATION CHRISTOPHER MARELICH COLBY BERMEL DOWNEY BRAND LLP POLITICO 621 CAPITOL MALL, 18TH FLOOR 925 L STREET STE 150 SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 DAVID PEFFER DAVID PEFFER ATTORNEY ATTORNEY BRAUN BLAISING SMITH WYNNE, P.C. BRAUN BLAISING SMITH WYNNE, P.C. 555 CAPITOL MALL, STE. 570 555 CAPITOL MALL, SUITE 570 SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 FOR: SONOMA CLEAN POWER AUTHORITY FOR: MARIN CLEAN ENERGY, PENINSULA CLEAN ENERGY DAVID VAN DYKEN DRUCILLA DUNTON CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION ADMINISTRATIVE LAW JUDGE DIVISION DISTRIBUTION PLANNING BRANCH 300 Capitol Mall 300 Capitol Mall Sacramento, CA 95814 Sacramento, CA 95814 ELIZABETH MCALPINE FRANK HARRIS CALIF PUBLIC UTILITIES COMMISSION MGR OF ENERGY REGULATORY POLICY COMPLIANCE CA MUNICIPAL UTILITIES ASSOCIATION 300 Capitol Mall 915 L STREET, SUITE 1460 Sacramento, CA 95814 SACRAMENTO, CA 95814 FRANKY LAO JASDEEP LALLY CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION SAFETY BRANCH WILDFIRE SAFETY & ENFORCEMENT BRANCH 915 L Street Suite 1140 300 Capitol Mall Sacramento, CA 95814 Sacramento, CA 95814 JEDEDIAH J. GIBSON JILL STAFFORD ATTORNEY BUCHALTER, A PROFESSIONAL CORPORATION DOWNEY BRAND LLP 500 CAPITOL MALL STE 1900 621 CAPITOL MALL, 18TH FLOOR SACRAMENTO, CA 95814 SACRAMENTO, CA 95814 LEIGH KAMMERICH LINETTE YOUNG SR. POLICY ADVOCATE CALIF PUBLIC UTILITIES COMMISSION RURAL COUNTY REPRESENTATIVES OF CA CONSUMER AFFAIRS BRANCH 1215 K STREET, SUITE 1650 300 Capitol Mall SACRAMENTO, CA 95814 Sacramento, CA 95814 MABEL WU MAHDI JAHAMI CALIF PUBLIC UTILITIES COMMISSION CALIF PUBLIC UTILITIES COMMISSION WILDFIRE SAFETY & ENFORCEMENT BRANCH WATER AND SEWER ADVISORY BRANCH 300 Capitol Mall 300 Capitol Mall Sacramento, CA 95814 Sacramento, CA 95814 MICHAEL BOCCADORO MIHAIL CUCU PRESIDENT CALIF PUBLIC UTILITIES COMMISSION WEST COAST ADVISORS WILDFIRE SAFETY & ENFORCEMENT BRANCH 925 L STREET, SUITE 800 300 Capitol Mall SACRAMENTO, CA 95814 Sacramento, CA 95814 FOR: AGRICULTURAL ENERGY CONSUMERS ASSOCIATION REGULATORY CLERK RONALD DEMAYO BRAUN BLAISING SMITH WYNNE, PC CALIF PUBLIC UTILITIES COMMISSION 915 L STREET, STE. 1480 WILDFIRE SAFETY & ENFORCEMENT BRANCH SACRAMENTO, CA 95814 300 Capitol Mall Sacramento, CA 95814 SAMANTHA HOLDSTOCK SARAH KOZAL PARALEGAL CALIFORNIA ISO STOEL RIVES LLP 250 OUTCROPPING WAY 500 CAPITOL MALL, STE. 1600 FOLSOM, CA 95814 SACRAMENTO, CA 95814 SCOTT BLAISING SCOTT MERRILL COUNSEL CALIF PUBLIC UTILITIES COMMISSION BRAUN BLAISING SMITH WYNNE P.C. LEGAL DIVISION 915 L STREET, SUITE 1480 300 Capitol Mall SACRAMENTO, CA 95814 Sacramento, CA 95814 STEPHANI CRESPIN WILLIAM DIETRICH CALIF PUBLIC UTILITIES COMMISSION SR. ATTORNEY CARRIER OVERSIGHT AND PROGRAMS BRANCH CALIFORNIA ENERGY COMMISSION 400 R Street CHIEF COUNSELâ€™S OFFICE Sacramento, CA 95814 715 STREET, MS-14 SACRAMENTO, CA 95814 XUAN CHEN JEFFERY D. HARRIS CALIF PUBLIC UTILITIES COMMISSION ATTORNEY WILDFIRE SAFETY & ENFORCEMENT BRANCH ELLISON SCHNEIDER HARRIS & DONLAN LLP 300 Capitol Mall 2600 CAPITOL AVENUE, STE. 400 Sacramento, CA 95814 SACRAMENTO, CA 95816 MANAL YAMOUT MCDERMID ANDREW B. BROWN CALIBER STRATEGIES ATTORNEY AT LAW PO BOX 160724 ELLISON SCHNEIDER HARRIS & DONLAN LLP SACRAMENTO, CA 95816 2600 CAPITOL AVENUE, SUITE 400 SACRAMENTO, CA 95816-5931 SUSAN LIPPER MOUSTAFA ABOU-TALEB SR. MGR. - GOV'T AFFAIRS CALIF PUBLIC UTILITIES COMMISSION T-MOBILE WEST LLC SAFETY POLICY DIVISION 1755 CREEKSIDE OAKS DRIVE, STE. 190 180 Promenade Circle, Suite 115 SACRAMENTO, CA 95833 Sacramento, CA 95834 SARBJIT BAGRI JESSICA NELSON CALIF PUBLIC UTILITIES COMMISSION GENERAL MANAGER SAFETY MANAGEMENT SYSTEM BRANCH GOLDEN STATE POWER COOPERATIVE 180 Promenade Circle, Suite 115 PO BOX 1815 Sacramento, CA 95834 GRAEGLE, CA 96103-1815 JENNIFER FRY POOJA KISHORE FERC SPECIALIST / PRACTICE ASSIST. MGR - REGULATORY AFFAIRS STOEL RIVES LLP PACIFICORP 760 SW NINTH AVENUE, SUITE 3000 825 NE MULTNOMAH ST., STE. 2000 PORTLAND, OR 97205 PORTLAND, OR 97232 FOR: PACIFIC POWER HENRY SWEAT CALIF PUBLIC UTILITIES COMMISSION SAFETY POLICY DIVISION , State Service MICHAEL MINKUS CALIF PUBLIC UTILITIES COMMISSION COMMUNICATIONS DIVISION ROOM 5303 505 VAN NESS AVENUE SAN FRANCISCO, CA 94102-3214 TOP OF PAGE BACK TO INDEX OF SERVICE LISTS"
  },
  {
    "id": 6,
    "title": "557609905",
    "category": "Uncategorized",
    "summary": "This appears to be a service list document from a case (21-11-016) before the California Public Utilities Commission regarding a complaint by Dennis Reis and Deborah Reis against the Sonoma Marin Area Rail Transit District (SMART).",
    "url": "/documents/557609905.pdf",
    "lastModified": "2025-03-03T21:13:39.663Z",
    "size": 146644,
    "author": "Estes, Jarod",
    "creationDate": "2025-03-03T19:09:28.000Z",
    "pageCount": 3,
    "producer": "Adobe PDF Library 24.5.197",
    "textContent": "- 1 - ALJ/HCF/kp7 3/3/2025 BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA Dennis Reis and Deborah Reis, Complainants vs. Sonoma Marin Area Rail Transit District (SMART), Defendant. (ECP) Case 21-11-016 INFORMATION REGARDING SERVICE I have electronically served all people on the attached official service list who have provided an email address for Case 21-11-016. Upon confirmation of this document’s acceptance for filing, I will cause a copy of the filed document to be served by U.S. mail on all parties listed in the “Party” category of the official service list for whom no email address is provided. Dated March 3, 2025, at San Francisco, California. /s/ KRYSTAL PASTRANA HERNANDEZ Krystal Pastrana Hernandez FILED 03/03/25 11:11 AM C2111016 C.21-11-016 ALJ/HCF/kp7 - 2 - NOTICE Persons should notify the Process Office, Public Utilities Commission, 505 Van Ness Avenue, Room 2000, San Francisco, CA 94102, of any change of address to ensure that they continue to receive documents. You must indicate the proceeding number on the service list on which your name appears. * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * The Commission’s policy is to schedule hearings (meetings, workshops, etc.) in locations that are accessible to people with disabilities. To verify that a particular location is accessible, call: Calendar Clerk (415) 703-1203. If specialized accommodations for the disabled are needed, e.g., sign language interpreters, those making the arrangements must call the Public Advisor at (415) 703-2074 or TDD# (415) 703-2032 five working days in advance of the event. C.21-11-016 ALJ/HCF/kp7 - 1 - ************** PARTIES ************** Stuart C. Talley Attorney KERSHAW, COOK & TALLEY PC 401 WATT AVENUE SACRAMENTO CA 95864 (916) 779-7000 Stuart@KCTLegal.com For: Dennis Reis and Deborah Reis ____________________________________________ Thomas F. Lyons Gen. Counsel SONOMA-MARIN AREA RAIL TRANSIT DISTRICT 5401 OLD REDWOOD HWY., STE. 200 PETALUMA CA 94954 (707) 794-3330 TLyons@SonomaMarinTrain.org For: Sonoma Marin Area Rail Transit District ____________________________________________ Thomas S. Stewart, Esq. Attorney STEWART, WALD & MCCULLEY, LLC 2100 CENTRAL, STE. 22 KANSAS CITY MO 64108 (816) 303-1500 Stewart@SWM.Legal For: Dennis Reis and Deborah Reis ____________________________________________ ********** STATE EMPLOYEE *********** ********* INFORMATION ONLY ********** Hazlyn Fortune Administrative Law Judge Division RM. 5008 505 Van Ness Avenue San Francisco CA 94102 3298 (415) 703-2317 hcf@cpuc.ca.gov Deborah Reis 4871 PETALUMA BLVD S. PETALUMA CA 94952 (707) 480-5288 DReis@ReisRanch.com Dennis Reis 4871 PETALUMA BLVD S. PETALUMA CA 94952 (707) 480-5288 DReis@ReisRanch.com Jessica Sutherland Legal Counsel SMART 5401 OLD REDWOOD HIGHWAY, SUITE 200 PETALUMA CA 94954 (707) 794-3330 JSutherland@SonomaMarinTrain.org For: Sonoma-Marin Area Rail Transit ____________________________________________ Reed W. Ripley Attorney STEWART, WALD & MCCULLEY, LLC 2100 CENTRAL, STE. 22 KANSAS CITY MO 64108 (816) 330-1500 Ripley@SWM.Legal For: Dennis Reis and Deborah Reis ____________________________________________ Steven M. Wald Attorney STEWART, WALD & MMCULLEY, LLC 12474 OLIVE BOULEVARD, STE. 280 ST. LOUIS MO 63141 (314) 720-0220 Wald@SWM.Legal For: Dennis Reis and Deborah Reis ____________________________________________"
  },
  {
    "id": 7,
    "title": "A.1203002 PGE Application",
    "category": "Uncategorized",
    "summary": "Pacific Gas and Electric Company filed an application with the California Public Utilities Commission requesting a total of $9 million in increased revenue requirements over 4 years to fund its Customer Data Access Project.",
    "url": "/documents/A.1203002 PGE Application.pdf",
    "lastModified": "2025-03-03T20:54:16.941Z",
    "size": 181193,
    "author": "Unknown",
    "creationDate": null,
    "pageCount": 45,
    "producer": "Unknown",
    "textContent": "BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA In the Matter of the Application of Pacific Gas and Electric Company for Adoption of its Customer Data Access Project U 39 E A.12-03-___ CUSTOMER DATA ACCESS APPLICATION OF PACIFIC GAS AND ELECTRIC COMPANY (U 39 E) Dated: March 5, 2012 CHRISTOPHER J. WARNER Pacific Gas and Electric Company 77 Beale Street San Francisco, CA 94105 Telephone:(415) 973-6695 Facsimile:(415) 973-0516 E-Mail:CJW5@pge.com Attorneys for PACIFIC GAS AND ELECTRIC COMPANY A1203002 F I L E D 03-05-12 04:59 PM -1- BEFORE THE PUBLIC UTILITIES COMMISSION OF THE STATE OF CALIFORNIA In the Matter of the Application of Pacific Gas and Electric Company for Adoption of its Customer Data Access Project U 39 E A.12-03-___ CUSTOMER DATA ACCESS APPLICATION OF PACIFIC GAS AND ELECTRIC COMPANY (U 39 E) I.INTRODUCTION By this Application and in compliance with Ordering Paragraph 8 of Decision (D.) 11- 07-056, PG&E asks the California Public Utilities Commission (Commission or CPUC) to authorize PG&E to increase electric rates and charges to collect a total of $9 million over 4 years as the reasonable level of revenue requirements necessary to support its Customer Data Access Project as described in this Application and PG&E’s prepared testimony. This level of revenue requirements supports PG&E’s overall request of $19.4 million ($ 8.91 million capital and $10.45 million expense) to fund the Project. II.SUMMARY OF CUSTOMER DATA ACCESS PROJECT PG&E’s Customer Data Access Project will provide third parties with access to a customers’ electricity usage data via PG&E’s backhaul when authorized by the customer, as required by the Commission’s D.11-07-056. The Project will use a common data format to the extent practicable and will be consistent with ongoing national standards for energy data access, including the Open Automated Data Exchange (OpenADE) Energy Service Provider Interface (ESPI) standard. The new data access services provided to customers and third parties under the Project will include strict but streamlined eligibility criteria to ensure that access to customer data is secure and consistent with the policies adopted in D.11-07-056, including the Commission’s Rules Regarding Privacy and Security Protections for Energy Usage Data. -2- The Customer Data Access Project will implement an electronic customer authorization verification process that will provide affirmative confirmation from customers regarding their authorization of third parties to access their electricity usage data, including not only customer consent, but also customer specification of the scope and duration of the third party access, and the customer’s ability to revoke or limit the third party access at any time. This customer authorization will be comparable to the customer consent forms and process that the Commission has required the utilities to implement in hard copy form for over twenty years under the Commission’s prior customer privacy rules. In addition to this electronic customer authorization process, PG&E recommends two other enhancements to the Commission’s privacy protections under the Customer Data Access Project. First, PG&E requests approval to implement a modest customer outreach and education program on an on-going basis to inform customers of how the Customer Data Access Project will work and the importance of the customer being fully aware of their privacy rights and protections before authorizing a third party to access their private electricity consumption data. Second, in response to the Commission’s guidance in D.11-07-056 regarding procedures for ensuring that third parties protect customer data from unauthorized disclosure, PG&E in this Application recommends that the Commission implement a self-certification process for third parties to certify to the Commission that they meet industry-accepted standards for protecting the security of customer information that they seek to access under the Customer Data Access Project. This “customer security self-certification” process would be administered directly by the Commission and would be modeled on similar self-certification filings that the Commission has required in other proceedings, such as the independent verification and registration requirements for direct access providers under Public Utilities Code Sections 366.5 and 394, and the self-certification requirements for compliance by non-utilities with the Commission’s greenhouse gas emissions performance standard under Senate Bill (SB) 1368 and Public Utilities -3- Code Section 8340, et seq. 1/ III.STATEMENT OF RELIEF AND AUTHORITY SOUGHT A.Estimated Revenue Requirements Table 1 sets forth PG&E’s estimated revenue requirements each year associated with this request (in millions of dollars): Table 1 2013201420152016Total Annual Project Cost ($ millions) $898,708 $(1,606,294) $4,128,588 $5,593,181 $9,014,183 B.Cost Recovery Under PG&E’s proposal, PG&E’s will incur an overall project cost of up to a cap of $19.35 million for this Project from 2013 through 2016. PG&E will record the revenue requirement associated with the actual project cost incurred in a proposed new balancing account for rate recovery from all customers through the distribution rate component. The year-end balance of this new proposed balancing account 2/ will be transferred to the Distribution Revenue Adjustment Mechanism (DRAM) annually through the Annual Electric True-Up (AET) filing, or as otherwise ordered by the Commission. Assuming a decision in this proceeding by end of 2012, revenue requirement associated with actual cost incurred will begin to be recorded in 2013 and be recovered in the 2014 AET advice letter. Rates set to recover subsequent years’ revenue requirements will set in the applicable AET advice letters. PG&E is not proposing in this Application that third parties and/or customers using the customer data access services pay “user fees” for the services, comparable to the data access and other administrative fees charged under other programs, such as to Community Choice 1/See Commission D.07-01-039, mimeo, pp. 157- 162; SB 1368 (Stats. 2006, Ch. 598). 2 /Known as the Customer Data Access Balancing Account (CDABA). -4- Aggregators (CCAs) or Direct Access (DA) providers. 3/ However, if the Commission believes that customers not using data access services should not subsidize third parties or customers who do use the services, then PG&E is willing to consider and implement a user fee approach under which third parties and/or customers who use the customer data access services pay user fees to recover all or a portion of the costs of the service. These user fees could be calculated on the basis of both fixed and variable (usage-based operating and maintenance) costs, or only usage- based costs. In either case, the user fees should be simple and understandable enough to avoid complexity or labor intensity in collecting the fees under PG&E’s billing system. IV.SUMMARY OF REASONS FOR PG&E’S REQUEST AND SPECIFIC AREAS OF INCREASE A.Reasons for Requested Relief PG&E has provided detailed support for its request in this Application and the attached prepared testimony. In addition, PG&E’s Application is supported by the facts and policies included in Decision 11-07-056 and Ordering Paragraph 8 thereof, and in the workshops held by the Commission to discuss customer data access issues. The key reasons for the requested increase in revenue requirements are: !To comply with Ordering Paragraph 8 of Decision No. 11-07-056; and !To provide customers and third party energy management and service providers with streamlined, robust access to customer energy data using the utility’s backhaul in order to foster an increased variety of competitively priced and available energy management services in the marketplace. B.Summary Supporting Increase This Application and prepared testimony attached hereto provide a summary of the support for the increase in electric rates requested in this Application. 3/See, e.g.,PG&E Electric Rate Schedules E-CCA, E-CCAINFO, E-ESP, E-EUS, and E-ESPNDSF. -5- V.COST OF CAPITAL/AUTHORIZED RATE OF RETURN The Rate Case Plan requires a utility to “use the most recently authorized rate of return in its calculations” supporting its results of operations presentation. 4/ Accordingly, PG&E has used the authorized cost of capital information set forth in Decisions (D.) 07-12-049 and 08-05-035. VI.REVENUES AT PRESENT RATES IN THE RESULTS OF OPERATIONS REPORT PG&E’s rates and charges for electric service are set forth in PG&E’s electric tariffs on file with this Commission. The Commission has approved these tariffs in decisions, orders, and resolutions. Exhibit B sets forth PG&E’s present electric rates. VII.EXHIBITS Appendix A to this Application provides PG&E’s prepared testimony in support of the Application. VIII. COMPLIANCE WITH THE COMMISSION’S RULES OF PRACTICE AND PROCEDURE A.Statutory Authority PG&E files this Application pursuant to Sections 451, 453, and 8360 – 8368 of the Public Utilities Code, the Commission’s Rules of Practice and Procedure, and prior decisions, orders, and resolutions of this Commission, particularly Commission Decision No. 11-07-056. B.Categorization - Rule 2.1.(c) PG&E proposes that this Application be categorized as a “ratesetting” proceeding. C.Need for Hearing - Rule 2.1(c) PG&E anticipates that evidentiary hearings may not be needed. PG&E’s proposed schedule is set forth in subsection E, below. D.Issues to be Considered - Rule 2.1(c) The principal issues are whether: 4/D.89-01-040; 30 CPUC 2d 576, 606. -6- 1.PG&E’s Customer Data Access Project complies with law and Commission orders and decisions. 2.The revenue requirements for PG&E’s Customer Data Access Project are just and reasonable and PG&E’s Application should be approved. E.Proposed Schedule – Rule 2.1(c) File Application March 5, 2012 Protests DueApril 4, 2012 Reply to ProtestsApril 16, 2012 Prehearing ConferenceMay 10, 2012 Scoping MemoMay 31, 2012 Intervenor reports and testimony servedAugust 3, 2012 Applicant rebuttal testimony servedSeptember 7, 2012 Hearing (if necessary)October 10- 12, 2012 Post Hearing Comments and BriefsNovember 30, 2012 Proposed Decision January 28, 2013 Opening Comments on Proposed DecisionFebruary 18, 2013 Reply Comments on Proposed DecisionFebruary 25, 2013 DecisionMarch 7, 2013 F.Legal Name and Principal Place of Business – Rule 2.1(a) The legal name of the Applicant is Pacific Gas and Electric Company. PG&E’s principal place of business is San Francisco, California. Its post office address is Post Office Box 7442, San Francisco, California 94120. G.Correspondence and Communication Regarding This Application - Rule 2.1.(b) All correspondence and communications regarding this Application should be addressed to Christopher J. Warner and Mwirigi Imungi at the addresses listed below: -7- Christopher J. Warner Law Department Pacific Gas and Electric Company Post Office Box 7442 San Francisco, California 94120 Telephone: (415) 973-6695 Fax: (415) 973-5220 E-mail: cjw5@pge.com Mwirigi Imungi Operations Proceedings Department Pacific Gas and Electric Company 77 Beale Street San Francisco, California, 94105 Telephone: (415) 973-3864 Fax: (415) 973-6520 E-Mail: MXI9@pge.com Overnight hardcopy delivery : Christopher J. Warner Law Department Pacific Gas and Electric Company 77 Beale Street, B30A San Francisco, California 94105 H.Articles of Incorporation – Rule 2.2 PG&E is, and since October 10, 1905, has been, an operating public utility corporation organized under California law. It is engaged principally in the business of furnishing electric and gas services in California. A certified copy of PG&E’s Restated Articles of Incorporation, effective April 12, 2004, is on record before the Commission in connection with PG&E’s Application 04-05-005, filed with the Commission on May 3, 2004. These articles are incorporated herein by reference pursuant to Rule 2.2 of the Commission’s Rules. I.Balance Sheet and Income Statement - Rule 3.2(a)(1) PG&E’s balance sheet and an income statement for the three months ending December 31, 2011, are contained in Exhibit A of this Application. J.Statement of Presently Effective Rates - Rule 3.2(a)(2) The presently effective electric rates PG&E proposes to modify are set forth in Exhibit B of this Application. K.Statement of Proposed Changes and Results of Operations at Proposed Rates - Rule 3.2(a)(3) The proposed changes in revenues are not in excess of one percent. -8- L.General Description of PG&E’s Electric and Gas Department Plant - Rule 3.2(a)(4) Because this submittal is not a general rate application, this requirement is not applicable. M.Summary of Earnings - Rules 3.2(a)(5) and 3.2(a)(6) Exhibit C shows for the recorded year 2010, the revenues, expenses, rate bases and rate of return for PG&E’s Electric and Gas Departments. N.Statement of Election of Method of Computing Depreciation Deduction for Federal Income Tax - Rule 3.2(a)(7) Because this submittal is not a general rate application, this requirement is not applicable. O.Most Recent Proxy Statement - Rule 3.2(a)(8) Because this submittal is not a general rate application, this requirement is not applicable. P.Type of Rate Change Requested - Rule 3.2(a)(10) This proposed change reflects changes in PG&E’s base revenues to reflect the costs PG&E incurs to own, operate and maintain its electric plant and to enable PG&E to provide service to its customers. Q.Notice and Service of Application – Rule 3.2(b)-(d) Within twenty (20) days after filing this Application, PG&E will mail a notice stating in general terms the proposed revenues, rate changes, and ratemaking mechanisms requested in this Application to the parties listed in Exhibit D, including the State of California and cities and counties served by PG&E. A copy of the Application and attachments is being served on the parties of record in R.08-12-009. PG&E will publish in newspapers of general circulation in each county in its service territory a notice of filing this Application. PG&E will also include notices with the regular bills mailed to all customers affected by the proposed changes. R.Exhibit List and Statement of Readiness PG&E is ready to proceed with this case based on the Application and the prepared testimony in the accompanying exhibits in support of the revenue request set forth in this -9- Application. IX.REQUEST FOR COMMISSION ORDERS PG&E requests that the Commission issue appropriate orders: 1.Finding that PG&E’s Customer Data Access Project complies with law and Commission orders, including Ordering Paragraphs 6, 7 and 8 of D.11-07-056; 2.Approving PG&E’s revenue requirements requested in this Application as just and reasonable, and 3.Granting such additional relief as the Commission may deem proper. Dated: March 5, 2012 Respectfully Submitted, CHRISTOPHER J. WARNER By: /s/ CHRISTOPHER J. WARNER Pacific Gas and Electric Company 77 Beale Street San Francisco, CA 94105 Telephone: (415) 973-6695 Facsimile: (415) 973-0516 E-Mail: CJW5@pge.com Attorney for PACIFIC GAS AND ELECTRIC COMPANY -1- VERIFICATION I, the undersigned, say: I am an officer of Pacific Gas and Electric Company, a corporation, and am authorized to make this verification on its behalf. The statements in the foregoing document are true of my own knowledge, except as to matters which are therein stated on information or belief, and as to those matters I believe them to be true. I declare under penalty of perjury that the foregoing is true and correct. Executed on March 5, 2012, at San Francisco, California. ___________/s/____________________ Name: Steven Malnight Vice President, Customer Energy Solutions EXHIBIT A Pacific Gas and Electric Company CONSOLIDATED STATEMENTS OF INCOME (in millions) Year ended December 31, 2011 2010 2009 Operating Revenues Electric $11,601 $ 10,644 $10,257 Natural gas 3,350 3,196 3,142 Total operating revenues 14,951 13,840 13,399 Operating Expenses Cost of electricity 4,016 3,898 3,711 Cost of natural gas 1,317 1,291 1,291 Operating and maintenance 5,459 4,432 4,343 Depreciation, amortization, and decommissioning 2,215 1,905 1,752 Total operating expenses 13,007 11,526 11,097 Operating Income 1,944 2,314 2,302 Interest income 5 9 33 Interest expense (677) (650) (662) Other income, net 53 22 59 Income Before Income Taxes 1,325 1,695 1,732 Income tax provision 480 574 482 Net Income 845 1,121 1,250 Preferred stock dividend requirement 14 14 14 Income Available for Common Stock $ 831 $ 1,107 $ 1,236 Pacific Gas and Electric Company CONSOLIDATED BALANCE SHEETS (in millions) Balance at December 31, 2011 2010 ASSETS Current Assets Cash and cash equivalents $ 304 $ 51 Restricted cash ($51 and $38 related to energy recovery bonds at December 31, 2011 and 2010, respectively) 380 563 Accounts receivable Customers (net of allowance for doubtful accounts of $81 at December 31, 2011 and 2010) 992 944 Accrued unbilled revenue 763 649 Regulatory balancing accounts 1,082 1,105 Other 840 856 Regulatory assets ($336 and $0 related to energy recovery bonds at December 31, 2011 and 2010, respectively) 1,090 599 Inventories Gas stored underground and fuel oil 159 152 Materials and supplies 261 205 Income taxes receivable 242 48 Other 213 190 Total current assets 6,326 5,362 Property, Plant, and Equipment Electric 35,851 33,508 Gas 11,931 11,382 Construction work in progress 1,770 1,384 Total property, plant, and equipment 49,552 46,274 Accumulated depreciation (15,898) (14,826) Net property, plant, and equipment 33,654 31,448 Other Noncurrent Assets Regulatory assets ($0 and $735 related to energy recovery bonds at December 31, 2011 and 2010, respectively) 6,506 5,846 Nuclear decommissioning trusts 2,041 2,009 Income taxes receivable 384 614 Other 331 400 Total other noncurrent assets 9,262 8,869 TOTAL ASSETS $ 49,242 $ 45,679 Pacific Gas and Electric Company CONSOLIDATED BALANCE SHEETS (in millions, except share amounts) Balance at December 31, 2011 2010 LIABILITIES AND SHAREHOLDERS’ EQUITY Current Liabilities Short-term borrowings $ 1,647 $ 853 Long-term debt, classified as current 50 809 Energy recovery bonds, classified as current 423 404 Accounts payable Trade creditors 1,177 1,129 Disputed claims and customer refunds 673 745 Regulatory balancing accounts 374 256 Other 417 390 Interest payable 838 857 Income taxes payable 118 116 Deferred income taxes 199 118 Other 1,628 1,349 Total current liabilities 7,544 7,026 Noncurrent Liabilities Long-term debt 11,417 10,557 Energy recovery bonds - 423 Regulatory liabilities 4,733 4,525 Pension and other postretirement benefits 3,325 2,174 Asset retirement obligations 1,609 1,586 Deferred income taxes 6,160 5,659 Other 2,070 2,008 Total noncurrent liabilities 29,314 26,932 Commitments and Contingencies (Note 15) Shareholders’ Equity Preferred stock 258 258 Common stock, $5 par value, authorized 800,000,000 shares, 264,374,809 shares outstanding at December 31, 2011 and 2010 1,322 1,322 Additional paid-in capital 3,796 3,241 Reinvested earnings 7,210 7,095 Accumulated other comprehensive loss (202) (195) Total shareholders’ equity 12,384 11,721 TOTAL LIABILITIES AND SHAREHOLDERS’ EQUITY $ 49,242 $ 45,679 EXHIBIT B Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 RESIDENTIAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-11 2MINIMUM BILL ($/MONTH )$4.50$4.502 3ES UNIT DISCOUNT ($/UNIT/MONTH )($0.70)($0.70)3 4ET UNIT DISCOUNT ($/UNIT/MONTH )$2.35$2.354 5ES/ET MINIMUM RATE LIMITER ($/KWH )$0.04892$0.048925 6ENERGY ($/KWH)6 7 TIER 1 $0.12845 $0.128457 8 TIER 2$0.14602 $0.146028 9 TIER 3$0.29940 $0.299409 10 TIER 4$0.33940 $0.3394010 11 TIER 5$0.33940 $0.3394011 **************************************************************************************************************************** * 12SCHEDULE EL-1 (CARE)12 13MINIMUM BILL ($/MONTH )$3.60$3.6013 14ENERGY ($/KWH)14 15 TIER 1 $0.08316 $0.08316 15 16 TIER 2$0.09563 $0.09563 16 17 TIER 3$0.12474 $0.12474 17 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 RESIDENTIAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-6 / EM-TOU1 2MINIMUM BILL ($/MONTH )$4.50$4.502 3E-6 METER CHARGE ($/MONTH)$7.70$7.703 4ON-PEAK ENERGY ($/KWH)4 5 TIER 1 $0.278835 6 TIER 2$0.296406 7 TIER 3$0.450327 8 TIER 4$0.490328 9 TIER 5$0.490329 10PART-PEAK ENERGY ($/KWH)10 11 TIER 1 $0.17017$0.1177611 12 TIER 2$0.18775$0.1353312 13 TIER 3$0.34167$0.2892513 14 TIER 4$0.38167$0.3292514 15 TIER 5$0.38167$0.3292515 16OFF-PEAK ENERGY ($/KWH)16 17 TIER 1 $0.09781$0.1018917 18 TIER 2$0.11538$0.1194718 19 TIER 3$0.26930$0.2733919 20 TIER 4$0.30930$0.3133920 21 TIER 5$0.30930$0.3133921 **************************************************************************************************************************** * 22SCHEDULE EL-6 / EML-TOU22 23MINIMUM BILL ($/MONTH )$3.60$3.6023 24EL-6 METER CHARGE($/MONTH)$6.16$6.1624 25ON-PEAK ENERGY ($/KWH)25 26 TIER 1 $0.1965526 27 TIER 2$0.2100827 28 TIER 3$0.2948328 29PART-PEAK ENERGY ($/KWH)29 30 TIER 1 $0.11451$0.0749430 31 TIER 2$0.12804$0.0884531 32 TIER 3$0.17177$0.1124132 33OFF-PEAK ENERGY ($/KWH)33 34 TIER 1 $0.05987$0.0629534 35 TIER 2$0.07340$0.0764735 36 TIER 3$0.08981$0.0944336 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 RESIDENTIAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-71 2MINIMUM BILL ($/MONTH )$4.50$4.502 3E-7 METER CHARGE ($/MONTH)$3.51$3.513 4RATE W METER CHARGE ($/MONTH)$1.17$1.174 5ON-PEAK ENERGY ($/KWH)5 6 TIER 1 $0.31312 $0.11093 6 7 TIER 2$0.33128 $0.12909 7 8 TIER 3$0.48465 $0.28246 8 9 TIER 4$0.52465 $0.32246 9 10 TIER 5$0.52465 $0.32246 10 11OFF-PEAK ENERGY ($/KWH)11 12 TIER 1 $0.07921 $0.08262 12 13 TIER 2$0.09737 $0.10078 13 14 TIER 3$0.25074 $0.25415 14 15 TIER 4$0.29074 $0.29415 15 16 TIER 5$0.29074 $0.29415 16 **************************************************************************************************************************** * 17SCHEDULE EL-7 17 18MINIMUM BILL ($/MONTH )$4.50$4.5018 19EL-7 METER CHARGE($/MONTH)$0.00$0.0019 20ON-PEAK ENERGY ($/KWH)20 21 TIER 1 $0.26813 $0.08913 21 22 TIER 2$0.28372 $0.10472 22 23 TIER 3$0.40220 $0.13370 23 24OFF-PEAK ENERGY ($/KWH)24 25 TIER 1 $0.06105 $0.06407 25 26 TIER 2$0.07664 $0.07966 26 27 TIER 3$0.09158 $0.09611 27 **************************************************************************************************************************** * 28SCHEDULE E-828 29CUSTOMER CHARGE ($/MONTH)$12.53$12.5329 30ENERGY ($/KWH)30 31 TIER 1 $0.13270 $0.08497 31 32 TIER 2$0.13270 $0.08497 32 33 TIER 3$0.28607 $0.23834 33 34 TIER 4$0.32607 $0.27834 34 35 TIER 5$0.32607 $0.27834 35 **************************************************************************************************************************** * 36SCHEDULE EL-8 (CARE)36 37CUSTOMER CHARGE ($/MONTH)$10.02$10.0237 38ENERGY CHARGE ($/KWH)38 39 TIER 1 $0.08624$0.0523439 40 TIER 2$0.08624$0.0523440 41 TIER 3$0.12936$0.0785141 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 RESIDENTIAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-A71 2MINIMUM BILL ($/MONTH )$4.50$4.502 3E-A7 METER CHARGE ($/MONTH)$3.51$3.513 4RATE Y METER CHARGE ($/MONTH)$1.17$1.174 5ON-PEAK ENERGY ($/KWH)5 6 TIER 1 $0.34574 $0.11004 6 7 TIER 2$0.36390 $0.12819 7 8 TIER 3$0.51727 $0.28157 8 9 TIER 4$0.55727 $0.32157 9 10 TIER 5$0.55727 $0.32157 10 11OFF-PEAK ENERGY ($/KWH)11 12 TIER 1 $0.07452 $0.08272 12 13 TIER 2$0.09267 $0.10087 13 14 TIER 3$0.24605 $0.25425 14 15 TIER 4$0.28605 $0.29425 15 16 TIER 5$0.28605 $0.29425 16 **************************************************************************************************************************** * 17SCHEDULE EL-A7 17 18MINIMUM BILL ($/MONTH )$4.50$4.5018 19EL-A7 METER CHARGE($/MONTH)$0.00$0.0019 20ON-PEAK ENERGY ($/KWH)20 21 TIER 1 $0.29701 $0.08834 21 22 TIER 2$0.31260 $0.10393 22 23 TIER 3$0.44552 $0.13251 23 24OFF-PEAK ENERGY ($/KWH)24 25 TIER 1 $0.05689 $0.06415 25 26 TIER 2$0.07248 $0.07974 26 27 TIER 3$0.08534 $0.09623 27 **************************************************************************************************************************** * 28SCHEDULE E-9: RATE A28 29MINIMUM BILL ($/MONTH )$4.50$4.5029 30E-9 METER CHARGE ($/MONTH)$6.66$6.6630 31ON-PEAK ENERGY ($/KWH)31 32 TIER 1 $0.3017832 33 TIER 2$0.3199433 34 TIER 3$0.5041534 35 TIER 4$0.5441535 36 TIER 5$0.5441536 37PART-PEAK ENERGY ($/KWH)37 38 TIER 1 $0.09876$0.0986438 39 TIER 2$0.11692$0.1167939 40 TIER 3$0.30113$0.3010140 41 TIER 4$0.34113$0.3410141 42 TIER 5$0.34113$0.3410142 43OFF-PEAK ENERGY ($/KWH)43 44 TIER 1 $0.03743$0.0468044 45 TIER 2$0.05559$0.0649545 46 TIER 3$0.16011$0.1601146 47 TIER 4$0.20011$0.2001147 48 TIER 5$0.20011$0.2001148 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 RESIDENTIAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-9: RATE B1 2MINIMUM BILL ($/MONTH )$4.50$4.502 3E-9 METER CHARGE ($/MONTH)$6.66$6.663 4ON-PEAK ENERGY ($/KWH)4 5 TIER 1 $0.297265 6 TIER 2$0.315416 7 TIER 3$0.499627 8 TIER 4$0.539628 9 TIER 5$0.539629 10PART-PEAK ENERGY ($/KWH)10 11 TIER 1 $0.09424$0.0946211 12 TIER 2$0.11239$0.1127712 13 TIER 3$0.29661$0.2969913 14 TIER 4$0.33661$0.3369914 15 TIER 5$0.33661$0.3369915 16OFF-PEAK ENERGY ($/KWH)16 17 TIER 1 $0.04479$0.0533917 18 TIER 2$0.06295$0.0715518 19 TIER 3$0.24716$0.2557619 20 TIER 4$0.28716$0.2957620 21 TIER 5$0.28716$0.2957621 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 SMALL L&P RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE A-11 2CUSTOMER CHARGE: SINGLE-PHASE ($/MO.)$10.00$10.002 3CUSTOMER CHARGE: POLYPHASE ($/MO.)$20.00$20.003 4ENERGY ($/KWH)$0.20522$0.144934 **************************************************************************************************************************** * 5SCHEDULE A-1 TOU5 6CUSTOMER CHARGE: SINGLE-PHASE ($/MO.)$10.00$10.006 7CUSTOMER CHARGE: POLYPHASE ($/MO.)$20.00$20.007 8ENERGY ($/KWH)8 9 ON-PEA K$0.21978 9 10 PART-PEA K$0.21321 $0.15223 10 11 OFF-PEAK ENERGY$0.19322 $0.13816 11 **************************************************************************************************************************** * 12SCHEDULE A-612 13CUSTOMER CHARGE: SINGLE-PHASE ($/MO.)$10.00$10.0013 14CUSTOMER CHARGE: POLYPHASE ($/MO.)$20.00$20.0014 15METER CHARGE ($/MONTH)$6.12$6.1215 16METER CHARGE - RATE W ($/MONTH)$1.80$1.8016 17METER CHARGE - RATE X ($/MONTH )$6.12$6.1217 18ENERGY ($/KWH)18 19 ON-PEA K$0.43995 19 20 PART-PEA K$0.22498 $0.15247 20 21 OFF-PEAK ENERGY$0.13840 $0.12840 21 **************************************************************************************************************************** * 22SCHEDULE A-1522 23CUSTOMER CHARGE ($/MONTH)$10.00$10.0023 24FACILITY CHARGE ($/MONTH )$25.00$25.0024 25ENERGY ($/KWH)$0.20522 $0.14493 25 **************************************************************************************************************************** * 26SCHEDULE TC-126 27CUSTOMER CHARGE ($/MONTH)$10.00$10.0027 28ENERGY ($/KWH)$0.14178 $0.14178 28 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 MEDIUM L&P RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE A-101 2CUSTOMER CHARGE ($/MONTH)$140.00$140.002 3MAXIMUM DEMAND CHARGE ($/KW/MO)3 4 SECONDARY VOLTAGE$12.15$5.634 5 PRIMARY VOLTAG E$11.38$5.845 6 TRANSMISSION VOLTAG E$7.47$4.136 7ENERGY CHARGE ($/KWH)7 8 SECONDARY VOLTAGE$0.13834 $0.10331 8 9 PRIMARY VOLTAG E$0.12944 $0.09904 9 10 TRANSMISSION VOLTAG E$0.10537 $0.08669 10 **************************************************************************************************************************** * 11SCHEDULE A-10 TOU11 12CUSTOMER CHARGE ($/MONTH)$140.00$140.0012 13MAXIMUM DEMAND CHARGE ($/KW/MO)13 14 SECONDARY VOLTAGE$12.15$5.6314 15 PRIMARY VOLTAG E$11.38$5.8415 16 TRANSMISSION VOLTAG E$7.47$4.1316 17ENERGY CHARGE ($/KWH)17 18SECONDARY18 19 ON PEA K$0.15130 19 20 PARTIAL PEA K$0.14543 $0.11116 20 21 OFF-PEA K$0.12759 $0.09586 21 22PRIMARY22 23 ON PEA K$0.14026 23 24 PARTIAL PEA K$0.13607 $0.10545 24 25 OFF-PEA K$0.12008 $0.09293 25 26TRANSMISSION26 27 ON PEA K$0.11521 27 28 PARTIAL PEA K$0.11139 $0.09260 28 29 OFF-PEA K$0.09686 $0.08108 29 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 E-19 FIRM RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-19 T FIRM1 2CUSTOMER CHARGE > 500 KW ($/MONTH)$1,800.00$1,800.002 3CUSTOMER CHARGE < 500 KW ($/MONTH)$140.00$140.003 4TOU METER CHARGE - RATES V & X ($/MONTH )$5.40$5.404 5TOU METER CHARGE - RATE W ($/MONTH)$1.08$1.085 6DEMAND CHARGE ($/KW/MONTH)6 7 ON-PEAK $12.377 8 PARTIAL PEA K$2.74$0.008 9 MAXIMU M$5.35$5.359 10ENERGY CHARGE ($/KWH)10 11 ON-PEA K$0.08241 11 12 PARTIAL-PEA K$0.07903 $0.07784 12 13 OFF-PEA K$0.06725 $0.06850 13 **************************************************************************************************************************** * 14SCHEDULE E-19 P FIRM14 15CUSTOMER CHARGE > 500 KW ($/MONTH)$1,000.00$1,000.0015 16CUSTOMER CHARGE < 500 KW ($/MONTH)$140.00$140.0016 17TOU METER CHARGE - RATES V & X ($/MONTH )$5.40$5.4017 18TOU METER CHARGE - RATE W ($/MONTH)$1.08$1.0818 19DEMAND CHARGE ($/KW/MONTH)19 20 ON-PEAK $14.4820 21 PARTIAL PEA K$3.15$0.4021 22 MAXIMU M$9.23$9.2322 23ENERGY CHARGE ($/KWH)23 24 ON-PEA K$0.12433 24 25 PARTIAL-PEA K$0.09053 $0.08671 25 26 OFF-PEA K$0.07039 $0.07280 26 **************************************************************************************************************************** * 27SCHEDULE E-19 S FIRM27 28CUSTOMER CHARGE > 500 KW ($/MONTH)$600.00$600.0028 29CUSTOMER CHARGE < 500 KW ($/MONTH)$140.00$140.0029 30TOU METER CHARGE - RATES V & X ($/MONTH )$5.40$5.4030 31TOU METER CHARGE - RATE W ($/MONTH)$1.08$1.0831 32DEMAND CHARGE ($/KW/MONTH)32 33 ON-PEAK $14.7033 34 PARTIAL PEA K$3.43$0.2134 35 MAXIMU M$11.85$11.8535 36ENERGY CHARGE ($/KWH)36 37 ON-PEA K$0.13476 37 38 PARTIAL-PEA K$0.09579 $0.09063 38 39 OFF-PEA K$0.07028 $0.07320 39 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 E-20 FIRM RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-20 T FIRM1 2CUSTOMER CHARGE ($/MONTH)-FIRM$2,000.00$2,000.002 3DEMAND CHARGE ($/KW/MONTH)3 4 ON-PEAK $12.244 5 PARTIAL PEA K$2.65$0.005 6 MAXIMU M$4.06$4.066 7ENERGY CHARGE ($/KWH)7 8 ON-PEA K$0.08981 8 9 PARTIAL-PEA K$0.07574 $0.07680 9 10 OFF-PEA K$0.06397 $0.06704 10 **************************************************************************************************************************** * 11SCHEDULE E-20 P FIRM11 12CUSTOMER CHARGE ($/MONTH)$1,500.00$1,500.0012 13DEMAND CHARGE ($/KW/MONTH)13 14 ON-PEAK $14.0314 15 PARTIAL PEA K$2.99$0.2515 16 MAXIMU M$9.36$9.3616 17ENERGY CHARGE ($/KWH)17 18 ON-PEA K$0.12350 18 19 PARTIAL-PEA K$0.09010 $0.08633 19 20 OFF-PEA K$0.07057 $0.07360 20 **************************************************************************************************************************** * 21SCHEDULE E-20 S FIRM21 22CUSTOMER CHARGE ($/MONTH)$1,000.00$1,000.0022 23DEMAND CHARGE ($/KW/MONTH)23 24 ON-PEAK $14.3224 25 PARTIAL PEA K$3.15$0.2325 26 MAXIMU M$11.72$11.7226 27ENERGY CHARGE ($/KWH)27 28 ON-PEA K$0.12421 28 29 PARTIAL-PEA K$0.09141 $0.08675 29 30 OFF-PEA K$0.06979 $0.07066 30 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 OIL AND GAS EXTRACTION RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE E-371 2CUSTOMER CHARGE ($/MONTH)$36.00$36.002 3TOU METER CHARGE - RATE W ($/MONTH)$1.20$1.203 4TOU METER CHARGE - RATE X ($/MONTH )$6.00$6.004 5ON PEAK DEMAND CHARGE ($/KW/MO)$7.495 6MAXIMUM DEMAND CHARGE ($/KW/MO)6 7 SECONDARY VOLTAGE$11.83$4.657 8 PRIMARY VOLTAGE DISCOUN T$1.29$0.158 9 TRANSMISSION VOLTAGE DISCOUN T$8.88$4.009 10ENERGY ($/KWH)10 11 ON-PEAK $0.1634311 12 PART-PEA K$0.0884312 13 OFF-PEA K$0.07318$0.0668713 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 STANDBY RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE S - TRANSMISSION1 2CONTRACT CAPACITY CHARGE ($/KW/MO.)$0.92$0.922 3EFFECTIVE RESERVATION CHARGE ($/KW/MO.)$0.78$0.783 4ENERGY ($/KWH)4 5 ON-PEAK $0.095955 6 PART-PEA K$0.09236$0.090986 7 OFF-PEA K$0.07871$0.080157 **************************************************************************************************************************** * 8SCHEDULE S - PRIMARY8 9CONTRACT CAPACITY CHARGE ($/KW/MO.)$3.03$3.039 10EFFECTIVE RESERVATION CHARGE ($/KW/MO.)$2.58$2.5810 11ENERGY ($/KWH)11 12 ON-PEAK $0.4550112 13 PART-PEA K$0.24566$0.1301513 14 OFF-PEA K$0.16041$0.1091914 **************************************************************************************************************************** * 15SCHEDULE S - SECONDARY15 16CONTRACT CAPACITY CHARGE ($/KW/MO.)$3.05$3.0516 17EFFECTIVE RESERVATION CHARGE ($/KW/MO.)$2.59$2.5917 18ENERGY ($/KWH)18 19 ON-PEAK $0.4531619 20 PART-PEA K$0.24402$0.1305320 21 OFF-PEA K$0.15874$0.1079021 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 STANDBY RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE S CUSTOMER AND METER CHARGES1 2RESIDENTIAL2 3CUSTOMER CHARGE ($/MO)$5.00$5.003 4TOU METER CHARGE ($/MO )$3.90$3.904 5 AGRICULTURAL5 6CUSTOMER CHARGE ($/MO)$16.00$16.006 7TOU METER CHARGE ($/MO )$6.00$6.007 8SMALL LIGHT AND POWER (less than or equal to 50 kW )8 9SINGLE PHASE CUSTOMER CHARGE ($/MO)$10.00$10.009 10POLY PHASE CUSTOMER CHARGE ($/MO)$20.00$20.0010 11METER CHARGE ($/MO)$6.12$6.1211 12MEDIUM LIGHT AND POWER (>50 kW, <500 kW)12 13CUSTOMER CHARGE ($/MO)$140.00$140.0013 14METER CHARGE ($/MO)$5.40$5.4014 15MEDIUM LIGHT AND POWER (>500kW)15 16TRANSMISSION CUSTOMER CHARGE ($/MO )$1,800.00$1,800.0016 17PRIMARY CUSTOMER CHARGE ($/MO)$1,000.00$1,000.0017 18SECONDARY CUSTOMER CHARGE ($/MO)$600.00$600.0018 19LARGE LIGHT AND POWER (> 1000 kW)19 20TRANSMISSION CUSTOMER CHARGE ($/MO )$2,000.00$2,000.0020 21PRIMARY CUSTOMER CHARGE ($/MO)$1,500.00$1,500.0021 22SECONDARY CUSTOMER CHARGE ($/MO)$1,000.00$1,000.0022 23REDUCED CUSTOMER CHARGES ($/MO)23 24SMALL LIGHT AND PWR ( (` < 50 kW)$14.31$14.3124 25 MED LIGHT AND PWR (Res Capacity >50 kW and <500 kW)$74.87$74.8725 26 MED LIGHT AND PWR (Res Capacity > 500 kW and < 1000 kW)$1,206.88$1,206.8826 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 AGRICULTURAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE AG-1A1 2CUSTOMER CHARGE ($/MONTH)$17.30$17.302 3CONNECTED LOAD CHARGE ($/KW/MONTH)$6.09$1.173 4ENERGY CHARGE ($/KWH)$0.21678 $0.17016 4 **************************************************************************************************************************** * 5SCHEDULE AG-RA5 6CUSTOMER CHARGE - RATES A & D ($/MONTH)$17.30$17.306 7METER CHARGE - RATE A ($/MONTH )$6.80$6.807 8METER CHARGE - RATE D ($/MONTH )$2.00$2.008 9CONNECTED LOAD CHARGE ($/KW/MONTH)$5.44$0.899 10ENERGY ($/KWH)10 11 ON-PEAK $0.40498 11 12 PART-PEA K$0.14871 12 13 OFF-PEAK $0.14624 $0.12288 13 **************************************************************************************************************************** * 14SCHEDULE AG-VA14 15CUSTOMER CHARGE - RATES A & D ($/MONTH)$17.30$17.3015 16METER CHARGE - RATE A ($/MONTH )$6.80$6.8016 17METER CHARGE - RATE D ($/MONTH )$2.00$2.0017 18CONNECTED LOAD CHARGE ($/KW/MONTH)$5.46$0.9318 19ENERGY ($/KWH)19 20 ON-PEAK $0.3786720 21 PART-PEA K$0.1494121 22 OFF-PEAK $0.14330$0.1235322 **************************************************************************************************************************** * 23SCHEDULE AG-4A23 24CUSTOMER CHARGE - RATES A & D ($/MONTH)$17.30$17.3024 25METER CHARGE - RATE A ($/MONTH )$6.80$6.8025 26METER CHARGE - RATE D ($/MONTH )$2.00$2.0026 27CONNECTED LOAD CHARGE ($/KW/MONTH)$5.42$0.8027 28ENERGY ($/KWH)28 29 ON-PEAK $0.3132529 30 PART-PEA K$0.1485630 31 OFF-PEAK $0.14372$0.1230531 **************************************************************************************************************************** * 32SCHEDULE AG-5A32 33CUSTOMER CHARGE - RATES A & D ($/MONTH)$17.30$17.3033 34METER CHARGE - RATE A ($/MONTH )$6.80$6.8034 35METER CHARGE - RATE D ($/MONTH )$2.00$2.0035 36CONNECTED LOAD CHARGE ($/KW/MONTH)$8.77$1.6336 37ENERGY ($/KWH)37 38 ON-PEAK $0.2358838 39 PART-PEA K$0.1290239 40 OFF-PEAK $0.12275$0.1098740 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 AGRICULTURAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE AG-1B1 2CUSTOMER CHARGE ($/MONTH)$23.00$23.002 3MAXIMUM DEMAND CHARGE ($/KW/MONTH)3 4 SECONDARY VOLTAGE$9.08$1.864 5 PRIMARY VOLTAGE DISCOUN T$0.94$0.255 6ENERGY CHARGE ($/KWH)$0.18725$0.147386 **************************************************************************************************************************** * 7SCHEDULE AG-RB7 8CUSTOMER CHARGE - RATES B & E ($/MONTH)$23.00$23.008 9METER CHARGE - RATE B ($/MONTH )$6.00$6.009 10METER CHARGE - RATE E ($/MONTH )$1.20$1.2010 11ON-PEAK DEMAND CHARGE ($/KW/MONTH)$2.8311 12MAXIMUM DEMAND CHARGE ($/KW/MONTH)12 13 SECONDARY VOLTAGE$7.48$1.5413 14 PRIMARY VOLTAGE DISCOUN T$0.62$0.2414 15ENERGY CHARGE ($/KWH)15 16 ON-PEAK $0.3657016 17 PART-PEA K$0.1285817 18 OFF-PEAK $0.13657$0.1087818 **************************************************************************************************************************** * 19SCHEDULE AG-VB19 20CUSTOMER CHARGE - RATES B & E ($/MONTH)$23.00$23.0020 21METER CHARGE - RATE B ($/MONTH )$6.00$6.0021 22METER CHARGE - RATE E ($/MONTH )$1.20$1.2022 23ON-PEAK DEMAND CHARGE ($/KW/MONTH)$2.8023 24MAXIMUM DEMAND CHARGE ($/KW/MONTH)24 25 SECONDARY VOLTAGE$7.54$1.5225 26 PRIMARY VOLTAGE DISCOUN T$0.67$0.2326 27ENERGY CHARGE ($/KWH)27 28 ON-PEAK $0.3381528 29 PART-PEA K$0.1270829 30 OFF-PEAK $0.13325$0.1075230 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 AGRICULTURAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE AG-4B1 2CUSTOMER CHARGE - RATES B & E ($/MONTH)$23.00$23.002 3METER CHARGE - RATE B ($/MONTH )$6.00$6.003 4METER CHARGE - RATE E ($/MONTH )$1.20$1.204 5ON-PEAK DEMAND CHARGE ($/KW/MONTH)$3.825 6MAXIMUM DEMAND CHARGE ($/KW/MONTH)6 7 SECONDARY VOLTAGE$7.19$1.667 8 PRIMARY VOLTAGE DISCOUN T$0.76$0.258 9ENERGY CHARGE ($/KWH)9 10 ON-PEAK $0.2198910 11 PART-PEA K$0.1223911 12 OFF-PEAK $0.12222$0.1043112 **************************************************************************************************************************** * 13SCHEDULE AG-4C13 14CUSTOMER CHARGE - RATES C & F ($/MONTH)$64.80$64.8014 15METER CHARGE - RATE C ($/MONTH )$6.00$6.0015 16METER CHARGE - RATE F ($/MONTH )$1.20$1.2016 17DEMAND CHARGE ($/KW/MONTH)17 18 ON-PEAK $9.1218 19 PART-PEA K$1.75$0.4219 20 MAXIMU M$3.79$1.8420 21 PRIMARY VOLTAGE DISCOUN T$1.00$0.2321 22 TRANSMISSION VOLTAGE DISCOUN T22 23 ON-PEAK $4.7923 24 PART-PEA K$0.99$0.4224 25 MAXIMU M$0.18$1.2825 26ENERGY CHARGE ($/KWH)26 27 ON-PEAK $0.2036127 28 PART-PEA K$0.12259$0.1035228 29 OFF-PEAK $0.09423$0.0909029 **************************************************************************************************************************** * 30SCHEDULE AG-5B30 31CUSTOMER CHARGE - RATES B & E ($/MONTH)$36.00$36.0031 32METER CHARGE - RATE B ($/MONTH )$6.00$6.0032 33METER CHARGE - RATE E ($/MONTH )$1.20$1.2033 34ON-PEAK DEMAND CHARGE ($/KW/MONTH)$7.4934 35MAXIMUM DEMAND CHARGE ($/KW/MONTH)35 36 SECONDARY VOLTAGE$11.83$4.6536 37 PRIMARY VOLTAGE DISCOUN T$1.29$0.1537 38 TRANSMISSION VOLTAGE DISCOUN T$8.88$4.0038 39ENERGY CHARGE ($/KWH)39 40 ON-PEAK $0.1634340 41 PART-PEA K$0.0884341 42 OFF-PEAK $0.07318$0.0668742 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 AGRICULTURAL RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE AG-5C1 2CUSTOMER CHARGE - RATES C & F ($/MONTH)$160.00$160.002 3METER CHARGE - RATE C ($/MONTH )$6.00$6.003 4METER CHARGE - RATE F ($/MONTH )$1.20$1.204 5DEMAND CHARGE ($/KW/MONTH)5 6 ON-PEAK $12.616 7 PART-PEA K$2.63$0.687 8 MAXIMU M$4.58$2.868 9 PRIMARY VOLTAGE DISCOUN T$1.86$0.199 10 TRANSMISSION VOLTAGE DISCOUN T10 11 ON-PEAK $7.9011 12 PART-PEA K$1.19$0.6812 13 MAXIMU M$2.60$1.8813 14ENERGY CHARGE ($/KWH)14 15 ON-PEAK $0.1260515 16 PART-PEA K$0.08792$0.0779816 17 OFF-PEAK $0.07372$0.0715217 **************************************************************************************************************************** * 18SCHEDULE AG-ICE18 19CUSTOMER CHARGE ($/MONTH)$40.00$40.0019 20METER CHARGE ($/MONTH)$6.00$6.0020 21ON-PEAK DEMAND CHARGE ($/KW/MO)$2.9521 22MAXIMUM DEMAND CHARGE ($/KW/MO)22 23 SECONDARY$3.80$0.0023 24 PRIMAR Y$3.19$0.0024 25 TRANSMISSION$1.77$0.0025 26ENERGY CHARGE ($/KWH)26 27 ON-PEAK $0.1205927 28 PART-PEA K$0.09405$0.0964728 29 OFF-PEAK $0.04823$0.0482329 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 STREETLIGHTING RATES 3/1/123/1/12 LINERATESRATESLINE NO.SUMMERWINTERNO. **************************************************************************************************************************** * 1SCHEDULE LS-11 2ENERGY CHARGE ($/KWH)$0.12792$0.127922 **************************************************************************************************************************** * 3SCHEDULE LS-23 4ENERGY CHARGE ($/KWH)$0.12792$0.127924 **************************************************************************************************************************** * 5SCHEDULE LS-35 6SERVICE CHARGE ($/METER/MO.)$6.00$6.006 7ENERGY CHARGE ($/KWH)$0.12792$0.127927 **************************************************************************************************************************** * 8SCHEDULE OL-18 9ENERGY CHARGE ($/KWH)$0.13703$0.137039 **************************************************************************************************************************** * Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 ELECTRIC RATES FOR SCHEDULES LS-1, LS-2 AND OL-1 NOMINAL LAMP RATINGS AVERAGE ALL NIGHT RATES PER LAMP PER MONTH HALF-HOUR ADJ. LAMP kWhr PER INITIAL SCHEDULE LS-2 SCHEDULE LS-1 LS-1 & WATTS MONTH LUMENS A C A B C D E F OL-1 LS-2 OL-1 MERCURY VAPOR LAMPS 40 18 1,300 $2.509 -- -- -- -- -- -- -- -- $0.105 -- 50 22 1,650 $3.020 -- -- -- -- -- -- -- -- $0.128 -- 100 40 3,500 $5.323 $7.499 $11.487 -- $9.760 -- -- -- -- $0.233 -- 175 68 7,500 $8.905 $11.081 $15.069 $13.271 $13.342 -- $15.554 $16.608 $15.688 $0.395 $0.424 250 97 11,000 $12.614 $14.790 $18.778 $16.980 $17.051 -- -- -- -- $0.564 -- 400 152 21,000 $19.650 $21.826 $25.814 $24.016 $24.087 -- -- -- $27.199 $0.884 $0.947 700 266 37,000 $34.233 $36.409 $40.397 $38.599 $38.670 -- -- -- -- $1.547 -- 1,000 377 57,000 $48.432 $50.608 -- -- -- -- -- -- -- $2.192 -- INCANDESCENT LAMPS 58 20 600 $2.764 -- $8.928 -- -- -- -- -- -- $0.116 -- 92 31 1,000 $4.172 $6.348 $10.336 -- -- -- -- -- -- $0.180 -- 189 65 2,500 $8.521 $10.697 $14.685 $12.887 -- -- -- -- -- $0.378 -- 295 101 4,000 $13.126 $15.302 $19.290 $17.492 -- -- -- -- -- $0.587 -- 405 139 6,000 $17.987 $20.163 $24.151 -- -- -- -- -- -- $0.808 -- 620 212 10,000 $27.325 $29.501 -- -- -- -- -- -- -- $1.233 -- 860 294 15,000 $37.814 -- -- -- -- -- -- -- -- $1.709 -- LOW PRESSURE SODIUM VAPOR LAMPS 35 21 4,800 $2.892 -- -- -- -- -- -- -- -- $0.122 -- 55 29 8,000 $3.916 -- -- -- -- -- -- -- -- $0.169 -- 90 45 13,500 $5.962 -- -- -- -- -- -- -- -- $0.262 -- 135 62 21,500 $8.137 -- -- -- -- -- -- -- -- $0.361 -- 180 78 33,000 $10.184 -- -- -- -- -- -- -- -- $0.454 -- Exhibit B PACIFIC GAS AND ELECTRIC COMPANY PRESENT ELECTRIC RATES AS OF MARCH 1, 2012 ELECTRIC RATES FOR SCHEDULES LS-1, LS-2 AND OL-1 NOMINAL LAMP RATINGS AVERAGE ALL NIGHT RATES PER LAMP PER MONTH HALF-HOUR ADJ. LAMP kWhr PER INITIAL SCHEDULE LS-2 SCHEDULE LS-1 LS-1 & WATTS MONTH LUMENS A C A B C D E F OL-1 LS-2 OL-1 HIGH PRESSURE SODIUM VAPOR LAMPS AT 120 VOLTS 35 15 2,150 $2.125 -- -- -- -- -- -- -- -- $0.087 -- 50 21 3,800 $2.892 -- -- -- -- -- -- -- -- $0.122 -- 70 29 5,800 $3.916 $6.092 $10.080 -- $8.353 $10.953 $10.565 $11.619 $10.344 $0.169 $0.181 100 41 9,500 $5.451 $7.627 $11.615 -- $9.888 $12.488 $12.100 $13.154 $11.988 $0.238 $0.255 150 60 16,000 $7.881 $10.057 $14.045 -- $12.318 $14.918 $14.530 $15.584 -- $0.349 -- 200 80 22,000 $10.440 -- $16.604 -- $14.877 $17.477 $17.089 $18.143 -- $0.465 -- 250 100 26,000 $12.998 -- $19.162 -- $17.435 $20.035 $19.647 $20.701 -- $0.581 -- 400 154 46,000 $19.906 -- $26.070 -- $24.343 $26.943 $26.555 $27.609 -- $0.895 -- AT 240 VOLTS 50 24 3,800 $3.276 -- -- -- -- -- -- -- -- $0.140 -- 70 34 5,800 $4.555 $6.731 $10.719 -- -- -- -- -- -- $0.198 -- 100 47 9,500 $6.218 $8.394 $12.382 -- $10.655 -- $12.867 $13.921 -- $0.273 -- 150 69 16,000 $9.032 $11.208 $15.196 -- $13.469 -- $15.681 $16.735 -- $0.401 -- 200 81 22,000 $10.568 $12.744 $16.732 -- $15.005 -- $17.217 $18.271 $17.469 $0.471 $0.505 250 100 25,500 $12.998 $15.174 $19.162 -- $17.435 -- $19.647 $20.701 $20.073 $0.581 $0.623 310 119 37,000 $15.428 -- -- -- -- -- -- -- -- $0.692 -- 360 144 45,000 $18.626 -- -- -- -- -- -- -- -- $0.837 -- 400 154 46,000 $19.906 $22.082 $26.070 -- $24.343 -- $26.555 $27.609 $27.473 $0.895 $0.959 METAL HALIDE LAMPS 70 30 5,500 $4.044 -- -- -- -- -- -- -- -- $0.174 -- 100 41 8,500 $5.451 -- -- -- -- -- -- -- -- $0.238 -- 150 63 13,500 $8.265 -- -- -- -- -- -- -- -- $0.366 -- 175 72 14,000 $9.416 -- -- -- -- -- -- -- -- $0.419 -- 250 105 20,500 $13.638 -- -- -- -- -- -- -- -- $0.611 -- 400 162 30,000 $20.929 -- -- -- -- -- -- -- -- $0.942 -- 1,000 387 90,000 $49.711 -- -- -- -- -- -- -- -- $2.250 -- INDUCTION LAMPS 23 9 1,840 $1.357 $0.052 35 13 2,450 $1.869 $0.076 40 14 2,200 $1.997 -- -- -- -- -- -- -- -- $0.081 -- 50 18 3,500 $2.509 $0.105 55 19 3,000 $2.636 -- -- -- -- -- -- -- -- $0.110 -- 65 24 5,525 $3.276 $0.140 70 27 6,500 $3.660 $0.157 80 28 4,500 $3.788 -- -- -- -- -- -- -- -- $0.163 -- 85 30 4,800 $4.044 -- -- -- -- -- -- -- -- $0.174 -- 100 36 8,000 $4.811 $0.209 120 42 8,500 $5.516 -- -- -- -- -- -- -- -- $0.241 -- 135 48 9,450 $6.346 $0.279 150 51 10,900 $6.730 -- -- -- -- -- -- -- -- $0.297 -- 165 58 12,000 $7.625 -- -- -- -- -- -- -- -- $0.337 -- 200 72 19,000 $9.416 $0.419 Energy Rate @ $0.12792 per kwh LS-1 & LS-2 $0.13703 per kwh OL-1 Pole Painting Charge @ $0.000 Per Pole Per Month Exhibit B ALL NIGHT RATES HALF-HOUR Lamp Average kWh PER LAMP ADJUSTMENT ALL NIGHT RATES Watts Per Month PER MONTH PER LAMP PER MONTH LS-2A LS-1A, C, E, F & LS-2A LS-1A LS-1C LS-1E LS-1F 0.0-5.0 0.9 $0.321 $0.005 $6.485 $4.758 $6.970 $8.024 5.1-10.0 2.6 $0.539 $0.015 $6.703 $4.976 $7.188 $8.242 10.1-15.0 4.3 $0.756 $0.025 $6.920 $5.193 $7.405 $8.459 15.1-20.0 6.0 $0.974 $0.035 $7.138 $5.411 $7.623 $8.677 20.1-25.0 7.7 $1.191 $0.045 $7.355 $5.628 $7.840 $8.894 25.1-30.0 9.4 $1.408 $0.055 $7.572 $5.845 $8.057 $9.111 30.1-35.0 11.1 $1.626 $0.065 $7.790 $6.063 $8.275 $9.329 35.1-.40.0 12.8 $1.843 $0.074 $8.007 $6.280 $8.492 $9.546 40.1-45.0 14.5 $2.061 $0.084 $8.225 $6.498 $8.710 $9.764 45.1-50.0 16.2 $2.278 $0.094 $8.442 $6.715 $8.927 $9.981 50.1-55.0 17.9 $2.496 $0.104 $8.660 $6.933 $9.145 $10.199 55.1-60.0 19.6 $2.713 $0.114 $8.877 $7.150 $9.362 $10.416 60.1-65.0 21.4 $2.943 $0.124 $9.107 $7.380 $9.592 $10.646 65.1-70.0 23.1 $3.161 $0.134 $9.325 $7.598 $9.810 $10.864 70.1-75.0 24.8 $3.378 $0.144 $9.542 $7.815 $10.027 $11.081 75.1-80.0 26.5 $3.596 $0.154 $9.760 $8.033 $10.245 $11.299 80.1-85.0 28.2 $3.813 $0.164 $9.977 $8.250 $10.462 $11.516 85.1-90.0 29.9 $4.031 $0.174 $10.195 $8.468 $10.680 $11.734 90.1-95.0 31.6 $4.248 $0.184 $10.412 $8.685 $10.897 $11.951 95.1-100.0 33.3 $4.466 $0.194 $10.630 $8.903 $11.115 $12.169 100.1-105.1 35.0 $4.683 $0.204 $10.847 $9.120 $11.332 $12.386 105.1-110.0 36.7 $4.901 $0.213 $11.065 $9.338 $11.550 $12.604 110.1-115.0 38.4 $5.118 $0.223 $11.282 $9.555 $11.767 $12.821 115.1-120.0 40.1 $5.336 $0.233 $11.500 $9.773 $11.985 $13.039 120.1-125.0 41.9 $5.566 $0.244 $11.730 $10.003 $12.215 $13.269 125.1-130.0 43.6 $5.783 $0.254 $11.947 $10.220 $12.432 $13.486 130.1-135.0 45.3 $6.001 $0.263 $12.165 $10.438 $12.650 $13.704 135.1-140.0 47.0 $6.218 $0.273 $12.382 $10.655 $12.867 $13.921 140.1-145.0 48.7 $6.436 $0.283 $12.600 $10.873 $13.085 $14.139 145.1-150.0 50.4 $6.653 $0.293 $12.817 $11.090 $13.302 $14.356 150.1-155.0 52.1 $6.871 $0.303 $13.035 $11.308 $13.520 $14.574 155.1-160.0 53.8 $7.088 $0.313 $13.252 $11.525 $13.737 $14.791 160.1-165.0 55.5 $7.306 $0.323 $13.470 $11.743 $13.955 $15.009 165.1-170.0 57.2 $7.523 $0.333 $13.687 $11.960 $14.172 $15.226 170.1-175.0 58.9 $7.740 $0.342 $13.904 $12.177 $14.389 $15.443 175.1-180.0 60.6 $7.958 $0.352 $14.122 $12.395 $14.607 $15.661 180.1-185.0 62.4 $8.188 $0.363 $14.352 $12.625 $14.837 $15.891 185.1-190.0 64.1 $8.406 $0.373 $14.570 $12.843 $15.055 $16.109 PRESENT ELECTRIC RATES FOR LIGHT EMITTING DIODE (LED) LAMPS NOMINAL LAMP RATINGS PACIFIC GAS AND ELECTRIC COMPANY AS OF MARCH 1, 2012 Exhibit B ALL NIGHT RATES HALF-HOUR Lamp Average kWh PER LAMP ADJUSTMENT ALL NIGHT RATES Watts Per Month PER MONTH PER LAMP PER MONTH LS-2A LS-1A, C, E, F & LS-2A LS-1A LS-1C LS-1E LS-1F PRESENT ELECTRIC RATES FOR LIGHT EMITTING DIODE (LED) LAMPS NOMINAL LAMP RATINGS PACIFIC GAS AND ELECTRIC COMPANY AS OF MARCH 1, 2012 190.1-195.0 65.8 $8.623 $0.383 $14.787 $13.060 $15.272 $16.326 195.1-200.0 67.5 $8.841 $0.393 $15.005 $13.278 $15.490 $16.544 200.1-205.0 69.2 $9.058 $0.402 $15.222 $13.495 $15.707 $16.761 205.1-210.0 70.9 $9.276 $0.412 $15.440 $13.713 $15.925 $16.979 210.1-215.0 72.6 $9.493 $0.422 $15.657 $13.930 $16.142 $17.196 215.1-220.0 74.3 $9.710 $0.432 $15.874 $14.147 $16.359 $17.413 220.1-225.0 76.0 $9.928 $0.442 $16.092 $14.365 $16.577 $17.631 225.1-230.0 77.7 $10.145 $0.452 $16.309 $14.582 $16.794 $17.848 230.1-235.0 79.4 $10.363 $0.462 $16.527 $14.800 $17.012 $18.066 235.1-240.0 81.1 $10.580 $0.472 $16.744 $15.017 $17.229 $18.283 240.1-245.0 82.9 $10.811 $0.482 $16.975 $15.248 $17.460 $18.514 245.1-250.0 84.6 $11.028 $0.492 $17.192 $15.465 $17.677 $18.731 250.1-255.0 86.3 $11.245 $0.502 $17.409 $15.682 $17.894 $18.948 255.1-260.0 88.0 $11.463 $0.512 $17.627 $15.900 $18.112 $19.166 260.1-265.0 89.7 $11.680 $0.522 $17.844 $16.117 $18.329 $19.383 265.1-270.0 91.4 $11.898 $0.531 $18.062 $16.335 $18.547 $19.601 270.1-275.0 93.1 $12.115 $0.541 $18.279 $16.552 $18.764 $19.818 275.1-280.0 94.8 $12.333 $0.551 $18.497 $16.770 $18.982 $20.036 280.1-285.0 96.5 $12.550 $0.561 $18.714 $16.987 $19.199 $20.253 285.1-290.0 98.2 $12.768 $0.571 $18.932 $17.205 $19.417 $20.471 290.1-295.0 99.9 $12.985 $0.581 $19.149 $17.422 $19.634 $20.688 295.1-300.0 101.6 $13.203 $0.591 $19.367 $17.640 $19.852 $20.906 300.1-305.0 103.4 $13.433 $0.601 $19.597 $17.870 $20.082 $21.136 305.1-310.0 105.1 $13.650 $0.611 $19.814 $18.087 $20.299 $21.353 310.1-315.0 106.8 $13.868 $0.621 $20.032 $18.305 $20.517 $21.571 315.1-320.0 108.5 $14.085 $0.631 $20.249 $18.522 $20.734 $21.788 320.1-325.0 110.2 $14.303 $0.641 $20.467 $18.740 $20.952 $22.006 325.1-330.0 111.9 $14.520 $0.651 $20.684 $18.957 $21.169 $22.223 330.1-335.0 113.6 $14.738 $0.661 $20.902 $19.175 $21.387 $22.441 335.1-340.0 115.3 $14.955 $0.670 $21.119 $19.392 $21.604 $22.658 340.1-345.0 117.0 $15.173 $0.680 $21.337 $19.610 $21.822 $22.876 345.1-350.0 118.7 $15.390 $0.690 $21.554 $19.827 $22.039 $23.093 350.1-355.0 120.4 $15.608 $0.700 $21.772 $20.045 $22.257 $23.311 355.1-360.0 122.1 $15.825 $0.710 $21.989 $20.262 $22.474 $23.528 360.1-365.0 123.9 $16.055 $0.720 $22.219 $20.492 $22.704 $23.758 365.1-370.0 125.6 $16.273 $0.730 $22.437 $20.710 $22.922 $23.976 370.1-375.0 127.3 $16.490 $0.740 $22.654 $20.927 $23.139 $24.193 375.1-380.0 129.0 $16.708 $0.750 $22.872 $21.145 $23.357 $24.411 380.1-385.0 130.7 $16.925 $0.760 $23.089 $21.362 $23.574 $24.628 385.1-390.0 132.4 $17.143 $0.770 $23.307 $21.580 $23.792 $24.846 Exhibit B ALL NIGHT RATES HALF-HOUR Lamp Average kWh PER LAMP ADJUSTMENT ALL NIGHT RATES Watts Per Month PER MONTH PER LAMP PER MONTH LS-2A LS-1A, C, E, F & LS-2A LS-1A LS-1C LS-1E LS-1F PRESENT ELECTRIC RATES FOR LIGHT EMITTING DIODE (LED) LAMPS NOMINAL LAMP RATINGS PACIFIC GAS AND ELECTRIC COMPANY AS OF MARCH 1, 2012 390.1-395.0 134.1 $17.360 $0.780 $23.524 $21.797 $24.009 $25.063 395.1-400.0 135.8 $17.578 $0.790 $23.742 $22.015 $24.227 $25.281 EXHIBIT C Line No. Electric Operations Gas Operations Total Utility Operations 1Operating Revenue10,272,4433,341,76213,614,205 2Operation Expenses6,199,6322,187,0528,386,685 3Maintenance Expenses600,193141,615741,808 4Depreciation Expense1,003,133337,6961,340,829 5Amort & Depletion of Utility Plant139,78534,667174,452 6Regulatory Debits000 7(Less) Regulatory Credits000 8Taxes Other Than Income Taxes286,25678,601364,858 9Federal Income Taxes506,609153,970660,579 10State Income Taxes71,73637,977109,713 11(Less) Gains from Disp of Utility Plant(1,190)(351)(1,541) 12Losses from Utility Plant000 13(Less) Gains from Disposition Utility Plant(18)0(18) 14Operating Income1,466,307370,5341,836,840 15Weighted Average Rate Base16,721,2314,531,85821,253,089 16Rate of Return8.77%8.18%8.64% (000$) PACIFIC GAS AND ELECTRIC COMPANY ALL OPERATING DEPARTMENTS REVENUES, EXPENSES, RATE BASES AND RATES OF RETURN YEAR 2010 RECORDED ADJUSTED FOR RATEMAKING EXHIBIT D 1 SERVICE OF NOTICE OF APPLICATION In accordance with Rule 3.2(b), Applicant will mail a notice to the following, stating in general terms its proposed change in rates. State of California To the Attorney General and the Department of General Services. State of California Office of Attorney General 1300 I St Ste 1101 Sacramento, CA 95814 and Department of General Services Office of Buildings & Grounds 505 Van Ness Avenue, Room 2012 San Francisco, CA 94102 Counties To the County Counsel or District Attorney and the County Clerk in the following counties: Alameda Alpine Amador Butte Calaveras Colusa Contra Costa El Dorado Fresno Glenn Humboldt Kern Kings Lake Lassen Madera Marin Mariposa Mendocino Merced Modoc Monterey Napa Nevada Placer Plumas Sacramento San Benito San Bernardino San Francisco San Joaquin San Luis Obispo San Mateo Santa Barbara Santa Clara Santa Cruz Shasta Sierra Siskiyou Solano Sonoma Stanislaus Sutter Tehama Trinity Tulare Tuolumne Yolo Yuba 2 Municipal Corporations To the City Attorney and the City Clerk of the following municipal corporations: Alameda Albany Amador City American Canyon Anderson Angels Antioch Arcata Arroyo Grande Arvin Atascadero Atherton Atwater Auburn Avenal Bakersfield Barstow Belmont Belvedere Benicia Berkeley Biggs Blue Lake Brentwood Brisbane Buellton Burlingame Calistoga Campbell Capitola Carmel Ceres Chico Chowchilla Citrus Heights Clayton Clearlake Cloverdale Clovis Coalinga Colfax Colma Colusa Concord Corcoran Corning Corte Madera Cotati Cupertino Daly City Danville Davis Del Rey Oakes Dinuba Dixon Dos Palos Dublin East Palo Alto El Cerrito Elk Grove Emeryville Escalon Eureka Fairfax Fairfield Ferndale Firebaugh Folsom Fort Bragg Fortuna Foster City Fowler Fremont Fresno Galt Gilroy Gonzales Grass Valley Greenfield Gridley Grover Beach Guadalupe Gustine Half Moon Bay Hanford Hayward Healdsburg Hercules Hillsborough Hollister Hughson Huron Ione Isleton Jackson Kerman King City Kingsburg Lafayette Lakeport Larkspur Lathrop Lemoore Lincoln Live Oak Livermore Livingston Lodi Lompoc Loomis Los Altos Los Altos Hills Los Banos Los Gatos Madera Manteca Maricopa Marina Martinez Marysville McFarland Mendota Menlo Park Merced Mill Valley Millbrae 3 Milpitas Modesto Monte Sereno Monterey Moraga Morgan Hill Morro Bay Mountain View Napa Newark Nevada City Newman Novato Oakdale Oakland Oakley Orange Cove Orinda Orland Oroville Pacific Grove Pacifica Palo Alto Paradise Parlier Paso Robles Patterson Petaluma Piedmont Pinole Pismo Beach Pittsburg Placerville Pleasant Hill Pleasanton Plymouth Point Arena Portola Portola Valley Rancho Cordova Red Bluff Redding Redwood City Reedley Richmond Ridgecrest Rio Dell Rio Vista Ripon Riverbank Rocklin Rohnert Park Roseville Ross Sacramento Saint Helena Salinas San Anselmo San Bruno San Carlos San Francisco San Joaquin San Jose San Juan Bautista San Leandro San Luis Obispo San Mateo San Pablo San Rafael San Ramon Sand City Sanger Santa Clara Santa Cruz Santa Maria Santa Rosa Saratoga Sausalito Scotts Valley Seaside Sebastopol Selma Shafter Shasta Lake Soledad Solvang Sonoma Sonora 4 South San Francisco Stockton Suisun City Sunnyvale Sutter Creek Taft Tehama Tiburon Tracy Trinidad Turlock Ukiah Union City Vacaville Vallejo Victorville Walnut Creek Wasco Waterford Watsonville West Sacramento Wheatland Williams Willits Willows Windsor Winters Woodland Woodside Yountville Yuba City"
  }
]